#NAME	"Нямецка-беларускі слоўнік"
#INDEX_LANGUAGE	"German"
#CONTENTS_LANGUAGE	"Belarusian"

{[']}a{[/']}alglatt
	[m1][p]a[/p] сл[']і[/']зкі як вуг[']о[/']р; выкр[']у[/']тлівы[/m]

abridg{(}e{)}ment
abridg{(e)}ment
	[t]\[†'brэ‹m†nt\][/t]
	[m1][i][c][com]n.[/com][/c][/i][/m]
	[m1]1) [trn]скарач[']э[/']ньне[/trn] [i][c][com]n.[/com][/c][/i][/m]
	[m1]2) [trn]зьм[']е[/']ншаньне, абмежав[']а[/']ньне[/trn] [i][c][com]n.[/com][/c][/i][/m]
	[m2][*][ex]an abridgment of liberties — абмежав[']а[/']ньне сваб[']о[/']даў[/ex][/*][/m]
ВКП\(б\)
	[m1][b][c darkblue]ВКП(б)[/c][/b] [p]ист.[/p] \[[b]Усеса[']ю[/']зная Камуніст[']ы[/']чная п[']а[/']ртыя (бальшавік[']о[/']ў)[/b]\] ВКП(б) \[Всесо[']ю[/']зная Коммунист[']и[/']ческая п[']а[/']ртия (большевик[']о[/']в)\]

