#NAME	"Нямецка-беларускі слоўнік"
#INDEX_LANGUAGE	"German"
#CONTENTS_LANGUAGE	"Belarusian"

{[']}a{[/']}alglatt
	[m1][p]a[/p] сл[']і[/']зкі як вуг[']о[/']р; выкр[']у[/']тлівы[/m]

abridg{(}e{)}ment
abridg{(e)}ment
	[t]\[†'brэ‹m†nt\][/t]
	[m1][i][c][com]n.[/com][/c][/i][/m]
	[m1]1) [trn]скарач[']э[/']ньне[/trn] [i][c][com]n.[/com][/c][/i][/m]
	[m1]2) [trn]зьм[']е[/']ншаньне, абмежав[']а[/']ньне[/trn] [i][c][com]n.[/com][/c][/i][/m]
	[m2][*][ex]an abridgment of liberties — абмежав[']а[/']ньне сваб[']о[/']даў[/ex][/*][/m]
ВКП\(б\)
	[m1][b][c darkblue]ВКП(б)[/c][/b] [p]ист.[/p] \[[b]Усеса[']ю[/']зная Камуніст[']ы[/']чная п[']а[/']ртыя (бальшавік[']о[/']ў)[/b]\] ВКП(б) \[Всесо[']ю[/']зная Коммунист[']и[/']ческая п[']а[/']ртия (большевик[']о[/']в)\]

{(the) }Milky Way
{(}the{)} Milky Way
	[m1][trn]Мл[']е[/']чны шлях; Птуш[']ы[/']ная дар[']о[/']га[/trn][/m]
вярхоўны
Вярхоўны Савет БССР
Вярхоўны Суд БССР
	[m1][b][c darkblue]вярх[']о[/']ўны,[/c][/b][c brown] ‑ая, ‑ае.[/c]
	[m2]Галоўны. [ex]Вярхоўны галоўнакамандуючы. Вярхоўны заканадаўчы орган.[/ex]
	[m2]•••
	[m2][b][ex][lang id=1049][c steelblue]Вярхоўны Савет БССР[/c][/lang][/ex][/b] — найвышэйшы заканадаўчы орган дзяржаўнай улады БССР.
	[m2][b][ex][lang id=1049][c steelblue]Вярхоўны Суд БССР[/c][/lang][/ex][/b] — найвышэйшы судовы орган БССР.

абняць
\(як\) вокам \(зрокам, позіркам\) абняць
	[m1][b][c darkblue]абня́ць[/c][/b], [c brown]абніму, абнімеш, абніме і [p]([/p][p]радзей[/p][p])[/p] абдыму, абдымеш, абдыме; [p]зак.[/p], [p]каго-што[/p].[/c]
	[m2][b]1.[/b] Абхапіць рукамі каго‑, што‑н. [ex]Маці абняла свайго сына і пачала яго цалаваць.[/ex] [i][c midnightblue][p]Чарнышэвіч[/p][/c][/i][i][c midnightblue].[/c][/i] [ex]Калі паляўнічы пайшоў, Санька абняў Мурзу за шыю і прытуліўся да яго галавы шчакою.[/ex] [i][c midnightblue][p]Ваданосаў[/p][/c][/i][i][c midnightblue].[/c][/i] [ex]Любімыя змалку прасторы Рукамі абняў бы Максім.[/ex] [i][c midnightblue][p]Аўрамчык[/p][/c][/i][i][c midnightblue].[/c][/i] [b][c crimson][p]//[/p][/c][/b] Акінуць позіркам, поглядам. [ex]Не хапае ні сілы, Ні маіх задумёных вачэй Стэп абняць І палі залацістыя Спелай пшаніцы.[/ex] [i][c midnightblue][p]Хведаровіч[/p][/c][/i][i][c midnightblue].[/c][/i]
	[m2]•••
	[m2][b][ex][lang id=1049][c steelblue](Як) вокам (зрокам, позіркам) абняць[/c][/lang][/ex][/b] — вельмі далёкі, як толькі можна ўбачыць.
