#NAME	"Abbrev"
#INDEX_LANGUAGE	"Belarusian"
#CONTENTS_LANGUAGE	"Belarusian"

ст.-
	старажытна...
азоўск.
	азоўскае
алб.-тоск.
	албанска-тоскскае
асір.-вавіл.
	асірыйска-вавілонскае
асм.
	асманскае
астрах.
	астраханскае
аўгуст.
	аўгустоўскае
аўстр.-ням.
	аўстрыйска-нямецкае
ацтэк.
	ацтэкскае
балк.-лац.
	балкана-лацінскае
балт.-ням.
	балта-нямецкае
баран.
баранав.
	баранавіцкае
баснійск.
	баснійскае
бел.-укр.
	беларуска-ўкраінскае
бібл.-гебр.
	біблейска-гебрайскае
бягом.
	бягомльскае
бялудж.
	бялуджскае
бялын.
	бялыніцкае
в.-ням.
	верхненямецкае
вал.
	валійскае, гл. кімр., уэл.
валгагр.
	валгаградскае
васіл.
	васілевічскае
велікарус.
	велікарускае
венец.
	венецыянскае
ветк.
	веткаўскае
візант.-грэч.
	візантыйска-грэчаскае
волжск.
	волжскае
гала.-раманск.
	галараманскае
ганц.
	ганцавіцкае
гарадн.
	гараднянскае
гебр.
	гебрайскае, гл. семіц., яўр.
гегск.
	гегскае
герцагавін.
	герцагавінскае
градзішч.
	градзішчанскае
груз.
	грузінскае
д.-гарад.
	давід-гарадоцкае
далмацінск.
	далмацінскае
даўг.
	даўгаўпілскае
дрыб.
	дрыбінскае
дуброўн.
	дуброўніцкае
ельск.
	ельскае
еніс.
	енісейскае
жабін.
	жабінкаўскае
жамойц.
	жамойцкае
забайкальск.
	забайкальскае
зах.-бел.
	заходнебеларускае
зах.-бранск.
	заходнебранскае
зах.-гом.
	заходнегомельскае
івац.
	івацэвіцкае
ігум.
	ігуменскае
ід.
	ідыш
істр.
	істраўскае
іўеў.
	іўеўскае
іўр.
	іўрыт
іян.
	іянічнае
каракалп.
	калакалпацкае
карнуэлск.
	карнуэлскае
кацеўск.
	кацеўскае
кіёўск.
	кіёўскае (Чэхія)
кліч.
	клічаўскае
кольск.
	кольскае
косава-мятох.
	косава-мятохскае
красл.
	краслаўскае
краснап.
	краснапольскае
красняр.
	краснаярскае
кругл.
	круглянскае
крэўск.
	крэўскае
куман.
	куманскае
кялецк.
	кялецкае
лац.-гальск.
	лацінскагальскае
лудз.
	лудзенскае
льв.
	львоўскае
люб.
	любанскае
ням.
	нямецкае
малайск.
	малайскае
малапольск.
	малапольскае
манс.
	мансійскае
мар.-славац.
	мараўска-славацкае
марыйск.
	марыйскае
мглін.
	мглінскае
мекс.
	мексіканскае
мёрск.
міёрск.
	мёрскае (міёрскае)
мір.
	мірскае
мсцісл.
	мсціслаўскае
н.-дан.
	ніжнеданское
навазыбк.
	навазыбкаўскае
наг.
	нагайскае
ненец.
	ненецкае
нованям.
	нованямецкае
новаперс.
	новаперсідскае
падзв.
	падзвінскае
падляш.
	падляшскае
падмаск.
	падмаскоўнае
паўд.-чэш.
	паўднёвачэшскае
паўн.-віц.
	паўночнавіцебскае
паўн.-дзвін.
	паўночнадзвінскае
паўн.-рус.
	паўночнарускае
паўн.-усх.-бел.
	паўночна-ўсходне-беларускае
пін.
	пінскае
пірдоп.
	пірдопскае
позналац.
	позналацінскае
пра-і.-е.
	праіндаеўрапейскае
прынёманск.
	прынёманскае
прычарн.
	прычарнаморскае
радашк.
	радашковіцкае
радун.
	радунскае
ров.
	ровенскае
с.-англ.
	сярэднеанглійскае
с.-балг.
	сярэднебалгарскае
с.-брэтонск.
	сярэднебрэтонскае
с.-гебр.
	сярэднегебрайскае
с.-тур.
	сярэднетурэцкае
сакол.
	сакольскае
салун.
	салунскае
самак.
	самакаўскае
свісл.
	свіслацкае
себеж.
	себежскае
сейненск.
	сейненскае
смарг.
	смаргонскае
ст.-булг.
	старабулгарскае
ст.-дац.
	старажытнадацкае
ст.-нарв.
	старажытнанарвежскае
ст.-славен.
	стараславенскае
ст.-уйг.
	стараўкраінскае
ст.-франк.
	старажытнафранкскае
ст.-фрыз.
	старажытнафрызскае
ст.-чув.
	старажытначувашскае
ст.-швед.
	старажытнашведскае
трак.
трок.
	тракайскае (трокскае)
усх.-літ.
	усходнелітоўскае
усх.-сіб.
	усходнесібірскае
ушац.
	ушацкае
фін.-угор.
	фінаўгорскае
флам.
	фламандскае
фурл.
	фурланскае
ханты-мансійск.
	ханты-манскійскае
хец.-лув.
	хецка-лувійскае
ходск.
	ходскае
хоцім.
	хоцімскае
ц.-палес.
	цэнтральнапалескае
цімак.
	цімакскае
цірольск.
	цірольскае
цыган.
	цыганскае
цэнтр.
	цэнтральнае
цюрк.-манг.
	цюркска-мангольскае
чавус.
	чавускае
чач.
	чачэрскае
шатл.
	шатландскае
швейц.-ням.
	швейцарска-нямецкае
шуміл.
	шумілінскае
эвен.
	эвенкійскае
якуц.
	якуцкае
япон.
	японскае
яўр.
	яўрэйскае, гл. гебр., семіц.
аг.-бел.
	агульнабеларускае
акц.
	акцябрскае
арум.
	арумынскае
арх.
	архаічнае
валаш.
	валашскае
вепск.
	вепскае
вод.
	водскае
вял.-польск.
	вялікапольскае
дыял.
	дыялектнае
івян.
	івянецкае
кірг.
	кіргізскае
клец.
	клецкае
ковен.
	ковенскае
курд.
	курдскае
лемк.
	лемкаўскае
мард.
	мардоўскае
нова-в.-ням.
	новаверхненямецкае
охрыд.
	охрыдскае
пазн.
	пазнанскае
плешч.
	плешчаніцкае
рэз'ян.
	рэз'янскае
с.-
	сярэдне-…
свянц.
	свянцянскае
сен.
	сенненскае
скідз.
	скідзельскае
сміл.
	смілавіцкае
ст.-рус.
	старарускае
ст.-сакс.
	старажытнасаксонскае
стараж.-рус.
	старажытнарускае
стрэш.
	стрэшынскае
сядл.
	сядлецкае
табол.-тат.
	табольскае-татарскае
таіц.
	таіцянскае

удм.
	удмурцкае
халоп.
	халопеніцкае
чарнаг.
	чарнагорскае
шток.
	штокаўскае

бурац.
	бурацкае
вацяцк.
	вацяцкае
вед.
	ведыйскае
веліж.
	веліжскае
венецк.
	венецкае
дзевяніш.
	дзевянішскае
жмуд.
	жмудскае
іванаўск.
	іванаўскае (Расія)
інд.-іран.
	індаіранскае
калм.
	калмыцкае
капатк.
	капаткевіцкае
копц.
	копдкае
лігур.
	лігурыйскае
ляш.
	ляшскае
парт.
	партугальскае
рудзен.
	рудзенскае
саам.
	саамскае
серб.-ц.-слав.
	сербска-царкоўнаславянскае
славін.-каш.
	славінска-кашубскае
славон.
	што і славонск.
ст.-егіпец.
	старажытнаегіпецкае
ст.-сканд.
	старажытнаскандынаўскае
ст.-славац.
	стараславацкае
табол.
	табольскае
чашн.
	чашніцкае
а.-англ.
	амерыканска-англійскае
авест.
	авестыйскае
амур.
	амурскае
арам.
	арамунскае
асір.
	асірыйскае
ашм.
	ашмянскае
б.-каш.
	буда-кашалёўскае
віл.
	вілейскае
волх.
	волхаўскае
воран.
	воранаўскае
вяц.
	вяцкае
гарад.
	гарадоцкае
гэльск.
	гэльскае
глус.
	глускае
дзвін.
	дзвінскае
добр.
	добрушскае
дубр.
	дубровенскае
жэмайц.
	жэмайцкае
іван.
	іванаўскае
іран.
	іранскае
йонаўск.
	йонаўскае
калінк.
	калінкавіцкае
карм.
	кармянскае
карп.
	карпацкае
карэл.
	карэльскае
касцюк.
	касцюковіцкае
кімр.
	кімрскае, гл. вал., уэл.
кір.
	кіраўскае (Расія)
клім.
	клімавіцкае
крыч.
	крычаўскае
ленінгр.
	ленінградскае
леп.
	лепельскае
лёзн.
	лёзненскае
літар.
	літаратурнае
ліўск.
	ліўскае
лоеў.
	лоеўскае
мазав.
	мазавецкае
малд.
	малдаўскае
маст.
	мастоўскае
мундж.
	мунджанскае
новасіб.
	новасібірскае
оск.
	оскскае
падг.
	падгальскае
паст.
	пастаўскае
пецярб.
	пецярбургскае
пін.
	пінскае
пракр.
	пракрыцкае
прэйл.
	прэйльскае
прыбалт.
	прыбалтыйскае
пух.
	пухавіцкае
раст.
	растоўскае
сабін.
	сабінскае
сагдз.
	сагдзійскае
светлаг.
	светлагорскае
свісл.
	свіслацкае
ст.-дар.
	старадарожскае
сувалк.
	сувалкійскае
сям.
	сяміцкае
талач.
	талачынскае
тамб.
	тамбоўскае
тахар.
	тахарскае (А, В)
тахар. A
	
тахарскае (А)
тахар. B
	тахарскае (В)
тырн.
тырнаўск.
	тырнаўскае
урал.
	уральскае
уст.
	устарэлае
усх.-слав.
	усходнеславянскае
фалькл.
	фальклорнае
фрак.
	фракійскае
чэрв.
	чэрвеньскае
шчуч.
	шчучынскае
этрус.
	этрускае

англа.-сакс.
	англасаксонскае
арэнб.
	арэнбургскае
беламор.
	беламорскае
брэтонск.
	брэтонскае
валож.
	валожынскае
гарадоцк.
	гарадоцкае
eнic.
	енісейскае
калым.
	калымскае
кіраў.
кіраўск.
	кіраўскае (Беларусь)
кіт.
	кітайскае
нідэр.
нідэрл.
	нідэрландскае, гл. гал.
праванс.
	правансальскае
пячор.
	пячорскае
рэтарам.
	рэтараманскае
с.-ірл.
	сярэднеірландскае
семіц.
	семіцкае, гл. гебр., яўр.
сімб.
	сімбірскае
стаўрап.
	стаўрапольскае
тах.
	тахарскае
тульск.
	тульскае
уральск.
	уральскае

алт.
	алтайскае
анеж.
	анежскае
апоч.
	апочкаўскае
арамей.
	арамейскае
болх.
	болхаўскае
валд.
	валдайскае
в.-дзв.
	верхнядзвінскае
варм.-мазур.
	вармійска-мазурскае
вышегар.
	вышагародскае
вышневал.
	вышневалоцкае
гдоўск.
	гдоўскае
горыц.
	горыцкае
джагатайск.
	джагатайскае
дрыс.
	дрысенскае
духав.
	духавішчанскае
ельн.
	ельнінскае
жыздр.
	жыздрынскае
ігн.
	ігналінскае
іркуц.
	іркуцкае
кадн.
	каднікаўскае
кам.
	камянецкае
кемер.
	кемераўскае
крак.
	кракаўскае
круп.
	крупскае
кубан.
	кубанскае
куйбыш.
	куйбышаўскае
міргар.
	міргародскае
мяшч.
	мяшчоўскае
новарас.
	новарасійскае
рас.
	расонскае
росл.
	рослаўскае
салікам.
	салікамскае
сарат.
	саратаўскае
сілез.
	сілезскае
соль-ілецк.
	соль-ілецкае
тагільск.
	тагільскае
том.
	томскае
трубч.
	трубчэўскае
ульян.
	ульянаўскае
халм.
	халмагорскае
харк.
	харкаўскае
хэлм.-дабж.
	хэлмска-дабжынскае
церск.
	церскае
чарап.
	чарапавецкае
чарнамор.
	чарнаморскае
чкалаўск.
	чкалаўскае
чырв.
	чырвонаслабодскае
шальч.
	шальчынінскае
швянч.
	швянчонскае
шуйск.
	шуйскае

адэс.
	адэскае
агульнаслав.
	агульнаславянскае
азерб.
	азербайджанскае
алан.
алон.
	аланецкае
алб.
	албанскае
англ.
	англійскае
араб.
	арабскае
арг.
	аргатычнае
арл.
	арлоўскае
арм.
	армянскае
арханг.
	архангельскае
арш.
	аршанскае
асец.
	асецінскае
асіп.
	асіповіцкае
асташ.
	асташкаўскае
астрав.
	астравецкае
афг.
	афганскае
бабр.
	бабруйскае
бавар.
	баварскае
балг.
	балгарскае
балкар.
	балкарскае
балт.
	балтыйскае
балта-слав.
	балтаславянскае
барыс.
	барысаўскае
баш.
	башкірскае
бел.
	беларускае
беласт.
	беластоцкае
бел.-укр.
	беларуска-ўкраінскае
бельск.
	бельскае
бераст.
	берастовіцкае
бесар.
	бесарабскае
беш.
	бешанковіцкае
брагін.
	брагінскае
бранск.
	бранскае
брасл.
	браслаўскае
брэсц.
	брэсцкае
бойк.
	бойкаўскае
бук.
	букавінскае
бых.
	быхаўскае
бяроз.
	бярозаўскае
бярэз.
	бярэзінскае
валаг.
	валагодскае
валын.
	валынскае
варонеж.
	варонежскае
ваўк.
	ваўкавыскае
в.-дзвін.
	верхнядзвінскае
венг.
	венгерскае
візант.
	візантыйскае
вілен.
	віленскае
вільн.
	вільнюскае
віц.
	віцебскае
в.-луж.
	верхнялужыцкае
гал.
	галандскае, гл. нідэрл.
гальск.
	гальскае
герм.
	германскае
глыб.
	глыбоцкае
гом.
	гомельскае
горк.
	горкаўскае
гоц.
	гоцкае
гродз.
	гродзенскае
грэч.
	грэчаскае
гуц.
	гуцульскае
дан.
	данское
дар.
	дарыйскае
дац.
	дацкае
дзісн.
	дзісненскае
дзярж.
	дзяржынскае
дзятл.
	дзятлаўскае
докш.
	докшыцкае
драг.
	драгічынскае
жлоб.
	жлобінскае
жыт.
	жыткавіцкае
жытом.
	жытомірскае
закарп.
	закарпацкае
зах.
	заходняе
зах.-еўрап.
	заходнееўрапейскае
зах.-палес.
	заходнепалескае
зах.-слав.
	заходнеславянскае
зах.-укр.
	заходнеўкраінскае
зэльв.
	зэльвенскае
і.-е.
	індаеўрапейскае
ілір.
	ілірыйскае
ірл.
	ірландскае
ісп.
	іспанскае
іт.
	італійскае
італ.
	італьянскае
казах.
	казахскае
каз.-тат.
	казанска-татарскае
казял.
	казялецкае
кайк.
	кайкаўскае
калін.
	калінінскае
калуж.
	калужскае
капыл.
	капыльскае
караім.
	караімскае
карасц.
	карасценскае
карач.
	карачаеўскае
карэліц.
	карэліцкае
кастр.
	кастрамское
каш.
	кашубскае
кобр.
	кобрынскае
крым.-тат.
	крымскататарскае
кур.
	курскае
кыпч.
	кыпчакскае
лаг.
	лагойскае
лагіш.
	лагішынскае
ламбард.
	ламбардскае
лангаб.
	лангабардскае
лат.
	латышскае
лац.
	лацінскае
лац.-гальск.
	лацінскагальскае
лельч.
	лельчыцкае
лем.
	лемкаўскае
лід.
	лідскае
літ.
	літоўскае
лун.
	лунінецкае
лях.
	ляхавіцкае
маг.
	магілёўскае
мазыр.
	мазырскае
макед.
	македонскае
маладз.
	маладзечанскае
малар.
	маларыцкае
манг.
	мангольскае
мар.
	мараўскае
маск.
	маскоўскае
мін.
	мінскае
мінойск.
	мінойскае
мсцісл.
	мсціслаўскае
мядз.
	мядзельскае
навагр.
	навагрудскае
нарв.
	нарвежскае
нараўл.
	нараўлянскае
нар.-лац.
	народналацінскае
наўг.
	наўгародскае
неж.
	нежынскае
ніжнегар.
	ніжнегародскае
н.-луж.
	ніжнялужыцкае
н.-ням.
	ніжненямецкае
новалац.
	новалацінскае
новагрэч.
	новагрэчаскае
ням.-аўстр.
	нямецка-аўстрыйскае
нясвіж.
	нясвіжскае
палаб.
	палабскае
палес.
	палескае
палт.
	палтаўскае
памор.
	паморскае
парыц.
	парыцкае
паўд.
паўдн.
	паўднёвае
паўд.-зах.
	паўднёва-заходняе
паўд.-рус.
	паўднёварускае
паўд.-слав.
	паўднёваславянскае
паўн.
	паўночнае
паўн.-італ.
	паўночнаітальяйскае
п'емонт.
п'емонц.
	п'емонцкае
пенз.
	пензенскае
перм.
	пермскае
перс.
	персідскае
петрык.
	петрыкаўскае
полац.
	полацкае
польск.
	польскае
прагерм.
	прагерманскае
пракельт.
	пракельтскае
прасл.
праслав.
	праславянскае
протабулг.
	протабулгарскае
пруж.
	пружанскае
прус.
	прускае
прыкарп.
	прыкарпацкае
пск.
	пскоўскае
рагач.
	рагачоўскае
радоп.
	радопскае
разан.
	разанскае
рум.
	румынскае
рус.
	рускае
рус.-ц.-слав.
	рускацаркоўнаславянскае
рэч.
	рэчыцкае
саксон.
	саксонскае
саліг.
	салігорскае
санскр.
	санскрыцкае
с.-в.-ням.
	сярэдняверхненямецкае
с.-вяк.-л.
	сярэдневяковалацінскае
с.-грэч.
	сярэднягрэчаскае
свярдл.
	свярдлоўскае
серб.
	сербскае
серб.-луж.
	сербалужыцкае
серб.-харв.
	сербскахарвацкае
сіб.
	сібірскае
сканд.
	скандынаўскае
слав.
	славянскае
славац.
	славацкае
славен.
	славенскае
славін.
	славінскае
слаўг.
	слаўгарадскае
с.-лац.
	сярэднелацінскае
слонім.
	слонімскае
слуц.
	слуцкае
смал.
	смаленскае
смаляв.
	смалявіцкае
с.-н.-ням.
	сярэдняніжненямецкае
ст.-англ.
	старажытнаанглійскае
ст.-арм.
	старажытнаармянскае
староб.
	старобінскае
стаўб.
	стаўбцоўскае
ст.-бел.
	старабеларускае
ст.-в.-ням.
	старажытнаверхненямецкае
ст.-грэч.
	старажытнагрэчаскае
ст.-інд.
	старажытнаіндыйскае
ст.-іран.
	старажытнаіранскае
ст.-ірл.
	старажытнаірландскае
ст.-ісл.
	старажытнаісландскае
ст.-літ.
	старажытналітоўскае
стол.
	столінскае
ст.-перс.
	старажытнаперсідскае
ст.-польск.
	старажытнапольскае
ст.-прус.
	старажытнапрускае
ст.-серб.
	старажытнасербскае
ст.-серб.-харв.
	старажытнасербскахарвацкае
ст.-слав.
	стараславянскае
ст.-тат.
	старажытнататарскае
ст.-укр.
	старажытнаўкраінскае
ст.-цюрк.
	старажытнацюркскае
ст.-чэш.
	старажытначэшскае
ст.-яўр.
	старажытнаяўрэйскае
сум.
	сумскае
тат.
	татарскае
тат.-баш.
	татарска-башкірскае
тул.
	тульскае
тур.
	турэцкае
тур.-араб.
	турэцка-арабскае
тураў.
	тураўскае
туркм.
	туркменскае
тур.-перс.
	турэцка-персідскае
тыбец.-бірм.
	тыбецка-бірманскае
узб.
	узбекскае
узд.
	уздзенскае
уйг.
	уйгурскае
ўкр.
укр.
	украінскае
уладз.
	уладзімірскае
усх.
	усходняе
усх.-палес.
	усходнепалескае
усх.-прус.
	усходнепрускае
усх.-цюрк.
	усходнецюркскае
уэл.
	уэльскае, гл. вал., кімр.
фін.
	фінскае
франц.
	французскае
франк.
	франкскае
фрыз.
	фрызскае
харв.
	харвацкае
хец.
	хецкае
хойн.
	хойніцкае
цвяр.
	цвярское
ц.-слав.
	царкоўнаславянскае
цюрк.
	цюркскае
чагат.
	чагатайскае
чак.
	чакаўскае
чарніг.
	чарнігаўскае
чув.
	чувашскае
чэрык.
	чэрыкаўскае
чэш.
	чэшскае
шарк.
	шаркаўшчызненскае
швед.
	шведскае
шкл.
	шклоўскае
эст.
	эстонскае
ярасл.
	яраслаўскае
яўр.-ням.
	яўрэйсканямецкае
АБ
	Atlas gwar wschodniosłowiańskich Białostocczyzny. T. 1-. Wrocław [etc.], 1980 i наст.

Аб нек. асабл.
	Аб некаторых асаблівасцях беларускай літаратурнай мовы. Мінск, 1965.

Абабур.
Абабурка, Дыял.
	Абабурка М. В. Дыялектызмы ў творах беларускіх савецкіх пісьменнікаў. Кароткі слоўнік-даведнік. Мінск, 1979.

Абабур. дыс.
	Абабурка М. В. Дыялектная лексіка ў беларускай савецкай мастацкай прозе: дыс. ... канд. філал. навук. Мінск, 1971.

Абаеў
	Абаев В. И. Историко-этимологический словарь осетинского языка. Т. 1-4. М.; Л., 1958-1989.

Абаеў, Осет. язык.
	Абаев В. И. Осетинский язык и фольклор. М.; Л., 1949.

Абрэмб.
	Podręczny słownik polsko-białoruski. Падручны польска-беларускі слоўнік / pod red. A. Obrębskiej-Jabłońskiej i M. Biryły. Warszawa, 1962.

Абрэмбска-Яблонска, Śladami
	Obrębska-Jabłońska A. Śladami żywego języka: wybór pism. Warszawa, 1993.

ABSl
	Acta Baltico-Slavica. Białystok; Warszawa, 1964 i наст.

Агапкіна, Основы
	Агапкина Т. А. Мифопоэтические основы славянского народного календаря. Весенне-летний цикл. М., 2002.

Агіенка, Иноз. элем.
	Огиенко И. И. Иноземные элементы в русском языке: история проникновения заимствованных слов в русский язык. Киев, 1915.

Адамовіч, Мікр. назвы
	Адамовіч Я. Мікратапанімічныя назвы. Мінск, 1971.

Адм.
	Арашонкава Г. У., Чабатар Н. А. Тлумачальны слоўнік адметнай лексікі ў творах Якуба Коласа. Мінск, 2003.

Айкан.
	Лемцюгова В. П. Беларуская айканімія: лінгвістычны аналіз назваў населеных пунктаў Мінскай вобласці. Мінск, 1970.

ALE
	Atlas Linguarum Europea. Vol. I: Premier fascicule. Assen, 1983 i наст.

Александрыя
	Александрыя. Мінск, 1962.

Aling. Hung.
	Acta Linguistica Academiae Scientarum Hungaricae (= A Magyar tudomanyos akademia nyelvtudomanyi Kozlemenyei). Budapest, 1951 i наст.

Альп.
	Ляшкевіч I. Альпенскі дыялектны слоўнік. Альпень; Берасьце, 2004.

Альтбаўэр
Альтбаўэр, The Five
	The Five Biblical Scrolls in a Sixteenth-Century Jewish Translation into Belorussian (Vilnius Codex 262) / With Introduction and Notes by Moshe Altbauer. Jerusalem, 1992.

Аляхн.
	Аляхновіч А. Я. Малы слоўнічак жывой халапеніцкай гаворкі // Малое Палесьсе: гіст.-краязн. літ.-мастац. альманах Друцка-Бярэзінскага краю [2003-2004 гг.]. Крупкі, 2012.

American Contrib. to the 13th Intern. Congr. of Slavists
	American Contribution to the 13th International Congress of Slavists. Vol. 1. Bloomington, 2003.

Аненкаў
	Анненков H. И. Ботанический словарь. СПб., 1878.

Анік.
	Аникиевич К. Т. Сенненский уезд Могилевской губернии. Могилев, 1907.

Анікін
	Аникин А. Е. Этимологический словарь русских диалектов Сибири. Заимствования из уральских, алтайских и палеоазиатских языков. 2-е изд., испр. и доп. М.; Новосибирск, 2000.

Анікін, Опыт
	Аникин А. Е. Опыт словаря лексических балтизмов в русском языке. Новосибирск, 2005.

Анікін, РЭС
	Аникин А. Е. Русский этимологический словарь. Вып. 1-. М., 2007 i наст.

Анікін, Этимология
	Аникин А. Е. Этимология и балто-славянское лексическое сравнение в праславянской лексикографии. Новосибирск, 1998.

Анім.
Анім. дад.
	[Анимелле Н.] Быт белорусских крестьян [Уклад. з дадат. ад іншых карэспанд. К. Д. Кавеліна] // Этнографический сборник. Вып. 2. СПб., 1854.

Аніч., Вопыт
	Анічэнка У. В. Вопыт літаратурна-дыялектнага слоўніка беларускай мовы. Гомель, 1999.

Анох.
	Анохина В. В., Никончук Н. В. Полесская терминология пчеловодства // Лексика Полесья: материалы для полесского диалектного словаря. М., 1968.

Ант.
Ант. бел. нар. песні
Ант. бел. песні
	Анталогія беларускай народнай песні / укл., прадм. i камент. Г. Цітовіча. Мінск, 1975.

Антановіч, дыс.
	Антонович А. К. Язык судебной (актовой) книги Ковенского земского суда 1565-1567 гг.: дис. ... канд. филол. наук. Вильнюс, 1961.

Антропаў, Назв. птиц
	Антропов Н. П. Названия птиц в белорусском языке на общеславянском фоне: дис. ... канд. филол. наук. Минск, 1982.

Анышкевіч, Словник.
	Онишкевич М. И. Словник бойківськйх говірок. Ч. 1-2. Київ, 1984.

Араш. і інш.
	Арашонкава Г. У., Грынавецкене Е. I., Кавальчук I. П., Мацкевіч Ю. Ф., Рамановіч Я. М., Шаталава Л. Ф. З лексікі беларускіх гаворак заходняй зоны // Вес. АН БССР. Сер. грамадскіх навук. № 4. Мінск, 1969.

Арвінска
	Orwińska-Ruziczka Е. Funkcje językowe interiekcji w świetle materiału słowackiego i polskiego. Kraków, 1992.

Ареал. исслед.
	Ареальные исследования в языкознании и этнографии. Л., 1971 i наст.

Арк.
	Аркушин Г. Сказав, як два зв’язав: народні вислови та загадки із Західного Полісся і західної частини Волйні. Люблін; Луцьк, 2003.

АРНГ
	Атлас русских народных говоров центральных областей к востоку от Москвы. М., 1957.

Арол
	Orel V. Russian Etymological Dictionary. Vol. 1-4. [Calgari, 2011].

Арх. Бяльк.
Бяльк. Арх.
	Архіў I. К. Бялькевіча (Цэнтральная навуковая бібліятэка імя Я. Коласа НАН Беларусі). [Гл.: Бялькевіч I. Слоўнік Слонімскага павета // Беларуская дыялекталогія: матэрыялы і даследаванні. Вып. 4. Мінск, 2016.]

Арх. Вяр.
	Вярэніч В. Л. Палескі архіў: лінгвістычныя, этнаграфічныя і гістарычныя матэрыялы. Мінск, 2009.

Арх. ГУ
	Дыялектныя кантрольныя работы па лексіцы і фразеалогіі студэнтаў-завочнікаў Гомельскага дзяржаўнага ўніверсітэта.

Арх. Федар.
	Materiały do słownika białorusko-polskiego, zebrane przez Michała Federowskiego (Бібліятэка Варшаўскага ўніверсітэта).

Архіў БЭЛА
	Архіў «Беларускага фальклорна-этналінгвістычнага атласа» (Інстытут мовазнаўства імя Я. Коласа НАН Беларусі).

Arche
	Arche Пачатак: навуковы, навукова-папулярны і літаратурна-мастацкі часопіс. Мінск, 1998 і наст.

Арыстава, Кантакты
	Аристова В. М. Англо-русские языковые контакты (Англизмы в русском языке). Л., 1978.

Асоўскі, Stud. slawist.
	Ossowski L. Studia slawistyczne. Wrocław [etc.], 1992.

Астравух, Ідыш-бел. сл.
	Астравух А. Ідыш-беларускі слоўнік. Мінск, 2008.

Астрэйка, АКД
	Астрэйка В. Д. Паўночна-заходняя занальная лексіка ў найменнях з’яў жывой прыроды (лінгвагеаграфія і паходжанне): аўтарэф. дыс. ... канд. філал. навук. Мінск, 1997.

Аткупшчыкоў, Из истории
	Откупщиков Ю. В. Из истории индоевропейского словообразования. Л., 1967. 2-е изд., испр. и доп. - СПб., 2005.

Атрэмбскі, Gramatyka
	Otrębski J. Gramatyka języka litewskiego. T. 2: Nauka o budowie wyrazów. Warszawa, 1965.

Атрэмбскі, Życie wyrazów
	Otrębski J. Życie wyrazów w języku polskim. Poznań, 1948.

Афан.
	Афанасьев А. H. Русские народные сказки. Т. 1-3. М., 1957.

Афанасьев, Представл.
	Афанасьев А. И. Народные поэтические представления радуги. Воронеж, 1865.

AfslPh
	Archiv für slavische Philologie. Bd. 1-42. Berlin, 1875-1929.

Ачаран
	Ачарян Г. Этимологический коренной словарь армянского языка. Т. 1-4. Ереван, 1971-1979 (на армянскай мове).

Ашмарын
	Ашмарин Н. И. Словарь чувашского языка. Т. 1-17. Казань; Чебоксары, 1928-1950.

Бабкін–Шэндзяцоў
	Бабкин А. М., Шендецов В. В. Словарь иноязычных выражений и слов, употребляющихся в русском языке без перевода. М.; Л., 1966.

Багд.
	Богданович А. Пережитки древнего миросозерцания у белорусов. Гродно, 1894 (рэпрынтнае перавыданне - Мінск, 1995).

Багроўска
	Багроўска А. Параўнальная характарыстыка гаворак дзвюх вёсак з Гайнаўшчыны (Сухавольцы - Семяноўка) // Навуковы зборнік / Zbiór prac naukowych. Беласток, 1974.

Бадуэн дэ Куртэнэ, Опыт
	Бодуэн дэ Куртенэ И. А. Опыт фонетики резьянских говоров. Варшава; СПб., 1875.

Бадуэн дэ Куртэнэ, Szkice
	Baudouin de Courtenay J. Szkice językoznawcze. Warszawa, 1904.

Байк. і Некр.
	Байкоў М. і Некрашэвіч С. Беларуска-расійскі слоўнік. Менск, 1925.

Бак
	Buck С. D. A Dictionary of Selected Synonyms in the Principal Indo-European Languages. Chicago, 1949.

Балк. ез.
	Балканско езикознание. София, 1959 і наст.

Балтийские яз.
	Балтийские языки в их взаимодействии со славянскими, финно-угорскими и германскими. Рига, 1973.

Baltistica
	Baltistica: Baltų kalbotyros žurnalas. Vilnius, 1966 і наст.

Балто-слав. иссл.
	Балто-славянские исследования. М., 1974 і наст.

Балто-слав. сб.
	Балто-славянский сборник. М., 1972.

Балто-слав. этнокульт. и археол. древн.
	Балто-славянские этнокультурные и археологические древности: погребальный обряд: тез. докл. конф. М, 1985.

Балто-слав. этнояз. отнош.
	Балто-славянские этноязыковые отношения в историческом и ареальном плане: тез. докл. Второй балто-славян конф. М., 1983.

Bałto-słow. zw. jęz.
	Bałto-słowiańskie związki językowe. Wrocław [etc.], 1990.

Бандалетаў, Усл. яз.
	Бондалетов В. Д. Условно-профессиональные языки русских ремесленников и торговцев. Л., 1966.

Банькоўскі
	Bańkowski A. Etymologiczny słownik języka polskiego. T. 1-2. Warszawa, 2000.

Барад.
Вушац. сл.
	Вушацкі словазбор // Барадулін Рыгор. Збор твораў. Т. 4. Мінск, 2002; Вушацкі словазбор Рыгора Барадуліна. Мінск, 2013; 2014.

Баржкоўскі, Лирники
	Боржковский В. Лирники // Киевская Старина. Т. 26, № 9. Киев, 1899.

Барковіч, Лінгваінфарм.
	Барковіч А. А. Лінгваінфармацыйная спецыфіка камп’ютарна-апасродкаванага дыскурсу. Мінск, 2015.

Бартніцка-Дамбкоўска, Nazwy grzyb.
	Bartnicka-Dąbkowska В. Polskie ludowe nazwy grzybów. Wrocław [etc.], 1964 (Prace językoznawcze, 42).

Бартоламе
	Bartholomae Ch. Altiranisches Wörterbuch. Straßburg, 1904.

Баршч.
	Польска-беларускі тэматычны слоўнік для школьнікаў і студэнтаў = Polsko-białoruski słownik tematyczny dla uczniów i studentów / укл. Л. Баршчэўскі. Мінск, 2012.

Барысава, Лекс. Смолен. края
	Борисова Е. Н. Лексика Смоленского края по памятникам письменности. Смоленск, 1974.

Басай-Сяткоўскі, Słownik
	Basaj М., Siatkowski J. Bohemizmy w języku polskim. Słownik. Warszawa, 2006.

Басара, Terminol.
	Basara J. Terminologia budownictwa wiejskiego w dialektach polskich. Cz. 1: Dom mieszkalny. Cz. 2: Pomieszczenia gospodarskie, ogrodzenia, zamknięcia. Wrocław [etc.], 1964-1965 (Prace językoznawcze, 43).

Баўэр, Synt. slav.
	Bauer J. Syntaktica slavica. Vybrané práce slovanskéskladby. Brno, 1972.

BB
	Beiträge zur Kunde der indogermanischen Sprachen, herausgegeben von Adalbert Bezzenberger. Bd. 1-30. Göttingen, 1877-1906.

БД
	Българска диалектология. Проучвания и материалы. София, 1962 і наст.

БЕ
	Български език. София, 1951 і наст.

Бейл.
	Бейлина Д. А. Материалы для полесского ботанического словаря // Лексика Полесья: материалы для полесского диалектного словаря. М., 1968.

Бекіш, Дасл.
	Бекіш В. А. Даследаванне лексікі беларускіх помнікаў XV-XVII стст. (назвы асоб): дыс. ... канд. філал. навук. Мінск, 1970.

Albaruthenica
Беларусіка
	Беларусіка-Albaruthenica. Кн. 1. Мінск, 1993 і наст.

Беларуская думка
	Беларуская думка: штомесячны грамадска-палітычны і навукова-папулярны часопіс. Мінск, 1991 і наст.

Бел. гіст. агляд
	Беларускі гістарычны агляд. Т. 1. Вільня, 1994 і наст.

Бел. гр.
	Граматыка беларускай мовы. Т. 1-2. Мінск, 1962-1966.

Бел. гр.₂
	Беларуская граматыка. Ч. 1-2. Мінск, 1985-1986.

Бел. дыял.
	Блінава Э., Мяцельская Е. Беларуская дыялекталогія. Мінск, 1969.

Бел. дыял.₂
	Блінава Э. Д., Мяцельская Е. С. Беларуская дыялекталогія. 2-е выд., дапрац. і дап. Мінск, 1980.

Бел. дыял. 1
	Беларуская дыялекталогія: матэрыялы і даследаванні. Вып. 1-. Мінск, 2010 і наст.

Бел. казкі
	Беларускія казкі, запісаныя ад Пятра Гулевіча. Склаў П. Ахрыменка. Мінск, 1963.

Бел. лекс.
	Беларуская лексікалогія і этымалогія. Мінск, 1968.

Бел. лінгв. зб.
	Беларускі лінгвістычны зборнік. Мінск, 1966.

Бел. літ. XIX ст.
	Беларуская літаратура XIX ст.: зб. тэкстаў. Мінск, 1950.

Бел. міф.
	Беларуская міфалогія: энцыкл. слоўн. Мінск, 2004.

Бел. міф.₂
	Беларуская міфалогія: энцыкл. слоўн. Мінск, 2006.

Бел. мова
	Беларуская мова: даследаванні па лексікалогіі. Мінск, 1965.

Бел. мовазн. слав.
	Беларуская мовазнаўчая славістыка на з’ездах славістаў. Мінск, 2013.

Бел. нав. тэрм.
	Беларуская навуковая тэрмінолёгія. Вып. 1-24. Менск, 1922-1930.

Бел. нар. адзенне
	Беларускае народнае адзенне. Мінск, 1975.

Бел. нар. жыллё
	Беларускае народнае жыллё. Мінск, 1973.

Бел.-польск. ізал.
	Беларуска-польскія ізалексы: матэрыялы для абмеркавання. Мінск, 1975.

Бел.-рус. ізал.
	Беларуска-рускія ізалексы: матэрыялы для абмеркавання. Мінск, 1973.

БелСЭ
	Беларуская савецкая энцыклапедыя Т. 1-13. Мінск, 1969-1976.

Бел.-укр. ізал.
	Беларуска-ўкраінскія ізалексы: матэрыялы для абмеркавання. Мінск, 1971.

Бел. фальк. у суч. зап. (Брэс.)
	Беларускі фальклор у сучасных запісах: традыцыйныя жанры. Брэсцкая вобласць. Мінск, 1973.

Бел. хр. дыял.
Бел. хрэст. дыял.
Хрэст. дыял.
Хрэст. бел. дыял.
Хрэст. па бел. дыял.
Хрэст. па бел. дыялекталогіі
	Хрэстаматыя па беларускай дыялекталогіі. Мінск, 1962.

Бел. эрот. фольклор
	Белорусский эротический фольклор. М., 2006.

Бенвяніст, Индоевр.
	Бенвенист Э. Индоевропейское именное словообразование. М.,1955.

Бенвяніст, Словарь
	Бенвенист Э. Словарь индоевропейских социальных терминов: I. Хозяйство, семья, общество. И. Власть, право, религия. М., 1995.

БЕР
	Български етимологичен речник. Т. 1-. София, 1962 і наст.

Беразовіч
	Березович Е. Л. Русская топонимия в этнолингвистическом аспекте. Екатеринбург, 2000.

Беразовіч, Язык и традиционная культура
	Березович Е. Л. Язык и традиционная культура: этнолингвист. исслед. М., 2007.

Бернекер
	Bemeker Е. Slavisches etymologisches Wörterbuch. Bd. 1-2 (А - Mor). Heidelberg, 1908-1913.

Бернштэйн, Фонетика
	Бернштейн С. Б. Очерк сравнительной грамматики славянских языков. М., 1961.

Бернштэйн, Чередования
	Бернштейн С. Б. Очерк сравнительной грамматики славянских языков. Чередования. Именные основы. М., 1974.

Бес.
Бесар.
	Бесараба И. В. Материалы для этнографии Седлецкой губернии // Сборник ОРЯС. Т. 75, № 7. СПб., 1903.

Більфельдт, Lehnwörter
	Bielfeldt Н. Н. Die deutschen Lehnwörter im Obersorbischen. Leipzig, 1933.

Бір. Дзярж.
	Бірыла М. Слоўнік Дзяржыншчыны (рукапіс). [Гл.: Бірыла М. В. З лексікі вёскі Скварцы Дзяржынскага раёна // Народнае слова. Мінск, 1976.]

Бір. дыс.
	Бирилло Н. В. Говоры Краснослободского района Бобруйской области: дис. ... канд. филол. наук. Приложение («Некаторыя асаблівасці слоўнікавага саставу былога Чырвонаслабодскага раёна былой Бабруйскай вобласці»). Минск, 1953. [Гл.: Бірыла М. В. З лексікі Чырвонаслабодчыны // З народнага слоўніка. Мінск, 1975; Бірыла М. В. Слоўнік Капыльшчыны // Беларуская дыялекталогія: матэрыялы і даследаванні. Вып. 3. Мінск, 2014.]

Біржакова, Очерки
	Биржакова Е. Э., Воинова Л. А., Кутина Л. Л. Очерки по исторической лексикологии русского языка XVIII века: языковые контакты и заимствования. Л., 1972.

Бірыла, Бел. антр.
	Бірыла М. В. Беларуская антрапанімія. Ч. 1-3. Мінск, 1966-1982.

Бірыла, Бел. антр. назвы
	Бірыла М. В. Беларускія антрапанімічныя назвы ў іх адносінах да антрапанімічных назваў іншых славянскіх моў (рускай, украінскай, польскай). Мінск, 1963.

БЛ
	Беларуская лінгвістыка. Мінск, 1972 і наст.

Бломкв.
	Бломквист Е. Э. Крестьянские постройки русских, украинцев и белорусов (поселения, жилища и хозяйственные строения) // Тр. Ин-та этнографии им. Н. Н. Миклухо-Маклая. Т. 31: Восточнославянский этнографический сборник. М., 1956.

Блох-Вартбург
	Bloch О., von Wartburg W. Dictionnaire étymologique de la langue française. Paris, 1960.

БМ
	Беларуская мова: міжвед. зб. Вып. 1-24. Гомель, 1977-1999.

БМЛШ
	Беларуская мова і літаратура ў школе: штомесячны навук.-метад. часопіс М-ва нар. адук. Беларусі. Мінск, 1988-1991 (з 1992 г. - Роднае слова, гл. PC).

БММ
	Беларуская мова і мовазнаўства: міжвуз. зб. Вып. 1-4. Мінск, 1973-1976.

БНТ, Весн. песні
	Веснавыя песні. Мінск, 1979 (Беларуская народная творчасць).

БНТ, Выслоўі
	Выслоўі. Мінск, 1979 (Беларуская народная творчасць).

БНТ, Гульні
БНТ, Гульні₂
Гульні
	Гульні, забавы, ігрышчы. 2-е выд. Мінск, 2000 (Беларуская народная творчасць).

БНТ, Жыв.
Казкі пра жывёл
	Казкі пра жывёл і чарадзейныя казкі. Мінск, 1971 (Беларуская народная творчасць).

БНТ, Загадкі
Заг.
	Загадкі. Мінск, 1972 (Беларуская народная творчасць).

БНТ, Зам.
	Замовы. 2-е выд. Мінск, 2000 (Беларуская народная творчасць).

БНТ, Лег. і пад.
	Легенды і паданні. Мінск, 1983 (Беларуская народная творчасць).

БНТ, Песні Беласточчыны
	Песні Беласточчыны. Мінск, 1997 (Беларуская народная творчасць).

Борысь
	Boryś W. Słownik etymologiczny języka polskiego. Kraków, 2005.

Борысь, Etymologie
	Boryś W. Etymologie słowiańskie i polskie: wybór studiów z okazji 45-lecia pracy naukowej. Warszawa, 2007.

Борысь, Ludowe słown.
Ludowe słown.
	Boryś W. Ludowe słownictwo ekspresywne na warsztacie etymologa // Leksyka słowiańska na warsztacie językoznawcy. Warszawa, 1997.

Борысь, Prefiks.
	Boryś W. Prefiksacja imienna w językach słowiańskich. Wrocław, 1975.

Борысь, Czak. stud.
	Boryś W. Czakawskie studia leksykalne: Dziedzictwo prasłowiańskie w słownictwie czakawskim. Warszawa, 1999.

Бос.
	Босак А., Босак В. Гаворкі Верхняга Над’ясельдзя. Мінск, 2007.

Бочэк, Studie
	Boček V. Studie k nejstarším romanismům ve slovanských jazycích. Praha, 2010.

Бошкавіч, Развитак
	Бошковић P. Развитак суфикса у jyжнocлoвeнcкoj jeзичкоj заjедници. Београд, 1936 (Библиотека jyжнocлoвeнcкoг филолога. 6).

БПС
	Беларуска-польскі слоўнік / Słownik białorusko-polski. Варшава, 2012.

Бр.
	Брандт А. Ф. Юридические обычаи у крестьян Могилевской губернии // Сборник народных юридических обычаев: записки РГО по Отделению этнографии. Т. 2. СПб., 1900.

Браім, Рыбалоўства
	Браім І. М. Рыбалоўства ў Беларусі: гіст.-этнаграф. нарыс. Мінск, 1976.

Брасл. сл.
	Brasławszczyzna. Pamięć i współczesność. Т. II: Słownictwo dwujęzycznych mieszkańców rejonu (Słownik brasławski). Warszawa, 2009.

БРС
	Беларуска-рускі слоўнік / Белорусско-русский словарь. М., 1962.

БРСНС
	Беларуска-рускі тлумачальны слоўнік новых слоў і новых значэнняў слоў / укл. В. І. Уласевіч, Н. М. Даўгулевіч. Мінск, 2013.

Бругман, Grundriss
	Grundriß der vergleichenden Grammatik der indogermanischen Sprachen. 2. Bearbeitung. I. Brugmann K. Einleitung und Lautlehre. Straßburg 1897. II. H. 1-3. Brugmann K. Lehre von den Wortformen und ihrem Gebrauch. Straßburg 1906, 1911, 1913.Ш-V. Delbrück B. Vergleichende Syntax der indogermanischen Sprachen. Viz Delbrück, 1893.

Бругман, Kurze Gr.
	Brugmann K. Kurze vergleichende Grammatik der indogermanischen Sprachen. Straßburg, 1902-1904.

Брукнер
	Brückner A. Słownik etymologiczny języka polskiego. Kraków, 1927.

Брукнер, Litwa
	Brückner A. Starożytna Litwa. Warszawa, 1904.

Брэн
	Бренн К. И. Местное этнографическое описание Бельского уезда. Рукопись 1857 г. // Зеленин Д. К. Описание рукописей ученого архива Русского Географического общества. Вып. I. Петроград, 1914.

Брян. гов.
	Брянские говоры: сб. науч. ст. Вып. 1-3. Л., 1968-1975.

БСИ
	Бюлетин за съпоставително изследване на българския език с други езици. София, 1976-1977.

BSL
	Bulletin de la Société de Linguistique de Paris. Paris, 1868 і наст.

БСЭ
	Большая Советская Энциклопедия, т. 1-50. М., 1949-1957

Буга, Rinkt.
	Buga К. Rinktiniai raštai. T. 1-3. Vilnius, 1958-1962.

Будзішэўска, Żarg.
	Budziszewska W. Żargon ochweśnicki. Łódź; Wrocław, 1957.

Будзішэўска, Słown.
	Budziszewska W. Słowiańskie słownictwo dotyczące przyrody żywej. Wrocław [etc.], 1965.

Буз.
	Бузук П. Да характарыстыкі беларускіх дыялектаў. Гутаркі Асіповіцкага раёна (Слоўнік) // Запіскі Аддзела гуманітарных навук Інстытута беларускай культуры. Працы класа філалогіі. Т. 2, кн. 9. Менск, 1929.

Бузук, Асн. пыт.
	Бузук П. А. Асноўныя пытанні мовазнаўства: Падручная кніга для настаўнікаў беларускай мовы і студэнтаў-лінгвістаў. Менск, 1926.

Бузук, Паўдн.-бел.
	Бузук П. А. Да характарыстыкі дыялектаў паўднёва-беларускіх і пераходных да ўкраінскіх // Sveslovenski sbornik. Spomenica o tisu-ćugodišnjici Hrvatskogo kraljevstva. Zagreb, 1930.

Бузук, Спроба
	Бузук П. Спроба лінгвістычнай геаграфіі Беларусі. Менск, 1928.

Булахаў, Гіст.
	Булахаў М. Г. Гісторыя прыметнікаў беларускай мовы XIV-XVII стагоддзяў. Ч. 1-3. Мінск, 1971-1973.

Булахаў, Прым.
	Булахаў М. Г. Прыметнік у беларускай мове. Мінск, 1964.

Булахаў, Развіццё
	Булахаў М. Г. Развіццё беларускай літаратурнай мовы ў 19–20 стст. ва ўзаемаадносінах з іншымі славянскімі мовамі: дакл. на IV Міжнар. з’ездзе славістаў. Мінск, 1958.

Булахоўскі, Вибр. пр.
	Булаховський Л. А. Вибрані праці. Т. 1-5. Київ, 1975-1983.

Булахоўскі, Нарысы₂
	Булаховський Л. А. Нариси з загального мовознавства. 2-е вид. Київ, 1969.

Булахоўскі, Питання
	Булаховський Л. А. Питання походження української мови. Київ, 1956.

Булг.
	Булгаковский Д. Г. Пинчуки // Записки Русского географического общества по Отделению этнографии. Т. 13, вып. 3. СПб., 1890.

Булыка, Выбр.
	Булыка A. М. Выбраныя працы. Мінск, 2015.

Булыка, Запазыч.
	Булыка А. М. Даўнія запазычанні беларускай мовы. Мінск, 1972.

Булыка, Лекс. запазыч.
	Булыка А. М. Лексічныя запазычанні ў беларускай мове XIV-XVIII стст. Мінск, 1980.

Булыка, СІС
	Булыка А. М. Слоўнік іншамоўных слоў. Мінск, 1999.

Бурачок, Назви
	Бурячок А. А. Назви спорідненості і свояцтва в українській мові. Київ, 1961.

Бълг. реч
	Българска реч. Популярно списание за езикова култура. София, 1995 і наст.

Byz. Sl.
	Byzantinoslavica. Revue Internationale des Etudes Byzantines. Praha, 1929-1938; 1947 і наст.

Бяд.
	Бядуля 3. Вера, паншчына і воля ў беларускіх народных песнях і казках. Менск, 1924.

Бяднарчук, Językowy obraz WKL
	Bednarczuk L. Językowy obraz Wielkiego Księstwa Litewskiego. Kraków, 2010.

Бяднарчук, Stosunki
	Bednarczuk L. Stosunki językowe na ziemiach Wielkiego Księstwa Litewskiego. Kraków, 1999.

Бязлай
	Bezlaj F. Etimolośki slovar slovenskega jezika. T. 1-4. Ljubljana, 1976-2005.

Бязлай, Vodna im.
	Bezlaj F. Slovenska vodna imena. [D.] I-II. Ljubljana, 1956-1961.

Бязлай, Eseji
	Bezlaj F. Eseji o slovenskem jeziku. Ljubljana, 1967.

Бязлай, Etyma
	Bezlaj F. Etyma slovenica // Razprave Slovenske akademije znanosti in umetnosti. T. 7, № 4. Ljubljana, 1970.

Бязлай, Južnosl. leks.
	Bezlaj F. Južnoslovanska leksika kot vir informacij za praslovansko dialektologijo // XX seminar za strane slaviste Zadar-Zagreb (4. - 30.VIII.1969) (рукапіс). [Гл.: Bezlaj F. Zbrani jezikoslovni spisi. [D.] I. Ljubljana, 2003.]

Бязлай, Novejse
	Bezlaj F. Novejše zanimivosti iz slovenske leksike // IV. Seminar slovenskega jezika, literature in kulture. Ljubljana, 1968.

Бязлай, Posk. zv.
	Bezlaj F. Etimološki slovar slovenskega jezika. Poskusni zvezek. Ljubljana, 1963.

Бялецкі, Принципы
	Белецкий А. А. Принципы этимологических исследований (На материале греческого языка). Киев, 1950.

Бялецкі-Насенка
	Білецький-Носенко П. Словник української мови. Київ, 1966.

Бяльк.
	Бялькевіч I. К. Краёвы слоўнік усходняй Магілёўшчыны. Мінск, 1970.

Бярнар, Бълг. изсл.
	Бернар Р. Българистични изследвания. София, 1982.

Бярында
	Беринда Памво. Лексіконъ славенорωсскїй и именъ тлъкованїе. Київ, 1961.

Бяс.
	Бессонов П. Белорусские песни с подробными объяснениями их творчества и языка, с очерками народного обряда, обычая и всего быта. М., 1871.

Бяс., Калики
	Бессонов П. Калики перехожие. М., 1881.

Важны, O jménech
	Vážný V. О jménech motýlů v slovenských nářečích: Studie sémasiologická se zřetelem jazykovĕ zemĕpisným. Bratislava, 1955.

Вайтовіч, Вакалізм
	Байтовіч H. Т. Ненаціскны вакалізм народных гаворак Беларусі. Мінск, 1968.

Вальдэ
	Walde А. Lateinisches etymologisches Wörterbuch. 2. umgearb. Auflage. Heidelberg, 1910.

Walde, 1906
	Walde A. Lateinisches etymologisches Wörterbuch. Heidelberg, 1906.

Вальдэ–Гофман
	Walde A. Lateinisches etymologisches Wörterbuch. 3. Aufl., bearb. bei J. B. Hoffmann. Bd. 1-2. Heidelberg, 1938-1954.

Ванк. дыс.
	Ванковіч Л. A. Лексіка твораў Янкі Купалы 1905-1907 гадоў: дыс. ... канд. філал. навук. Мінск, 1964.

Варбат, Исслед.
	Варбот Ж. Ж. Исследования по русской и славянской этимологии. М.; СПб., 2012.

Варбат, Морфон.
	Варбот Ж. Ж. Праславянская морфонология, словообразование и этимология. М., 1984.

Варбат, Словообр.
	Варбот Ж. Ж. Древнерусское именное словообразование. М., 1969.

Варл.
КЭС, лаг.
	Varlyha А. Krajovy słoŭnik Łahojščyny / Regional dictionary of Lahojsk Byelorussian // Краёвы слоўнік Лагойшчыны. New York, 1970.

Варш. сл.
	Słownik języka polskiego ułożony pod red. J. Karłowicza, A. Kryńskiego i W. Niedźwiedzkiego. T. 1-8. Warszawa, 1900-1927.

Васілеўскі, Прадукт. тыпы
	Васілеўскі М. С. Прадуктыўныя тыпы дзеясловаў у сучаснай беларускай мове. Мінск, 1970.

Васільковая сп.
	Васільковая спадчына: так гавораць нашы вяскоўцы. Слоўнік дыялектаў. - [Навагрудак], 2008.

Васэрцыер
	Wasserzieher Е. Kleines etymologisches Wörterbuch der deutschen Sprache. Leipzig, 1975.

Ваўр.
	Ваўранюк А. Беларускія гульні. Беласток, 1998.

Вахрас, Наим. об.
	Вахрос И. С. Наименования обуви в русском языке. 1. Древнейшие наименования, до Петровской эпохи // Ежегодник Института по изучению СССР в Финляндии. Приложение к № 6-10. Хельсинки, 1959.

Вашэк, Vlivy
	Vašek А. Jazykové vlivy karpatské salašnické kolonizace na Moravĕ: Konfrontačnĕ-komparatistická gramatická Studie karpatologickä. Praha, 1967.

Баян, Gram. comp.
	Vaillant A. Grammaire comparée des langues slaves. Vol. 1-5. Paris; Lyon, 1950-1977.

В. В.
	[Скалон M.] Описание крестьянского жилого дома в деревне Загорье Волковысского уезда Гродненской губернии // Виленский временник. Кн. 2. Вильна, 1907.

Векслер, Гіст.
	Вэкслер П. Гістарычная фаналогія беларускае мовы. Мінск, 2004.

Векслер, Histor. Phonology
	Wexler Р. A Historical Phonology of the Belorussian Language. Heidelberg, 1977.

Веснік БДУ
	Весн. Беларус. дзярж. ун-та. Сер. 4, Філалогія. Журналістыка. Педагогіка. Мінск, 1969 і наст.

Весці АН БССР
	Вес. Акад. навук БССР. Сер. грамад. навук. Мінск, 1956 і наст.

Вечаркевіч, Słownik
	Wieczorkiewicz В. Słownik gwary warszawskiej XIX wieku. Warszawa, 1966.

Вешт.
	Вешторт Г. Ф. Названия пищи в говорах Полесья // Лексика Полесья: материалы для полесского диалектного словаря. М., 1968.

Вешт. дыс.
	Вештарт Г. Ф. Лінгвагеаграфічная дыферэнцыяцыя Прыпяцкага Палесся (на матэрыяле назваў ежы): дыс. ... канд. філал. навук. Мінск, 1969.

Відоескі, Геогр. терм.
	Видоески Б. Географската терминологиjа во диалектите на македонскиот jезик. Скопjе, 1999.

WIEP
	Wielka Ilustrowana Encyklopedia Powszechna. T. 1-22. Kraków, 1929-1938.

Віл. сл.
	Słownik języka polskiego. Wilno, 1861.

Вінаградаў, Лекс.
	Виноградов В. В. Избранные труды. Лексикология и лексикография. М., 1977.

Вінаградаў, Очерки
	Виноградов В. В. Очерки по истории русского литературного языка XV1I-XIX вв. М., 1938.

Вінцэнц
	de Vincenz A., Hentschel G. Wörterbuch der deutschen Lehnwörter in der polnischen Schrift- und Standardsprache. Göttingen; Oldenburg [Электронны рэсурс]. - Рэжым доступу: http://www.bkge.de/Publikationen/Online/Woerterbuecher.

Вінцэнц, Éléments
	de Vincenz A. Les éléments roumains du lexique houtzoule. Paris, 1959.

Віткоўскі, Słownik
	Słownik zapożyczeń polskich w języku rosyjskim / zestawił Wiesław Witkowski. Kraków, 1999.

Волк.
	Полацкія дыяменты: дыялектны слоўнік / матэрыял сабраў І. І. Волкаў. Мінск, 2016.

Вондрак, Vergl. gr.
	Vondrák W. Vergleichende slavische Grammatik. 2. Aufl. Bd. 1-2. Göttingen, 1924-1928.

Вопр. истории
	Вопросы истории и диалектологии русского языка: сб. ст. Свердловск, 1963.

Вопр. лит. яз.
	Вопросы литературы и языка: сб. ст. молодых ученых и аспирантов. Минск, 1968.

Вопр. фил.
Зб. Васіленку
	Вопросы филологии: сб. ст. к семидесятилетию со дня рождения <...> И. А. Василенко // Ученые записки Моск. гос. пед. ин-та им. В. И. Ленина. № 341. М., 1969.

Word
	Word: Journal of the Linguistic Circle of New York. New York, 1945 і наст.

Восточнослав. и общ. яз.
	Восточнославянское и общее языкознание: сб. ст. М., 1978.

Воўк-Лев.
Воўк-Лев., Татарк.
	Воўк-Левановіч Л. В. Важнейшыя рысы гаворкі вёскі Татаркавічы і гаворак ваколічных вёсак // Запіскі аддзела гуманітар. навук Ін-та беларус. культуры. Кн. 2: Працы класа філалогіі. Т. I. Менск, 1928.

Вруб.
	Wróblewski М. Słownik gwary bielsko-podlaszskiej: na podstawie języka wsi Chraboły oraz przedmieścia Studziwody // Slovnik govuorki b’elsko-pudl’ašskyj. Bielsk Podlaski, 2008.

Врубель, Term. bot.
	Wróbel H. Związki staroczesko-staropolskie w terminologii botanicznej. Kraków, 2004.

ВСБМ
	Піскуноў Ф. A. Вялікі слоўнік беларускай мовы: арфаграфія, акцэнтуацыя, парадыгматыка. Мінск, 2012.

WsJb
	Wiener Slavistisches Jahrbuch. Wien, 1950 і наст.

WSL
	Die Welt der Slaven. Vierteljahrsschrift für Slavistik. Wiesbaden, 1956 і наст.

ВСС
	Восьмиязычный сельскохозяйственный словарь: русский, болгарский, чешский, польский, венгерский, румынский, немецкий, английский. М. [и др.], 1970.

Вступ
	Вступ до порівняльно-історичного вивчення слов’янських мов. Київ, 1966.

ВСЯ
	Вопросы славянского языкознания. Вып. 1-7. М., 1954-1963.

ВСЯ (Львоў)
	Вопросы славянского языкознания. Кн. 1-9. Львов, 1948-1963.

WuS
	Wörter und Sachen: Kulturhistorische Zeitschrift für Sprach- und Sachforschung. Bd. 1-18. Heidelberg, 1909-1938; neue Folge: Bd. 1-5. Heidelberg, 1938-1943/1944.

Выг.
	Выгонная Л. Т. Полесская земледельческая терминология // Лексика Полесья: материалы для полесского диалектного словаря. М., 1968.

Выг. дыс.
	Выгонная Л. Ц. Палеская земляробчая лексіка: дыс. ... канд. філал. навук. Дадатак. Мінск, 1969.

ВЯ
	Вопросы языкознания. М., 1952 і наст.

Вяр.
	Podania białoruskie zebrane przez Władysława Weryhę. Lwów, 1889.

Вяржбоўскі, Бел.-літ. лекс.
	Вержбовский А. А. Белорусско-литовские лексические взаимосвязи: автореф. ... дис. канд. филол. наук. Вильнюс, 1961.

Вяржбоўскі, дыс.
	Вяржбоўскі А. А. Белорусско-литовские лексические взаимосвязи: дис. ... канд. филол. наук. Вильнюс, 1961.

Вярхоў, Наз.
	Вярхоў П. В. Назоўнікі на -ар (-яр) у беларускай мове. Мінск, 1970.

Вярэн.
	Веренич В. Л., Кривицкий А. А. Лексика городненских гончаров // Полесье (Лингвистика. Археология. Топонимика). М., 1968.

Гаверс, Tabu
	Havers W. Neuere Literatur zum Sprachtabu. Wien, 1946.

Галынска-Баранова, Ukr. nazwy
	Hołyńska-Baranowa T. Ukraińskie nazwy miesięcy na tle ogólnosłowiańskim. Wrocław [etc.], 1969.

Гамільшэг
	Gamillscheg E. Etymologisches Wörterbuch der französischen Sprache. Bd. 1-2. Heidelberg, 1926-1929.

Гамкрэлідзэ–Іванаў
	Гамкрелидзе T. В., Иванов В. В. Индоевропейский язык и индоевропейцы: реконструкция и историко-типологический анализ праязыка и протокультуры. Тбилиси, 1984.

Гарад.
	Курило О. Фонетичні та деякі морфологічні особливості говірки села Хоробричів давніше Городнянського повіту, тепер Сновської округи на Чернігівщине // Зб. Іст.-філол. від. Всеукр. акад. наук (Праці етнограф. комісії). № 21. Київ, 1924. [У спісе “Скарачэнні. Крыніцы” ў 5 т. (с. 319) памылкова паказана іншая праца: Курило О. Матеріяли до українськоі діалектології та фольклористики: Берестейський та Кобринський повіти. Словничок // Збірник Історично-філологічного відділу Всеукраїнськоі академії наук, № 85. Київ, 1928.]

Гараеў
	Горяев Н. В. Сравнительный этимологический словарь русского языка. Тифлис, 1896.

Гараеў, Доп.
	Горяев Н. К сравнительному этимологическому словарю русского языка (издание 1896 г.). Дополнения и поправки. Тифлис, 1901.

Гарб.
	Горбачевский Н. Словарь древнего актового языка Северо-Западного края и Царства Польского. Вільна, 1874.

Гарбуль
	Гарбуль Л. Лексические полонизмы в русском приказном языке первой половины XVII века. Вильнюс, 2014.

Гарбуль, Семант. полонизмы
	Гарбуль Л. Семантические полонизмы в русском приказном языке в первой половине XVII века. Вильнюс, 2009.

Гармонія
	Гармонія беларускага слова: падручныя нарысы для журналістаў. Зборкі пазнаньня чысьціні беларускае мовы. Гродна, 1999.

Гарэц.
	Гарэцкі М. Невялічкі беларуска-маскоўскі слоўнічак. Вільня, 1921.

Гарэц. 1
	Гарэцкія М. і Г. Маскоўска-беларускі слоўнік. Смаленск, 1918: Словы, што не трапілі ў другое выданне слоўніка з першага // Гарэцкі Г. Выбранае. Мінск, 2002.

Геаргіеў, Въпроси
	Георгиев В. И. Въпроси на българската етимология. София, 1958.

Геаргіеў, Introduction
	Georgiev V. I. Introduction to the History of the Indo-European Languages. Sofia, 1981.

Геаргіеў, Исследов.
	Георгиев В. И. Исследования по сравнительно-историческому языкознанию: родственные отношения индоевропейских языков. М., 1958.

Гебаўэр
	Gebauer J. Slovník staročesky. D. 1-2. Praha, 1903-1916.

Гераў
	Геров H. Речник на българския език. Фототип. изд. Т. 1-5. София, 1975-1978.

Германовіч, Междом.
	Германович А. Н. Междометия русского языка: пособие для учителя. Киев, 1966.

Гіл.
	Гілевіч Н. I. Дыялектны слоўнік: лексіка. Фразеалагізмы. Прыказкі, прымаўкі, прыгаворкі. Параўнанні. Мінск, 2005.

Гілевіч, Лір. песні
	Лірычныя песні / укл. і рэд. Н. С. Гілевіча. Мінск, 1976 (Беларускі фальклор у сучасных запісах).

Гірт, Ablaut
	Hirt Н. Der indogermanische Ablaut, vornehmlich in seinem Verhältnis zur Betonung. Straßburg, 1900

Гірт, Gram.
	Hirt H. Indogermanische Grammatik. Bd. 1-5. Heidelberg, 1927-1929.

Гіст. лекс.
	Гістарычная лексікалогія беларускай мовы. Мінск, 1970.

Гіст. марф.
	Гістарычная марфалогія беларускай мовы / А. М. Булыка, А. I. Жураўскі, І.І. Крамко. Мінск, 1979.

Гіст. мовы
	Жураўскі А. I. Гісторыя беларускай літаратурнай мовы. Т. 1. Мінск, 1967; Крамко I. I., Юрэвіч A. К., Яновіч А. 1. Гісторыя беларускай літаратурнай мовы. Т. 2. Мінск, 1968.

Глогер, Encykl.
	Gloger Z. Encyklopedia staropolska ilustrowana. T. 1-4. Warszawa, 1900-1903 (reprodukcja pierwodruku - 1958).

Glotta
	Glotta: Zeitschrift für griechische und lateinische Sprache. Göttingen, 1909 і наст.

Глухак
	Gluhak A. Hrvatski etimološki rječnik. Zagreb, 1993.

Гнацюк, Лірники
	Гнатюк В. Лірники. Лірницькі пісні, молитви, слова, звістки і т. и. про лірників повіту Бучацького // Етнографічний збірник Наукового товариства ім. Шевченка. Т. 2. Львів, 1896.

Голуб-Копечны
	Holub J., Kopečný F. Etymologický slovník jazyka ćeského. Praha, 1952.

Голуб-Ліер
	Holub J., Lyer S. Stručný etymologický slovniík jazyka českého se zvláštním zřetelem k slovům kulturním a cizím. Praha, 1967.

Горбач, Арго
	Горбач О. Арго українських лірників. Мюнхен, 1957.

Горбач, Арго школярів
	Горбач О. Арго українських школярів і студентів. Мюнхен, 1966 (асобны адбітак).

Горбач, Дитяч.
	Горбач О. Лексика «дитячої мови» в України. Нью-Йорк, 1968 (асобны адбітак).

Горбач, Зах.-пол. гов.
	Горбач О. Західно-поліська говірка с. Остромичі кол. повіту Кобринь. Мюнхен, 1973 (асобны адбітак). [Гл. таксама: Горбач Олекса. Зібрані статті. [Т.] V: Діалектологія. Мюнхен, 1993.]

Грабец, Elementy
	Hrabec S. Elementy kresowe w języku niektórych pisarzy polskich XVI і XVII wieku. Toruń, 1949.

Грабец, Nazwy
	Hrabec S. Nazwy geograficzne Huculszczyzny. Kraków, 1950.

Грач.
	Грачыха T. А. Дыялектны тэматычны слоўнік найменняў іхтыя- і герпетафаўны Беларускага Паазер’я. Віцебск, 2006.

Грачоў-Макіенка, Истор.-этим. сл.
	Грачев М. А., Мокиенко В. М. Историко-этимологический словарь воровского жаргона. СПб., 2000.

Грот, Фил. раз.
	Грот Я. Филологические разыскания: 1. Материалы для словаря, грамматики и истории русского языка. 2. Спорные вопросы русского правописания от Петра Великого до ныне. СПб., 1899.

Груз.
	Грузинский А. Из этнографических наблюдений в Речицком уезде Минской губернии // Этнографическое обозрение. № 4. М., 1891; Грузинский А. Духовные стихи, записанные в Минской губернии // Этнографическое обозрение. № 3. М., 1898.

Грыг.
	Григорович И. И. Словарь западнорусского наречия (А, Б, В), 1851 г. (рукапіс; Беларускі дзяржаўны архіў-музей літаратуры і мастацтва; Мінск).

Грынблат, Белор.
	Гринблат М. Я. Белорусы. Минск, 1968.

Грынч.
Грынчанка
	Гринченко Б. Д. Словарь украинского языка. Т. 1-4. Киев, 1907-1909.

Грэймас, Этн.
	Грэймас А. Ю. Пра багоў і людзей. У пошуках этнічнай памяці. Мінск, 2003.

Грэк-Пабісова, Марынякова, Współcz.
	Grek-Pabisowa I., Maryniakowa I. Współczesne gwary polskie na dawnich Kresach północno-wschodnich. Warszawa, 1999.

ГСБМ
	Гістарычны слоўнік беларускай мовы. Вып. 1-37. Мінск, 1982-2017.

ГСУ ИФФ
	Годишник на Софийския университет. Историко-филологически факултет. София, 1904 і наст.

Губшмід, Schläuche
	Hubschmid J. Schläuche und Fässer. Bern, 1955.

Гуер, Введение
	Гуйер О. Введение в историю чешского языка. М., 1953.

Гуер, Příspĕvky
	Hujer О. Příspĕvky k historii a dialektologii českého jazyka. Praha,1961.

Гура, Символика
	Гура А. В. Символика животных в славянской народной традиции. М., 1997.

ГЧ
	Гавораць чарнобыльцы (з мясцовых гаворак чарнобыльскай зоны ў Беларусі). Мінск, 1994.

Гюнтарт, Reimwort.
	Güntert Н. Über Reimwortbildungen im Arischen und Altgriechischen: eine sprachwissenschaftliche Untersuchung. Heidelberg, 1914.

Гютль-Ворт, For. words
	Hüttl-Worth G. Foreign words in Russian in Historical Sketch, 1550-1800. Los Angeles, 1963.

ДАБМ
	Дыялекталагічны атлас беларускай мовы [Карты]. Мінск, 1963.

ДАБМ, камент.
	Дыялекталагічны атлас беларускай мовы: уступ. арт., давед. матэрыялы і камент. да карт. Мінск, 1963.

Дабр.
	Добровольский В. Н. Смоленский областной словарь. Смоленск, 1914.

Дабр., Этн.
	Добровольский В. Н. Смоленский этнографический сборник. Ч. 1-4 // Записки Русского географического общества по Отделению этнографии. Т. 20; 23, вып. 1-2; 27. СПб., 1891-1903.

Дабрав., Кросны
	Добровольский В. Н. Кросна И Этнографическое обозрение. № 1. М., 1902.

Дабравольскі, Звукоподр.
	Добровольский В. Н. Звукоподражания в народном языке и в народной поэзии // Этнографическое обозрение. № 3. М., 1894.

Даза
	Dauzat A. Dictionnaire étimologique de la langue françaisc. Paris, 1938.

Даль
	Даль В. Толковый словарь живого великорус, языка. Т. 1-4 / под ред. [и с предисл.] И. А. Бодуэна-де-Куртенэ. СПб.; М., 1903-1909.

Даніловіч, Бел. дыял. фраз.
	Даніловіч М. А. Беларуская дыялектная фразеалогія і яе лексічная аснова. Гродна, 2003.

Даніловіч, Лінгв. краязн.
	Даніловіч М. А. Лінгвістычнае краязнаўства Гродзеншчыны. Гродна, 2008.

Даніл. Сл.
	Даніловіч М. А. Слоўнік дыялектнай фразеалогіі Гродзеншчыны. Гродна, 2000.

Дарафееў, Птушкі
	Дарафееў А. М. Птушкі. Мінск, 1984.

Дарашэўскі
	Słownik języka polskiego / red. W. Doroszewski. T. 1-11. Warszawa, 1958-1969.

Дарашэўскі, Podstawy
	Doroszewski W. Podstawy gramatyki polskiej. Warszawa, 1963.

Дары
	Дары наших лесов. Минск, 1984.

Дасл. (Гродна)
	Даследаванні па літаратуры і мове: зб. арт. Гродна, 1967.

Дасл. бел.-рус.
	Даследаванні па беларускай і рускай мовах: зб. арт. Мінск, 1958.

Даўгарукаў
	Витебская губерния: ист.-географ. и стат. обзор / сост. под ред. В. М. Долгорукова. Вып. 1: История. Природа. Население. Просвещение. Витебск, 1890.

Дварэцкі
	Дворецкий И. X. Латинско-русский словарь. 2-е изд. М., 1976.

Дзендзялеўскі, Конспект
	Дзендзелівський И. О. Конспект лекцій з курсу української діалектології. Фонетика. Ужгород, 1965.

Д.-З., Пін.
Доўн.-Зап., Пін.
	Песни пинчуков // Белоруское Полесье: сб. этнограф. материалов, собр. М. Довнаром-Запольским. Вып. 1. Киев, 1895.

Дзіц. фальк.
	Дзіцячы фальклор. Мінск, 1972 (Беларуская народная творчасць).

Дзіц. фальклор
	Дзіцячы фальклор. Зборнік фальклорных матэрыялаў. Мінск, 2006.

Дзмітр.
	Дмитриев М. А. Собрание песен, сказок, обрядов и обычаев крестьян Северо-Западного края. Вильна, 1869.

Дзмітрыеў, Строй
	Дмитриев Н. К. Строй тюркских языков: избр. тр. М., 1962.

Дзмітрыеў, Тюрк. эл.
	Дмитриев Н. К. Тюркские элементы русского словаря // Лексикографический сборник. Вып. 3. М., 1958.

Дзяул. сл.
	Словарь современного русского народного говора (д. Деулино Рязанского района Рязанской области) / под ред. И. А. Оссовецкого. М., 1969.

Дзячэнка
	Дьяченко Г. Полный церковнославянский словарь (с внесением в него важнейших древнерусских слов и выражений). М., 1900.

Діал. студії
	Діалектологічні студії. Вып. 1-. Львів, 2003 і наст.

ДЛ
	Диалектная лексика: сб. ст. Л., 1971 і наст.

Длугаш-Курчабова
	Długosz-Kurczabowa К. Nowy słownik etymologiczny języka polskiego. Warszawa, 2003; Wielki słownik etymologiczno-historyczny języka polskiego. Warszawa, 2008.

Доўн.-Зап. 1
	Довнар-Запольский M. В. Крестьянские игры в Минской губернии // Живая Старина. Вып. 4. СПб., 1891.

Доўн.-Зап. 2
	Довнар-Запольский М. В. Белорусская свадьба в культурно-религиозных пережитках // Этнографическое обозрение. № 1, 2, 4. М., 1893.

Доўн.-Зап., Чародейство
	Довнар-Запольский М. В. Чародейство в Северо-Западном крае в XVII-XVIII ст. // Этнографическое обозрение. № 2. М., 1890.

Др.
Др.-Падб.
	Друцкі-Падбярэскі Б. Падручны беларуска-польскі слоўнік // Podręczny białorusko-polski słownik. Вільна, 1929.

Дразд.
	Драздовіч Я. Слоўнікавы матэрыял для Беларускай Этнаграфічнай Энцыклапедыі. Піншчына. 1926 (рукапіс; Цэнтральная навуковая бібліятэка НАН Беларусі. Гл.: Драздовіч Я. Краёвы слоўнік Піншчыны; Пінскія словазборы // Беларуская дыялекталогія: матэрыялы і даследаванні. Вып. 4. Мінск, 2016).

Др.-тюрк.
	Древнетюркский словарь. М., 1969.

ДСИЯ
	Доклады и сообщения Института языкознания АН СССР. М., 1952 і наст.

Дубр.
	Дубровський В. Словник українсько-московський. Вид. 6-е. Київ, [1918].

Duden. Etymologie
	Duden. Das Herkunftswörterbuch: Etymologie der deutschen Sprache: auf der Grundlage der neuen amtlichen Rechtschreibregeln. 4, neu bearb. Aufl. Mannheim [etc.], 2007.

Дуж-Душ.
	Дуж-Душэўскі К., Ластоўскі В. Слоўнік геаметрычных і трыганаметрычных тэрмінаў і сказаў: расійска-беларускі і беларуска-расійскі. Коўна, 1923.

Дурнаво, Очерк
	Дурново Н. Н. Очерк истории русского языка. М.; Л., 1924.

Д.-Хадак.
	Далэнга-Хадакоўскі З. Выбранае. Мінск, 2007.

Дыял. Гродз.
	Дыялектная мова Гродзеншчыны: хрэстаматыя. Гродна, 2007.

Дыял. Прыб. канф.
	Диалектологическая конференция по изучению русских говоров Прибалтики: тез. докл. Тарту, 1968.

Дэмб.
	Опыт описания Могилевской губернии в историческом, физико-географическом, этнографическом, промышленном, сельскохозяйственном, лесном, учебном, медицинском и статистическом отношениях: в 3 кн. / сост., [предисл.] и ред. А. С. Дембовецкого. Могилев на Днепре, 1882-1884 (рэпрынтнае перавыданне - Могилев, 2007-2008).

ЕЛ
	Език и литература. София, 1946 і наст.

ЕСУМ
	Етимологічний словник української мови. Т. 1-6. Київ, 1982-2012.

Ёль, Elem.
	Oehl W. Elementare Wortschöpfung: papilio – fifaltra – farfalla // Biblioteca dell’Archivum Romanicum. Vol. 3. Genève, 1924.

Ёўганесан
	Jóhanesson A. Isländisches etymologisches Wörterbuch. Bern, 1956.

Жарт. песні
	Жартоўныя песні. Мінск, 1974 (Беларуская народная творчасць).

Жд.
	Матэрыялы для слоўніка мінска-маладзечанскіх гаворак / пад рэд. М. А. Жыдовіч. Вып. 1-3. Мінск, 1970-1977.

Жлутка
	Лацінска-беларускі слоўнік актавай мовы Вялікага Княства Літоўскага XIII-XVIII стст. / склад. А. А. Жлутка. Мінск, 2011.

ЖМНП
	Журнал Министерства народного просвещения. СПб., 1834-1917.

ЖНС
	Жывое народнае слова: дыялект. зб. Мінск, 1992.

ЖСт.
	Живая Старина. Периодическое издание Отделения этнографии Русского географического общества. СПб., 1890-1917; М., 1994 і наст.

Жук.
	Жуков П. И. Рыбы Белоруссии. Минск, 1965.

Жукаў
	Жуков П. И. Рыбы бассейна Немана: в пределах Белорусской ССР. Минск, 1958.

Жураўлёў, Язык и миф
	Журавлев А. Ф. Язык и миф. Лингвистический комментарий к труду А. Н. Афанасьева «Поэтические воззрения славян на природу». М., 2005.

Жучк.
Жучкевіч, Топон.
	Жучкевич В. А. Топонимика Белоруссии. Минск, 1968.

Жучкевіч, Слов.
	Жучкевич В. А. Краткий топонимический словарь Белоруссии. Минск, 1974.

Жыв. НС
	Жывое наша слова: дыялект. зб.: да 90-годдзя чл.-кар. НАН Беларусі Ю. Ф. Мацкевіч. Мінск, 2001.

Жыв. св.
	Жывёльны свет: тэмат. слоўн. Мінск, 1999.

Жыв. сл.
	Жывое слова. Мінск, 1978.

Жылко, Нариси
	Жилко Ф. Т. Нариси з діалектології української мови. Київ, 1966.

Жэлях.
	Желехівський Е., Недільський С. Малоруско-німецкий словар. Т. 1-2. Львів, 1886.

Замеж. беларусістыка
	Замежная мовазнаўчая беларусістыка на міжнародных з’ездах славістаў. Мінск, 2013.

Z hist.
Хінцэ, Z hist.
	Z historii języków łużyckich: zbiór studiów. Warszawa, 1996.

З жыцця
	З жыцця роднага слова: лексікал. зб. Мінск, 1968.

З історії
	З історії української та інших слов’янських мов. Київ, 1965.

З нар. сл.
	З народнага слоўніка. Мінск, 1975.

Z našej prírody
	Z našej prírody. Rastliny, horniny, mineráły, skameneliny. Bratislava, 1978.

Зав.
	Завилейский В. Витебск // Северная пчела. № 162-165. СПб., 1834.

Завяруха
	Заверуха Б. В. Квіти дванадцяти місяців [Про дикоростучі рослини УРСР]. Київ, 1974.

Загароддзе
	Загароддзе. [Вып. 1-3]. Мінск, 1999-2001.

Заговор
	Исследования в области балто-славянской духовной культуры: заговор. М., 1993.

Зайка Кос.
	Зайка А. Дыялектны слоўнік Косаўшчыны. Слонім, 2011.

Залізняк, Древненовг.
	Зализняк А. А. Древненовгородский диалект. М., 1995.

Запіскі
	Запіскі Аддзела гуманітарных павук Інстытута беларускай культуры. Працы класа філалогіі. Т. 1-2. Менск, 1928-1929.

Запісы
	Запісы Беларускага інстытута навукі і мастацтва. Нью-Ёрк; Мюнхен, 1952 і наст.

Запрудскі, дыс.
	Запрудский С. Н. Сербскохорватско-белорусские лексические соответствия: дис. ... канд. филол. наук. Минск, 1989.

Заянчкоўскі, Stud. orient.
	Zajączkowski A. Studia orientalistyczne z dziejów słownictwa polskiego. Wrocław, 1953.

Зб. Абрэмбскай-Яблонскай
Зб. памяці Абрэмбскай-Яблонскай
	Język i kultura białoruska w kontakcie z sąsiadami: Studia poświęcone Antoninie Obrębskiej-Jabłońskiej w stulecie urodzin. Warszawa, 2001.

Зб. Аванесаву
	Русское и славянское языкознание: сб. ст.: к 70-летию чл.-корр. АН СССР Р. И. Аванесова. М., 1972.

Зб. Багародзіцкаму
Зб. памяці Багародзіцкага
	Памяти В. А. Богородицкого: к столетию со дня рождения // Ученые записки / Казан. гос. ун-т им. В. И. Ульянова-Ленина. Т. 119, кн. 5. Казань, 1961.

Зб. Баркоўскаму
	Проблемы истории и диалектологии славянских языков: сб. ст.: к 70-летию чл.-корр. АН СССР В. И. Борковского. М., 1971.

Зб. Бархудараву
	Вопросы исторической лексикологии и лексикографии восточнославянских языков: к 80-летию чл.-корр. АН СССР С. Г. Бархударова. М., 1974.

Зб. Беладзеду
	Слово і труд: до 70-річчя акад. I. К. Білодіда: зб. пр. Київ, 1976.

Зб. Бернштэйну
	Исследования по славянскому языкознанию: сб. в честь шестидесятилетия профессора С. Б. Бернштейна. М., 1971.

Зб. Брукнеру
	Studia staropolskie. Księga ku czci Aleksandra Brücknera. Kraków, 1928.

Зб. Буазаку
	Mélanges Émile Boisacq. [1-2]. Bruxelles, 1937-1938.

Зб. Варбат
	Ad fontes verborum. Исследования по этимологии и исторической семантике: к 70-летию Жанны Жановны Варбот. М., 2006.

Зб. Відоескаму
	Македонски jазик. Год. XL-XLI. 1989-1990: посветено на Божидар Видоески по повод 70-годишнината. Скопjе, 1995.

Зб. Вінаградаву
	Академику В. В. Виноградову к его 60-летию: сб. ст. М., 1956.

Зб. Вінаградаву₂
	Филологический сборник: к 100-летию со дня рождения акад. В. В. Виноградова. М., 1995.

Зб. Вольману
	Franku Wollmannovi k sedmdesátinám: sborník. Praha, 1958.

Зб. Гаўранку
	Studie a práce linguistické: k šedesátým narozeninám akad. Bohuslava Havránka. Praha, 1954.

Зб. Геаргіеву
	В чест на академик Владимир Георгиев. Езиковсдски проучвания по случай седемдесет години от рождението му. София, 1980.

Зб. Гірту
	Germanen und Indogermanen: Volkstum, Sprache, Heimat, Kultur. Festschrift für Herman Hirt. Bd. 1-2. Heidelberg, 19Зб.

Зб. Дорулі
	Život slova v dejinách a jazykových vzt’ahoch: na sedemdesiatiny profesora Jána Dorul’u. Bratislava, 2003.

Зб. Жураўлёву
	Слова. Концепты. Мифы: к 60-летию Анатолия Фёдоровича Журавлёва. М., 2011.

Зб. Звалінскаму
	Prace Filologiczne. Т. 32. Warszawa, 1985.

Зб. Івічу
	Jужнословенски филолог. Књ. LVII/3-4. Посвећено Павлу Ивићу. Београд, 2000.

Зб. Ісачанку
	Studia Linguistica Alexandra Vasilii filio Issatschenko a collegis amicisque oblata. Lisse, 1978.

Зб. Іўшычу
	Zbornik u čast Stjepana Ivšića: Ivšićev zbornik = Collectanea in Stephani Ivšić honorem. Zagreb, 1963.

Зб. Кашмідэру
	Festschrift für Erwin Koschmieder. München, 1958.

Зб. Кіпарскаму
	Lingua viget. Commentationes Slavicae in honorem V. Kiparsky. Helsinki, 1964.

Зб. Крапіве
	Беларускае і славянскае мовазнаўства: да 75-годдзя акад. АН БССР Кандрата Кандратавіча Крапівы. Мінск, 1972.

Зб. Крымскаму
	А. Ю. Кримський - україніст і орієнталіст. Київ, 1974.

Зб. Крэчмеру
	Festschrift für Universitäts-Professor Hofrat Dr. Paul Kretschmer: Beiträge zur griechischen und lateinischen Sprachforschung. Wien, 1926.

Зб. Курыловічу
	Symbolae linguisticae in honorem Georgii Kuryłowicz. Wroclaw [etc.], 1965.

Зб. Ламанскаму
	Сборник статей, посвященных почитателями акад. <.. .> В. И. Ламанскому по случаю пятидесятилетия его ученой деятельности. Ч. 1-2. СПб., 1907-1908.

Зб. Лер-Сплавінскаму
	Studia linguistica in honorem Thaddaei Lehr-Spławiński. Warszawa, 1963.

Зб. Лімінгу
	Collectanea Slavica: in honorem Henrici Leeming. Kraków, 1996 (Prace Komisji Słowianoznawstwa, 50).

Зб. Логару
	Logarjev zbornik: Zbornik razprava iz slovenskega jezikoslovja. Tinetu Logarju ob sedemdesetletnici. Ljubljana, 1989.

Зб. Макіенку
	Грани слова: сб. науч. ст. к 65-летию проф. В. М. Мокиенко. М., 2005.

Зб. Мальдзісу
	Беларусь і беларусы ў прасторы і часе: зб. да 75-годдзя Адама Мальдзіса. Мінск, 2007.

Зб. Мерку
	Merkujev zbornik // Jezikoslovni zapiski. Letn. 13, št. 1-2. Ljubljana, 2007.

Зб. Мікале
	Mélanges de philologie, offerts à M. J. J. Mikkola <...> à l'occasion de son soixante-cinquième anniversaire. Helsinki, 1931.

Зб. Мілецічу
	Сборник в честь на проф. Л. Милетич за седемдесетгодишнината от рождението му (1863-1933). София, 1933.

Зб. Младэнаву
	Езиковедски изcледования в чест на акад. Стефан Младенов. София, 1957.

Зб. Нахцігалу
	Nahtigalov zbornik: Slovansko jezikoslovje. Ljubljana, 1977.

Зб. памяці Закрэўскай
	Діалектологічні студії. 3: зб. пам’яті Ярослави Закревської. Львів, 2003.

Зб. памяці Ларына₁
	Вопросы теории и истории языка: сб. ст., посвящ. памяти Б. А. Ларина. Л., 1969.

Зб. памяці Ларына₂
	Славянская филология. Вып. 2: памяти проф. Бориса Александровича Ларина. Л., 1972.

Зб. памяці Раманскага
	Езиковедско-етнографски изcледвания в памет на акад. Стоян Романски. София, 1960.

Зб. памяці Слаўскага
	Dzieje Słowian w świetle leksyki: pamięci prof. Franciszka Sławskiego. Kraków, 2002.

Зб. памяці Стойкава
	В памет на проф. Стойко Стойков. Езиковедски изследвания. София, 1974.

Зб. памяці Талстога
	Слово и культура: памяти Никиты Ильича Толстого. Т. 1-2. М., 1998.

Зб. памяці Трубачова
	История и культура славян в зеркале языка: славянская лексикография. III чтения памяти акад. О. Н. Трубачева: тез. докл. и выступ. М., 2005.

Зб. Педэрсену
	Mélanges linguistiques offerts à M. Holger Pedersen а l’occasion de son soixante-dixieme anniversaire. [Kabenhavn], 1937 (Acta Jutlandica. Vol. 9, № 1).

Зб. Петравічу
	Melanges linguistiques offerts à Emil Petrovici par ses amis étrangers à l’occasion de son soixantième anniversaire. [Bucarest], 1958.

Зб. Пізані
	Studi linguistici in onore di Vittore Pisani. Vol. 1-2. Brescia, 1969.

Зб. Развадоўскаму
	Symbolae grammaticae in honorem Joannis Rozwadowski. Vol. 1-2. Kraków, 1927-1928.

Зб. Расэці
	Omagiu lui Alexandru Rosetti la 70 de ani. Bucuresti, 1965.

Зб. Русэку
	Съкровище словесное: studia slawistyczne ofiarowane profesorowi Jerzemu Ruskowi na 70. urodziny. Kraków, 2000.

Зб. Слаўскаму
	Slawistyczne studia językoznawcze: prof. Dr. Franciszkowi Sławskiemu w 70. rocznicę urodzin i 50-lecie pracy naukowej <...>. Wrocław [etc.], 1987.

Зб. Стоўксу
	Festschrift Whitley Stokes zum siebzigsten Geburtstage. Leipzig, 1900.

Зб. Супруну
	Число - Язык - Текст: сб. ст. к 70-летию А. Е. Супруна. Минск, 1998.

Зб. Сяткоўскаму
	Prace Filologiczne. Т. 44. Warszawa, 1999.

Зб. Талстому
	Philologia slavica: к 70-летию акад. Н. И. Толстого. М., 1993.

Зб. Томсэну
	Festschrift Vilhelm Thomsen. Zur Vollendung des siebzigsten Lebensjahres. Leipzig, 1912.

Зб. Траўнічку
	Studie ze slovanské jazykovĕdy: sb. k 70. narozeninám akad. Františka Trávnička. Praha, 1958.

Зб. Унбегаўну
	Studies in Slavic Linguistics and Poetics in Honor of Boris O. Unbegaun. New York, 1968.

Зб. Фальку
	Studia linguistica slavica baltica. Canuto-Olavo Falk sexagenario a collegis, amicis, discipulis oblata. Lund, 1966.

Зб. ФЛ
	Зборник за филологиjу и лингвистику. Нови Сад, 1957-1983; з 1984 г. - Зборник Матице српске за филологиjу и лингвистику.

Зб. Чыжэўскаму
	Festschrift für Dmytro Čyževs’kyj zum 60. Geburtstag. Berlin, 1954.

Зб. Ягічу
	Jagić-Festschrift: zb. u slavu Vatroslava Jagiča. Berlin, 1908.

Зб. Якабсону
	To honor Roman Jakobson: essays on the occasion of his 70. birthday. Hague; Paris, 1967.

Зданюкевіч, Łopat.
	Zdaniukiewicz A. A. Gwara Łopatowszczyzny. Fonetyka, fleksja, słownictwo. Wrocław [etc.], 1972.

Земляроб. каляндар
	Земляробчы каляндар. Мінск, 1990 (Беларуская народная творчасць).

Зеньк.
	Зенковичи В. и А. Верования и обряды жителей Могилевской губ. - белорусов // Изв. О-ва любителей естествознания, антропологии и этнографии. Т. 28: Тр. Этнограф. отд. Кн. 4. М., 1877.

Зізаній
	«Лексис» Лаврентія Зизанія. Сіноніма славеноросская. Київ, 1964.

ЗІФВ УАН
	Записки історично-філологічного відділу / Всеукр. Акад. наук. Кн. 1-26. Київ, 1919-1931.

Зн.
Зн., дыс.
	Зенько И. И. Говоры Пружанского района Брестской области: дис. ... канд. филол. наук. Минск, 1953.

ZNGd
	Zeszyty Naukowe Uniwersytetu Gdańskiego. Wydział Humanistyczny. Prace Językoznawcze. Gdańsk, 1958 і наст.

ЗНТШ
	Записки Наукового товариства імені Шевченка. Львів, 1892-1937 (узноўлены ў 1948 г. у ЗША; ва Украіне - з 1990 г.).

ZNUJ
	Zeszyty Naukowe Uniwersytetu Jagiellońskiego. Prace językoznawcze. Kraków, 1956 і наст.

ZNUK
	Zeszyty naukowe Uniwersytetu Kopernika w Toruniu. Nauki humanistyczno-spoleczne. Filologia Polska. Toruń, 1959 і наст.

Золтан, Athila
	Zoltan A. Oláh Miklós Athila címu munkájánok XVI századi lenguel’ és fehérorosz fordítása. Nyíregyháza, 2004.

Золтан, Из истории
	Золтан А. Из истории русской лексики. Будапешт, 1987.

ZPSS
	Z polskich studiów slawistycznych. Warszawa, 1958 і наст.

ЗРГО
	Записки Русского географического общества по Отделению этнографии. СПб., [1846]1867–1917.

Зубаты, Studie
	Zubatý J. Studie a články. Sv. 1: Výklady etymologické a lexikální. Sv. 1-2. Praha, 1945-1949.

ЗФЛ
	Зборник Матице српске за филологиjу и лингвистику. Нови Сад, 1957 і наст.

З–ч
	Белорусские свадебные обряды и песни сравнительно с великорусскими / сост. А. З-ч [А. Ф. Занкевич]. СПб., 1897.

Зял.
	Минская губерния: в 2 ч. / сост. И. Зеленский. СПб., 1864 (Материалы для географии и статистики России, собранные офицерами Генерального штаба).

Зяленін, Russ. Volksk.
	Zelenin D. Russische (ostslavische) Volkskunde. Berlin, 1928.

Зяленін, Табу
	Зеленин Д. К. Табу слов у народов Восточной Европы и Северной Азии. Ч. 1-2 // Сборник Музея антропологии и этнографии. Т. 8-9. Л., 1929-1930.

Зяневіч, АКД
	Зеневич 3. А. Названия домашних животных в старобелорусском языке: автореф. дис. ... канд. филол. наук. Минск, 1970.

Зянк.
	Zienkiewicz R. Piosenki gminne ludu pińskiego. Kowno, 1851.

ИАН ОЛЯ
	Изв. Акад. наук СССР. Отд-ние лит. и языка. М., 1940 і наст.

Іванаў, Глагол
	Иванов Вяч. Вс. Славянский, балтийский и раннебалтийский глагол: индоевропейские истоки. М., 1981.

Іванаў, Общеинд.
Іванаў, Общеиндоевр., прасл. и анатол.
	Иванов Вяч. Вс. Общеиндоевропейская, праславянская и анатолийская языковые системы. М., 1965.

Іванаў-Тапароў, Иссл.
	Иванов Вяч. Вс., Топоров В. Н. Исследования в области славянских древностей: лексические и фразеологические вопросы реконструкции текстов. М., 1974.

Іванаў-Тапароў, Слав. яз. мод. системы
	Иванов Вяч. Вс., Топоров В. Н. Славянские языковые моделирующие семиотические системы (Древний период). М., 1965.

Івіч, Галип.
	Ивић И. О говору Галипољских Срба. Београд, 1957.

Из истории рус. сл.
	Из истории русских слов: слов.-пособие. М., 1993.

ИИБЕ
	Известия на Института за български език. София, 1951 і наст.

IJSLP
	International Journal of Slavic Linguistics and Poetics. s’Gravenhage, 1959 і наст.

ИКПИ
	Изв. Крым. пед. ин-та им. М. В. Фрунзе. Симферополь, 1927-1961.

Иност. сл.
	Словарь иностранных слов. М., 1937.

Ин. сл.
	Словарь иностранных слов. М., 1964.

Інстр.
	Інструкцыя па збіранню матэрыялаў для складання абласных слоўнікаў беларускай мовы. Вып. 1-3. Мінск, 1959-1966.

Інстр. лекс.
	Інструкцыя па збіранню матэрыялаў для складання лексічнага атласа беларускай мовы. Мінск, 1971.

ИОРЯС
	Изв. Отд. рус. яз. и словесности Имп. Акад. наук. СПб., 1896 і наст.

Исслед. ист. лекс.
	Исследования по исторической лексикологии древнерусского языка: сб. ст. М.,1964.

Исслед. по слав. диал.
	Исследования по славянской диалектологии. М., 1992 і наст.

Исслед. по словообр. и лекс.
	Исследования по словообразованию и лексикологии древнерусского языка: сб. ст. М., 1969.

IF
	Indogermanische Forschungen. Straßburg; Berlin; Leipzig, 1892 і наст.

JBS
	Journal of Byelorussian Studies. London, 1965 і наст.

Jez. zap.
	Jezikoslovni zapiski. Ljubljana, 1991 і наст.

JIRS
	Jahresbericht des Instituts für rumänische Sprache (Rumänisches Seminar) zu Leipzig, 1894-1924.

JP
	Język Polski. Organ Towarzystwa Miłośników Języka Polskiego. Kraków, 1913 і наст.

JS
	Jezik in slovstvo. Ljubljana, 1955 і наст.

JФ
	Jужнословенски филолог. Београд, 1913 і наст.

JČ
	Jazykovedný časopis. Bratislava, 1953 і наст.

КАБ
Карт. Атл. Беласточчыны
	Картатэка Атласа Беласточчыны (Варшава; Інстытут славістыкі ПАН).

Казкі і лег.
	Казкі і легенды роднага краю. Мінск, 1960.

Казлова, Регионализмы
	Козлова Р. М. Белорусские регионализмы праславянского происхождения (на материале лексики Восточного Полесья): автореф. дис. ... канд. филол. наук. Минск, 1977.

Кал.
	Гаўрош Н., Трыпуціна Т. Слоўнік Калюгавай мовы // Калюга Лукаш. Творы. Мінск, 1992.

Калал
	Kálal М. Slovenský slovník z literatúry aj náreči. Banská Bystrica, 1924.

Каламіец, Рыбы
	Коломиец В. Т. Происхождение общеславянских названий рыб. Киев, 1983.

Kalbotyra
	Kalbotyra. Mokslo darbai. Vilnius, 1958 і наст.

Каліма, Ostseefin.
	Kalima J. Die ostseefinnischen Lehnwörter im Russischen. Helsinki, 1919.

Канкард. XIX ст.
	Канкарданс беларускай мовы XIX стагоддзя: электронныя, тэкставыя даныя і праграма / аўт.-склад. Н. М. Сянкевіч. Мінск, 2015 (электрон. апт. дыск).

Каня, Słownik
	Kania S. Słownik argotyzmów. Warszawa, 1995.

Кап.
	Капанасевич. Отличительные черты говора жителей Минской губернии (рукапіс; СПб.; Архіў Бібліятэкі РАН).

Караджыч, Сабр. дела
	Сабрана дела Вука Карацића. Књ. 1-. Београд, 1964 і наст.

Каранчэўскі, Polska term. gram.
	Koronczewski A. Polska terminologia gramatyczna. Wrocław [etc.], 1961.

Карловіч
	Karłowicz J. Słownik gwar polskich. T. 1-6. Kraków, 1900-1911.

Карловіч, Wyr. obce
	Karłowicz J. Słownik wyrazów obcego a mniej jasnego pochodzenia używanych w języku polskim. Kraków, 1894-1905.

Карпат. диал. оном.
	Карпатская диалектология и ономастика: сб. ст. М., 1972.

Карпенка, Назв.
	Карпенко Ю. А. Названия звездного неба. М., 1981.

Карскі 1
	Карский Е. Ф. Белорусы. Т. 2: Язык белорусского народа. Вып. 1: Исторический очерк звуков белорусского языка. М., 1955.

Карскі 2-3
	Карский Е. Ф. Белорусы. Т. 2: Язык белорусского народа. Вып. 2: Исторический очерк словообразования и словоизменения в белорусском языке; вып. 3: Очерки синтаксиса белорусского языка. М., 1956.

Карскі, Белорусы
	Карский Е. Ф. Белорусы. Т. 1: Введение в изучение языка и народной словесности. Варшава, 1903.

Карскі, Труды
Кар., Труды
	Карский Е. Ф. Труды по белорусскому и другим славянским языкам. М., 1962.

Каруліс
	Karulis К. Latviešu etimoloġijas vārdnīca. T. I-II. Rīga, 1992.

Касп.
	Каспяровіч М. I. Віцебскі краёвы слоўнік. Віцебск, 1927.

Каткоў, Очерки
	Котков С. И. Очерки по лексике южновеликорусской письменности XVI-XVIII вв. М., 1970.

Каткоў, Сказки
	Котков С. И. Сказки о русском слове. М., 1967.

Каўрус
	Каўрус А. Словы з роднай гаворкі // Роднае слова. 2016. № 1-3.

Каўрус, Словаклад
	Каўрус А. Словаклад: слоўнік адметнай лексікі. Мінск, 2013.

КГС
КГСБМ
	Картатэка «Слоўніка старабеларускай мовы» / «Гістарычнага слоўніка беларускай мовы» (Інстытут мовазнаўства імя Я. Коласа НАН Беларусі).

Кіпарскі, Gemeinslav.
	Kiparsky V. Die gemeinslavischen Lehnwörter aus dem Germanischen. Helsinki, 1934.

Кіпарскі, Fremdes
	Kiparsky V. Fremdes im Balten-deutsch. Helsinki, 1936.

Кіркор
	Киркор А. Литовское Полесье. Белорусское Полесье // Живописная Россия. Т. 3, ч. 1-2. СПб.; М., 1882.

Кіс.
	Киселевский А. Латинско-русско-белорусский ботанический словарь. Минск, 1967.

Кісялёў, Частицы
	Киселев И. А. Частицы в современных восточнославянских языках. Минск, 1976.

Кітаб Луцкевіча
	Китаб Ивана Луцкевича - памятник народной культуры литовских татар = Ivano Luckevičiaus kitabas - Lietuvos totorių kultūros paminklas. Вильнюс, 2009.

Кіш, Hatv.
	Kiss L. Hatvanhét szómagyarázat. Budapest, 1970.

Клемянсевіч, Gr.
	Klemensiewicz Z., Lehr-Spławiński T., Urbańczyk S. Gramatyka historyczna języka polskiego. Warszawa, 1964.

Клемянсевіч, Hist.
	Klemensiewicz Z. Historia języka polskiego. Warszawa, 1974.

Клепікава, Паст. терм.
	Клепикова Г. П. Славянская пастушеская терминология: ее генезис и распространение в языках карпатского ареала. М., 1974.

Клім.
Клімч.
	Климчук Ф. Д. Специфическая лексика Дрогичинского Полесья // Лексика Полесья: материалы для полесского диалектного словаря. М., 1968.

Кліх
	Klich Е. Teksty białoruskie z powiatu Nowogródzkiego: słowniczek // Materiały i Prace Komisii językowej Akademii Umiejętności. T. II. Kraków, 1907.

Клундук
	Клундук С. С. Слова да слова – будзе мова: дыялектны слоўнік в. Фядоры. Брэст, 2010.

Клюге
Клюге₁₈
	Kluge F. Etymologisches Wörterbuch der deutschen Sprache. 18. Aufl. [і наст.]. Bearb. von W. Mitzka. Berlin, 1960.

Клюге–Гётце
	Kluge F. Etymologisches Wörterbuch der deutschen Sprache. 15. neubearb. Aufl. von A. Götze. Berlin, 1951.

Клюге, Seemannsspr.
	Kluge F. Seemannssprache. Wortgeschichtliches handbuch <...>. Halle an der Saale, 1911.

Кнежа
	Kniezsa I. A magyar nyelv szláv jövevényszavai. І–II. Budapest, 1955.

Козыраў, Очерки
	Козырев И. С. Очерки по сравнительно-типологической лексикологии русского и белорусского языков. Орел, 1970.

Козыраў, Формирование
	Козырев И. С. Формирование словарных составов русского и белорусского языков: соматическая лексика. Минск, 1983.

Коласава, Лексика
	Колосова В. Б. Лексика и символика славянской народной ботаники. Этнолингвистический аспект. М., 2009.

Кольб.
	Kolberg О. Dzieła wszystkie. Т. 52: Białoruś - Polesie. Wrocław; Poznań, 1968.

Копечны, Zákl. zásoba
	Kopečný F. Základni všeslovanská slovní zásoba. Praha, 1981.

Коржынэк, Studie
	Kořínek J. M. Studie z oblasti onomatopoje. Příspĕvek k otázce indoevropského ablautu. Praha, 1934.

Кос.
	Косич М. Н. Литвины-белорусы Черниговской губернии, их быт и песни // Живая старина. Вып. 2, 3-4. СПб., 1901.

Кохман
	Kochman S. Studia nad słownictwem i frazeologią słowiańską. Opole, 2005.

Кохман, Kontakty
	Kochman S. Polsko-rosyjskie kontakty językowe w zakresie słownictwa w XVII wieku. Wrocław [etc.], 1967.

Кохман, Polonica
	Kochman S. Polonica w leksykografii rosyjskiej XVIII wieku. Wrocław [etc.], 1975.

Кохман, Stosunki
	Kochman S. Polsko-rosyjskie stosunki językowe od XVI do XVIII w. Słownictwo. Opole, 1975.

Кралік
	Králik Ľ. Stručný etymologický slovník slovenčiny. Bratislava, 2015.

Краўчук, Дифферент
	Кравчук Р. В. Дифференциация праславянских культурных диалектов по данным словообразования (фрагменты славянского словообразования): докл. на IX Междунар. съезде славистов. Минск, 1983.

Крачк.
	Крачковский Ю. Быт западнорусского селянина // Чтения в Обществе истории и древностей российских при Московском университете. Кн. 4. М., 1873.

Краш.
	Kraszewski J. J. Wspomnienia Wołynia, Polesia i Litwy. T. 1. Wilno, 1840.

Краязн. газ.
	Краязнаўчая газета. Мінск, 2003 і наст.

Крукоўскі, Уплыў
	Крукоўскі Н. I. Рускі лексічны ўплыў на сучасную беларускую літаратурную мову. Мінск, 1958.

Крупянка, Formacje
	Krupianka A. Formacje czasownikowe z przedrostkiem o-(ob-) w języku polskim. Toruń, 1969.

Крыв.
	Кривицкий А. А. Из словаря полесских рыболовов // Полесье: Лингвистика. Археология. Топонимика. М., 1968.

Крывіцкі, Дыялекталогія
	Кривицкий А. А. Дыялекталогія беларускай мовы: дапам. для філал. спецыяльнасцей ВНУ. Мінск, 2003.

Крывіч
	Крывіч // Kryvič: месячнік літаратуры, культуры і грамадскага жыцця / пад рэд. В. Ластоўскага і К. Дуж-Душэўскага. Коўна/Kaunas, 1923-1927.

Крымскі, Др.-киев. говор
	Крымский А. Е. Древнекиевский говор. СПб., 1907.

Крымскі, Тюрки
	Кримський А. Ю. Тюрки, їх мови та литератури. Ч. 1-2 // Зб. іст.-філол. від. ВУАН. № 105. Київ, 1930.

Крынжалэ
	Cränjalä D. Rumunské vlivy v Karpatech se zvláštním zřetelem k Moravskému Valašsku. Praha, 1938.

Крыў., Дзіс.
	Крыўко M. Картатэка Слоўніка Дзісеншчыны (Інстытут мовазнаўства імя Я. Коласа НАН Беларусі).

Крыў., Са сл. Дзіс.
	Крыўко М. Са слоўніка Дзісеншчыны // Полымя. № 6. Мінск, 1985.

Крыўя
	Крыўя // Kryŭja: Crivica, Baltica, Indogermanica: навук. часоп. / Фонд развіцця традыцыйнай этнічнай культуры (ФРТЭК), Цэнтар этнакасмалёгіі «Крыўя». Менск, 1994-1998.

Крэмер, Słowniczek
	Kremer A. Słowniczek prowincjonalizmów podolskich ułożony w Kamieńcu Podolskim w roku 1863 // Język polski dawnych Kresów Wschodnich. T. 2: Studia i materiały. Warszawa, 1999.

Крэчмер, Wortgeogr.
	Kretschmer P. Wortgeographie der hochdeutschen Umgangssprache. Göttingen, 1918.

КСГ
	Картатэка Слоўніка Гомельшчыны (Гомельскі дзяржаўны ўніверсітэт імя Ф. Скарыны). [Гл. таксама: Арх. ГУ.]

КСИС
	Краткие сообщения Института славяноведения. М., 1951-1965.

КСНН
	Картатэка Слоўніка «Нашай Нівы» (Інститут мовазнаўства імя Я. Коласа НАН Беларусі). [Гл. таксама: Слоўнік мовы «Нашай Нівы» (1906– 1915). У 5 т. Т. 1-. Мінск, 2003 і наст.]

КСП
	Картатэка Слоўніка Полаччыны (рукапіс).

КСПГ
	Картатэка «Słownika gwar polskich» (Інститут польскай мови ПАН; Кракаў).

КСРНГ
	Картатэка «Словаря русских народных говоров» (Інститут лінгвістичних даследаванняў РАН; Санкт-Пецярбург).

КСТ
	Картатэка слоўніка Тураўшчыны / «Тураўскага слоўніка» (Інститут мовазнаўства імя Я. Коласа НАН Беларусі).

КТС
	Картатэка «Тлумачальнага слоўніка беларускай мови» (Інститут мовазнаўства імя Я. Коласа НАН Беларусі).

Кубанава, О тюрк.
	Кубанова Л. А. О тюркизмах русской диалектной лексики. Черкесск, 1967.

Кузеля-Чайкоўскі, Словар
	Кузеля 3., Чайковський М. Словар чужих слів. Чернівці, 1910.

Купішэўскі, Meteorol.
	Kupiszewski W. Słownictwo meteorologiczne w gwarach i historii języka polskiego. Wrocław, 1969.

Купішэўскі, Słownictwo
	W. Kupiszewski. Polskie słownictwo z zakresu astronomii i miar czasu. Wrocław [etc.], 1974.

Куркіна, Диал. структура
	Куркина Л. В. Диалектная структура праславянского языка по данным южнославянской лексики. Ljubljana, 1992.

Куркіна, Культура
	Куркина Л. В. Культура подсечно-огневого земледелия в зеркале языка. М., 2011.

Курс суч.
	Курс сучаснай беларускай літаратурнай мовы: Фанетыка. Арфаграфія. Лексікалогія. Мінск, 1961.

Курц, Hist.-slovn.
	Kurz I. К historickosrovnávacímu studiu slovanských jazyků. Praha, 1958.

Курцова, Polszczyzna
	Kurzowa Z. Polszczyzna Lwowa i kresów południowo-wschodnich do 1939 roku. Kraków 1983.

Курыловіч, L’apophonie
	Kuryłowicz J. L’apophonie en indocuropćen. Wrocław, 1956 (Prace językoznawcze; 9).

Куфэрак Віленшчыны
	Куфэрак Віленшчыны: гіст.-краязн. і літ.-маст. альманах. Вільня, 2000 і наст.

Куцала, Słownik
	Kucała M. Porównawczy słownik trzech wsi małopolskich. Wrocław, 1957 (Prace językoznawcze; 11).

Куціна, Формиров.
	Кутина Л. Л. Формирование языка русской науки: терминология математики, астрономии, географии в первой трети XVIII в. Л.; М., 1964.

Куч.
	Кучук I. М. Палескі дыялектны слоўнік. Спецыфічная лексіка гаворак Лельчыцкага р-на (рукапіс; Мазырскі дзяржаўны педагагічны ўніверсітэт). [Гл. таксама: ПСл]

KZ
	Zeitschrift für vergleichende Sprachforschung auf dem Gebiete der indogermanischen Sprachen, begründet von A. Kühn. Berlin (etc.), 1852 і наст. (ад Bd. 101 (1988) - Historische Sprachforschung).

КЭС
	Картатэка «Этымалагічнага слоўніка беларускай мовы» (Інститут мовазнаўства імя Я. Коласа НАН Беларусі).

КЭСРЯ
	Шанский Н. М., Иванов В. В., Шанская Т. В. Краткий этимологический словарь русского языка. М., 1971.

Кюнэ, Poln.
	Kühne Н. Polnische Lehnwörter im Weissrussischen. Berlin, 1960.

Кярсноўскі, Wstęp
	Kiersnowski R. Wstęp do numizmatyki polskiej wieków średnich. Warszawa, 1964.

ЛА
	Лексічны атлас беларускіх народных гаворак. Т. 1-5. Мінск, 1993-1998.

Language
	Language: Journal of the Linguistic Society of America. Baltimore, 1925 і наст.

Лапіч, Term. geogr.
	Łapicz Cz. Terminologia geograficzna w ruskich gwarach Białostocczyzny na tle wschodniosłowiańskim. Warszawa [etc.], 1981.

ЛАПП
	Никончук M. В. Матеріали до Лексичного атласу української мови (Правобережне Полісся). Київ, 1979.

Ларын, История
	Ларин Б. А. История русского языка и общее языкознание: избр. работы. М., 1977.

Ласт.
	Ластоўскі В. Падручны расійска-крыўскі (беларускі) слоўнік. Коўна, 1924.

Ластоўскі, Выбр. тв.
	Ластоўскі В. Выбраныя творы. Мінск, 1997.

Latv. Vest.
	Latvijas PSR Zinātņu Akadēmija vēstis. Rīga, 1947-1990.

Лаўманэ, Zivju
	Laumane B. Zivju nosaukumi latviešu valodā. Rīga, 1973.

Лаўр. лет.
	Лаврентьевская летопись // Полное собрание русских летописей. Т. 1, вып. 1: Повесть временных лет; вып. 2: Суздальская летопись; вып. 3: Приложения. 2-е изд. Л., 1926-1928 (фототип. воспр. текста - М., 1962).

Лаўроўскі, Назв. родства
	Лавровский П. Коренное значение в названиях родства у славян. СПб., 1867.

Лаўчутэ, Балтизмы
	Лаучюте Ю. А. Словарь балтизмов в славянских языках. Л., 1982.

Лаўшук
	Лаўшук А. С. Дыялекты вёскі Грабава Жыткавіцкага р-на Гомельскай вобл. (рукапіс).

ЛБ
	Лексикографічний бюлетень. Київ, 1951-1963; 2004 і наст.

LB
	Linguistica Baltica: International Journal of Baltic Linguistics. Warszawa, 1992 і наст.

Леванц.
	Леванцэвіч Л. В. Атлас гаворак Бярозаўскага раёна Брэсцкай вобласці. Лексіка. Брэст, 2001.

Ледэр, Fischn.
	Leder I. Russische Fischnamen. Wiesbaden, 1968.

Лек.
	Лекарственные растения и их применение. 5-е изд. Минск, 1975.

Лек. раст.
	Лекарственные растения и их применение. 6-е изд. Минск, 1976.

Лекс. балтызмы
	Лексічныя балтызмы ў беларускай мове: матэрыялы для абмеркавання. Мінск, 1969.

Лекс. Бел. Палесся
	Лексіка Беларускага Прыпяцкага Палесся. Атлас. Слоўнік. Мінск, 2008.

Лекс. і грам.
	Лексікалогія і граматыка: зб. арт. па беларус. і рус. мовах. Мінск, 1969.

Лекс. Палесся
Лексіка П.
ЛП
	Лексіка Палесся ў прасторы і часе. Мінск, 1971.

Лексика Пол.
Лекс. Пал.
	Лексика Полесья. Материалы для полесского диалектного словаря. М., 1968.

Лекс. ландш.
	Лексічныя ландшафты Беларусь Жывёльны свет. Мінск, 1995.

Lex. mac. du XVIе siècle
	Un lexique macédonien du XVIе siècle / Par Ciro Giannelli avec la collaboration de André Vaillant. Paris, 1958.

Лекс. сб.
ЛС
	Лексикографический сборник. Вып. 1-6. М., 1957-1963.

Leksyka słów.
	Leksyka słowiańska na warsztacie językoznawcy. Warszawa, 1997 (Prace slawistyczne; 105).

Лексикон львів.
	Хобзей H., Сімович К., Ястремська Т., Дидик-Меуш Г. Лексикон львівський: поважно і на жарт. Вид. 3-е, доп. і випр. Львів, 2015.

Леман, Altweib.
	Lehman А. Altweibersommer. Die Wärmerückfälle des Herbstes in Mitteleuropa / Phil. Diss. Parey; Berlin, 1911 [Гл. таксама: Landwirtschaftliche Jahrbücher. Bd. 41, 1911.]

Лер-Сплавінскі, O pochodzeniu
	Lehr-Spławiński T. O pochodzeniu i praojczyźnie Słowian. Poznań, 1946.

Лер-Сплавінскі, Studia
	Lehr-Spławiński T. Studia i szkice wybrane z językoznawstwa słowiańskiego. Seria 2. Warszawa, 1966.

Лер-Сплавінскі–Палянскі
	Lehr-Spławiński T., Polański K. Słownik etymologiczny języka Drzewian polabskich. Zesz. 1-6. Wrocław [etc.]; Warszawa, 1962-1994.

Лескін, Handbuch
	Leskien A. Handbuch der altbulgarischen (altkirchenslavischen) Sprache. Heidelberg, 1922.

Лёхін
	Словарь иностранных слов / под ред. И. В. Лёхина и проф. Ф. Н. Петрова. М., 1955.

Лідэн, Stud.
	Liden Е. Studien zur altindischen und vergleichenden Sprachgeschichte. Uppsala, 1897.

Liet. term.
	Lietuvių terminologija. Vilnius, 1975 (Вопросы литовского языкознания / Ин-т лит. языка и лит. АН Литовской ССР. Т. 16).

ЛіМ
	Літаратура і мастацтва: газета творчай інтэленгенцыі Беларусь Мінск, 1932 і наст.

Лінгв. геагр.
	Лінгвістычная геаграфія і групоўка беларускіх гаворак. Мінск, 1968.

Лінгв. дасл.
	Лінгвістычныя даследаванні: зб. арт. Мінск, 1971.

Лінгв. зб.
	Лінгвістычны зборнік: артыкулы, паведамленні, матэрыялы. Мінск, 1965.

Linguistica
	Linguistica. Ljubljana, 1955 і наст.

Linguistics
	Linguistics: An International Review. The Hague, 1963 і наст.

Ліндберг-Герд, Словарь
	Линдберг Г. У., Герд А. С. Словарь названий пресноводных рыб СССР на языках народов СССР и европейских стран. Л., 1972.

Ліндэ
	Linde S. В. Słownik języka polskiego. Т. 1-6. Lwów, 1854-1860.

Лір. бел. вяселля
	Лірыка беларускага вяселля / уклад. і рэд. Н. С. Гілевіча. Мінск, 1979.

LISL
	Lĕtopis Instituta za serbski ludospyt w Budyšinje. Rjad A: Rĕč a literatura. Budyšin, 1952 і наст.

Літ. статут 1588
	Статут Вялікага княства Літоўскага, 1588: Тэксты. Даведнік. Каментарыі. Мінск, 1989.

Ліўканен, Отглаг. сущ.
Люканен
	Лиукконен К. Восточнославянские отглагольные существительные на -m-. Т. 1: Существительные на *-тъ /*-та/ *-то. Helsinki, 1987 (Slavica Helsingiensia, 5).

Ліцв.
	Ліцвінка В. Д., Царанкоў Л. А. Слова міма не ляціць: беларускія народных прыказкі і прымаўкі. Мінск, 1985.

LKA
	Lietuvių kalbos atlasas. T. 1-3. Vilnius, 1977-1991.

LKŽ
	Lietuvių kalbos žodynas. T. 1-20. Kaunas; Vilnius, 1941-2002.

LKK
	Lietuvių kalbotyros klausimai / Acta linguistica Lithuanica [з 1999]. Vilnius, 1957 і наст.

ЛМТ
	Лінгвістычны мікраатлас Тураўшчыны. Мінск, 2016.

Локач
	Lokotsch К. Etymologisches Wörterbuch der europäischen (germanischen, romanischen und slavischen) Wörter orientalischen Ursprungs. Heidelberg, 1927.

Лома, Пракосово
	Лома А. Пракосово. Словенски и индоевропски корени српске епике. Београд, 2002.

Лорэнц, Pomor.
	Lorentz F. Pomoranisches Wörterbuch. Bd. 1-5. Berlin, 1958-1983 (Bd. 2-5 fotrgefürt von F. Hinze).

Лось, Сл. слова
	Лось И. Л. Сложные слова в польском языке: исследование. СПб., 1901.

LP
	Lingua Posnaniensis: Czasopismo poświęcone językoznawstwu porównawczemu i ogólnemu. Poznań, 1949 і наст.

LSl
	Lud Słowiański: pismo poświęcone dialektologji i etnografji Słowian. T. 1-4. Kraków, 1929-1938.

LUÅ
	Lunds Universitets Årsskrift. Lund, 1864-1904; Ny följd - 1905 і наст.

Лукашанец, Сацыял.
	Лукашанец А. Г. Беларускія сацыялекты XIX стагоддзя: вопыт тыпалагічнага апісання. Мінск, 1999.

Лукінова, Числ.
	Лукінова Т. Б. Числівники в слов’янських мовах (порівняльно-історичний нарис). Київ, 2000.

LF
	Listy Filologické // Folia philologica. Praha, 1874 і наст.

Лысенка, Жит.
	Лысенко П. С. Словарь диалектной лексики северной Житомирщини // Славянская лексикография и лексикология. М., 1966.

Лысенка, СПГ
	Лисенко П. С. Словник поліських говорів. Київ, 1974.

Лысенка, ССП
	Лисенко П. С. Словник діалектної лексики Середнього і Східного Полісся. Київ, 1961.

Львоў, Очерки
	Львов А. С. Очерки по лексике памятников старославянской письменности. М., 1966.

Лявіцкі
	Левицкий В. В. Этимологический словарь германских языков. Т. 1-3. Черновцы, 2000.

Ляц.
	Ляцкий Е. А. Материалы для изучения творчества и быта белорусов. 1: Пословицы, поговорки, загадки. М., 1898.

MAGP
	Mały atlas gwar polskich. 1-13. Wrocław [etc.]; Warszawa, 1957-1970.

Майргофер
	Mayrhofer M. Kurzgefaßtes etymologisches Wörterbuch des Altindischen. Bd. 1-4. Heidelberg, 1956–1980.

Макавецкі, Sł. botan.
	Makowiecki S. Słownik botaniczny łacińsko-małoruski. Kraków, 1936 (Prace Komisji Językowej, 24).

Макар.
	Макарэвіч В. З гаворак вёскі Купленкі // Полымя. № 8. Мінск, 1980.

Макарушка, Словар
	Макарушка О. Словар українських виразів, перенятих з мов туркських // Зап. Наук. т-ва ім. Шевченка. Т. 5. Львів, 1895.

Макоўскі, Мир сл. и знач.
	Маковский М. М. Удивительный мир слов и значений: иллюзии и парадоксы в лексике и семантике. М., 1989.

Мал.
	Малевич С. Белорусские народные песни. СПб., 1907.

Маладосць
	Маладосць: штомесячны літ.-маст. і грамад.-паліт. іл. часоп. Мінск, 1953 і наст.

Малч.
Малчанава, Мат. культ.
	Молчанова Л. А. Материальная культура белорусов. Минск, 1968.

Мальдзіс, Як жылі нашы продкі
	Мальдзіс А. Як жылі нашы продкі ў XVIII стагоддзі: эсэ; Восень пасярод вясны: аповесць, сатканая з гістарычных матэрыялаў і мясцовых паданняў. Мінск, 2009.

Малько, Геогр. терм.
	Малько Р. Н. Географическая терминология чешского и словацкого языков (на общеславянском фоне). Минск, 1974.

Малэцкі, Słownik
	Małecki М. Dwie gwary macedońskie (Sucho i Wysoka w Sołuńskiem). Cz. II: Słownik. Kraków, 1936.

Манаенкава, Словарь
	Манаенкова А. Ф. Словарь русских говоров Белоруссии. Минск, 1989.

Манжура
	Манжура И. И. Слова, записанные в Александровском, Новомосковском и других уездах Екатеринославской губернии // Сказки, пословицы и т. п., записанные в Екатеринославской и Харьковской губерниях. Харьков, 1890.

Мар. дыс.
	Марозаў В. I. Асаблівасці мовы твораў Ф. Багушэвіча: дыс. ... канд. філал. навук. Мінск, 1970.

Мартынаў, Балта-слав.-італ. ізал.
	Мартынов В. В. Балто-славяно-италийские изоглоссы: лексическая синонимия: докл. на VIII Междунар. съезде славистов. Минск, 1978.

Мартынаў, Дерив.
	Мартынов В. В. Праславянская и балто-славянская суффиксальная деривация имен: докл. на VII Междунар. съезде славистов. Минск, 1973.

Мартынаў, Лекс. взаим.
	Мартынов В. В. Славяно-германское лексическое взаимодействие древнейшей поры. Минск, 1963.

Мартынаў, Прарадзіма
	Прарадзіма славян: лінгвістычная верыфікацыя: дакл. на XII Міжнар. з’ездзе славістаў. Мінск, 1998.

Мартынаў, Прасл. яз.
	Мартынов В. В. Праславянский язык и его место в западнобалтийском диалектном континууме: докл. на X Междунар. съезде славистов. Минск, 1988.

Мартынаў, Слав. акком.
	Мартынов В. В. Славянская и индоевропейская аккомодация. Минск, 1968.

Мартынаў, Становление
	Мартынов В. В. Становление праславянского языка по данным славяно-иноязычных контактов: докл. на IX Междунар. съезде славистов. Минск, 1982.

Мартынаў, Этнагенез
	Мартынаў В. У. Этнагенез славян: Мова і міф: дакл. на XI Міжнар. з’ездзе славістаў. Мінск, 1993.

Мартынаў, Язык
	Мартынов В. В. Язык в пространстве и времени: к проблеме глоттогенеза славян. М., 1983.

Марфем. сл.
	Бардовіч А. М., Шакун Л. М. Марфемны слоўнік беларускай мовы. Мінск, 1975.

Марц.
	Марціновіч П. З карэліцкіх гаворак // Полымя. № 4. Мінск, 1974.

Марцэль, Pflanzennam.
	Marzell Н. Wörterbuch der deutschen Pflanzennamen. Bd. 1-5. Leipzig [etc.], 1943-1979 (перавыданне - Köln, 2000).

Марчанка, дыс.
Марч., дыс.
	Марченко E. 3. Бытовая предметная лексика в старобелорусских памятниках деловой письменности XV-XVI вв.: дис. ... канд. филол. наук. Вильнюс, 1965.

Маслава, Нар. одежда
	Маслова Г. С. Народная одежда русских, украинцев и белорусов в XIX - начале XX в. // Восточнославянский этнографический сборник: очерки народной материальной культуры русских, украинцев и белорусов в XIX - начале XX в. М., 1956 (Труды Института этнографии им. Н. Н. Миклухо-Маклая: новая серия; т. 31).

Маслен.
Масл.
	Масленникова Л. И. Из полесской терминологии транспорта // Лексика Полесья: материалы для полесского диалектного словаря. М., 1968.

Мат.
	Материалы для изучения белорусских говоров / под. ред. Е. Ф. Карского // а) Изв. Отд. рус. яз. и словесности Акад. наук (ИОРЯС РАН). Т. 2, кн. 2. СПб., 1897; Т. 3, кн. 3. СПб., 1898; Т. 4, кн. 3-4. СПб, 1899; б) Сборник ОРЯС. Т. 75, № 5. СПб, 1903; Т. 82, № 8. СПб., 1907; Т. 88, № 1. СПб, 1910.

Мат. АЛА
	Картатэка матэрыялаў «Агульнаславянскага лінгвістычнага атласа» (Інстытут мовазнаўства імя Я. Коласа НАН Беларусі).

Мат. Гом.
	Матэрыялы для слоўніка Гомельшчыны // Беларуская мова і мовазнаўства. Вып. 3-4. Мінск, 1975-1976; Беларуская мова. Вып. 5-10. Мінск, 1977-1982.

Мат. Гродз.
	Лексічныя матэрыялы для абласных слоўнікаў (рукапіс).

Мат. дыял. канф.
	Матэрыялы першай дыялекталагічнай канферэнцыі БССР. Мінск, 1950.

Мат. конф. МГПИ
	Материалы научно-теоретической конференции / Минс. пед. ин-т им. А. М. Горького. Секция филол. наук: тез. докл. Минск, 1961.

Мат. Маг.
	Матэрыялы да абласнога слоўніка Магілёўшчыны. Мінск, 1981.

Мат. Маг. 2
	Матэрыялы да абласнога слоўніка Магілёўшчыны. Вып. 2. Магілёў, 2005.

Мат. Мазыр.
	Матэрыялы да слоўніка гаворак Мазырскага Палесся: вучэб. дапам. па беларус. дыялекталогй. Мазыр, 1996.

Мат. Смал.
	Иванова А. И., Кустарева М. А., Моисеев Б. И. Материалы для «Смоленского областного словаря» // Ученые зап. Смоленского пед. ин-та. Вып. 9. Кафедра рус. языка. Смоленск, 1958.

Матус.
	Матусевіч Г. Маленькі слоўнік тубыльцаў // Наша Ніва. Мінск, 1997. 25 жн.

Махэк₁
	Machek V. Etymologický slovník jazyka českého a slovenského. Praha, 1957.

Махэк₂
	Machek V. Etymologický slovník jazyka českého. Druhé, oprav. a dopln. vyd. Praha, 1968.

Махэк, Jména
	Machek V. Česká a slovenská jména rostlin. Praha 1954.

Махэк, Recherches
	Machek V. Recherches dans le domaine du lexique balto-slave. Brno, 1934.

Махэк, Sehr. sp.
	Sebrané spisy Václava Machka. D. 1-2. Praha, 2011.

Махэк, Studie
	Machek V. Studie о tvoření výrazů expresivních. Praha, 1930.

Мацвееў, Финно-угор. заимствования
	Матвеев А. К. Финно-угорские заимствования в русских говорах Северного Урала // Ученые зап. Урал. гос. ун-та им. А. М. Горького. Вып. 32. Свердловск, 1959.

Мацэнаўэр, Cizí sl.
	Matzenauer A. Cizí slova ve slovanských řečech. Brno, 1870.

Маш.
	Moszyński К. Polesie Wschodnie: materiały etnograficzne z wschodniej części b. powiatu Mozyrskiego oraz z powiatu Rzeczyckiego. Warszawa, 1928.

Маш. Atlas
Машынскі, Atlas
	Moszyński K. Atlas kultury ludowej w Polsce. Zesz. 1-3. Kraków, 1934-1936.

Машынскі, Kultura
	Moszyński K. Kultura ludowa Słowian. T. 1: Kultura materialna. Warszawa, 1967; T. II: Kultura duchowa. Cz. 1-2. Warszawa, 1967-1968.

Машынскі, O sposobach
	Moszyński К. O sposobach badania kultury materialnej Prasłowian. Wrocław [etc.], 1962.

Машынскі, Pierw.
	Moszyński K. Pierwotny zasięg języka prasłowiańskiego. Wrocław, 1957.

Машынскі, Uwagi
	Moszyński K. Uwagi o słowiańskiej terminologii topograficznej i fizjograficznej, oparte przeważnie na materiale białorusko-poleskim // Archiwum Nauk Antropologicznych. T. 1, № 5. Lwów; Warszawa, 1921.

Mee, Études
	Meillet A. Études sur l’etymologie et le vocabulaire du vieux slave. Vol. 1-2. Paris, 1902-1905.

Mee, Общеслав.
	Мейе А. Общеславянский язык. M., 1951.

Мее-Ваян
	Meillet A. Le slave commun. 2 éd. par A. Vaillant. Paris, 1934.

Меер
	Meyer G. Etymologisches Wörterbuch der albanesischen Sprache. Straßburg, 1891.

Меер Крыч.
	Мейер Андрей. Описание Кричевского графства 1786 года // Раманаў Е. Р. З гісторыка-археалагічнай спадчыны: выбр. тв. Магілёў, 2006.

Междунар. конф. баптистов
	Tarptautinė baltistų konferencija // Pranešimų tezes = Междунар. конф. баптистов: тез. докл. = Internat. Conf. of Balticists: abstracts. Vilnius-Вильнюс, 1985.

Межресп. конф.
	Программа и тезисы межреспубликанской конференции по изучению лексики старобелорусских письменных памятников XV-XVII вв. Вильнюс, 1964.

Менгес, Вост. элем.
	Менгес К. Г. Восточные элементы в «Слове о полку Игореве». Л., 1979.

Мензбір, Птицы
	Мензбир М. А. Охотничьи и промысловые птицы Европейской России и Кавказа. Т. 1-2. М., 1900-1902.

Мерынгер, Beiträge
	Meringer R. Beiträge zur Geschichte der indogermanischen Deklination. Wien, 1891.

MESz
	A magyar nyelv történeti-etymológiai szótára. [T.] 1-4. Budapest, 1967-1984.

Metods of Etymological Practice
	Metods of Etymological Practice. Praha, 2012.

Мік.
	Микуцкий С. П. Белорусские слова // ИОРЯС РАН. Т. 3. СПб., 1854; [Беларускі слоўнік] (2010 слоў; рукапіс; Санкт-Петербург; Архіў Бібліятэкі РАН).

Мікала, Ält. Bezieh.
	Mikkola J. J. Die älteren Beziehungen zwischen Ostseefinnisch und Russisch. Helsinki, 1938.

Мікала, Balt.
	Mikkola J. J. Baltisches und Slavisches. Helsingfors, 1903.

Мікала, Berühr.
	Mikkola J. J. Berührungen zwischen den Westfinnischen und den Slavischen Sprachen. [Bd.] I: Slawische Lehnwörter in den Westfinnischen Sprachen. Helsingfors, 1894.

Мікала, Ursl. Gr.
	Mikkola J. J. Urslavische Grammatik; Einführung in das vergleichende Studium der slavischen Sprachen. T. 1-3. Heidelberg, 1913-1950.

Міклашыч
	Miklosich F. Etymologisches Wörterbuch der slavischen Sprachen. Wien, 1886.

Міклашыч, Lex. palaeosl.
	Miklosich F. Lexicon palaeoslovenico-graeco-latinum. Vindobonae, 1862-1865.

Міклашыч, Türk.
	Miklosich F. Die türkischen Elemente in den südostund osteuropäischen Sprachen: Griechisch, Albanisch, Rumunisch, Bulgarisch, Serbisch, Kleinrussisch, Grossrussisch, Polnisch. Bd. 1-2. Wien, 1889-1890.

Міклашыч, Vergl. Gr.
	Miklosich F. Vergleichende Grammatik der slavischen Sprachen. Bd. 1-4. Wien, 1875-1883.

Міклашыч, Fremdw.
	Miklosich F. Die Fremdwörter in den slavischen Sprachen. Wien, 1867.

Мікратапанімія Бел.
	Мікратапанімія Беларусі: матэрыялы. Мінск, 1974.

Мікуцкі, Третий отч.
	Микуцкий С. П. Третий отчет о путешествии 1854 г. // ИОРЯС. Т. 3, вып. 5. СПб., 1854.

Мілеўскі, Teoria
	Milewski Т. Teoria, typologia i historia języka. Kraków, 1993.

Мілк.
	Мілкоўскі В. Мой слоўнічак // Наша слова. 1996. 15 жн.; Матчына мова // Наша слова. 1999. 1 снеж.; 2000. 12 крас., 28 чэрв., 6 верас.

Мілк. Сл.
	Мілкоўскі В. Матчына слова: спроба слоўнічка некаторых рэгіянальных гаворак. Мінск, 2010.

Мифы
	Мифы народов мира. Т. 1-2. М., 1980.

Міхельсон, Рус. мысль
	Михельсон М. И. Русская мысль и речь. Свое и чужое. Опыт русской фразеологии: сб. образных слов и иносказаний. СПб., 1912.

Мішкінене, Seniausi
	Miškinienė G. Seniausi Lietuvos totorių rankraščiai (grafika, transliteracija, vertimas, tekstų struktūra ir turinys) = Древнейшие рукописи литовских татар (графика, транслитерация, перевод, структура и содержание текстов). Vilnius-Вильнюс, 2001.

MJ
	Македонски kазик. Скопjе, 1950 і наст.

MKL
	Meyers kleines Lexicon. Bd. 1-3. Leipzig, 1967-1968.

Младэнаў
	Младенов Ст. Етимологически и правописен речник на българския книжовен език. София, 1941.

Младэнаў, Диалектология
	Младенов М. Диалектология. Балканистика. Етнолингвистика. София, 2008.

Младэнаў, Чужд. думи
	Младенов Ст. Речник на чуждите думи в българския език. С обяснение на потекло и състав. 3. изд. София, 1947.

Мова бел. пісьм.
	Мова беларускай пісьменнасці XIV-XVIII стст. Мінск, 1988.

Мова Сен.
	Мова Сенненшчыны: дыялект. слоўн. Т. 1-2. Мінск, 2015.

Мовознавство
	Мовознавство: наук.-теорет. журн. Ін-ту мовознавства ім. О. О. Потебні. Київ, 1967 і наст.

Моргеншцернэ
	Morgenstierne G. An Etymological Vocabulary of Pashto. Oslo, 1927.

MPKJ
	Materiały i prace komisji Językowej Akademii Umiejętności. Kraków, 1904-1918.

MSGP
	Mały słownik gwar polskich. Kraków, 2010.

MSL
	Mémoires de la Société de linguistique de Paris. Paris, 1868-1935.

Мухл.
	Мухлинский [А. О.] Праздники, забавы, предрассудки и суеверные обряды простого народа в Новогрудском повете Литовско-Гродненской губернии // Вести. Европы. № 14-16. М., 1830.

Мызнікаў, Рус. гов. Обон.
	Мызников С. А. Русские говоры Обонежья: ареально-этимологическое исследование лексики прибалтийско-финского происхождения. СПб., 2003.

Мюленбах-Эндзелін
	Mühlenbach К. Latvišu valodas vārdnīca = Lettischdeutsches Wörterbuch. Bd. 1-4. Redigiert, ergänzt und fortgesetzt von J. Endzelin. Riga, 1923-1932.

Мядзв.
	Медведский С. И. Белорусский словарь. Толочино, 1910 (рукапіс; Санкт-Пецярбург; Архіў Бібліятэкі РАН).

Мял.
	Мялешка М. Камень у вераваннях і паданнях беларуса // Запіскі Аддзела гуманітарных навук Інстытута беларускай культуры: працы кафедры этнаграфіі. Т. 1, вып. 2. Менск, 1928.

Мяркулава, Очерки
	Меркулова В. А. Очерки по русской народной номенклатуре растений. М., 1967.

Нававейскі, Zapożyczenia
	Nowowiejski В. Zapożyczenia leksykalne z języka niemickiego w polszczyźnie XIX wieku: na materiale czasopism. Białystok, 1996.

Najdawniejsze zab.
	Najdawniejsze zabytki języka polskiego. Wrocław [etc.], 1967.

Нар. Гом.
Фальк. Гом.
Нар. лекс. Гом.
	Народная лексіка Гомельшчыны ў фальклоры і мастацкай літаратуры: слоўнік. Мінск, 1983.

Нар. лекс.
Нар. лексіка
	Народная лексіка. Мінск, 1977.

Нар. медыцына
	Народная медыцына. Рытуальна-магічная практика. Мінск, 2007 (Беларуская народная творчасць).

Нар. ск.
Нар. скарбы
	Народныя скарбы: дыялект. зб. да 80-годдзя А. А. Крывіцкага. Мінск, 2008.

Нар. сл.
Нар. слова
	Народнае слова. Мінск, 1976.

Нар. словатв.
	Народная словатворчасць. Мінск, 1979.

Нарысы дыял.
	Нариси па беларускай дыялекталогіі: вучэб. дапам. для філал. фак. ун-таў і педін-таў. Мінск, 1964.

Нас.
	Носович И. И. Словарь белорусского наречия. СПб., 1870. [Перавыданне разам з дадаткам (гл.: Нас. Доп.): Насовіч І.І. Слоўнік беларускай мовы. Мінск, 1983.]

Нас. Бел. песни
	Носович И. И. Белорусские песни // Зап. Рус. геогр. о-ва по Отд. этнографии. Т. 5. СПб., 1873.

Нас. гіст.
Нас. АУ
	Носович И. И. Алфавитный указатель старинных белорусских слов, извлеченных из «Актов, относящихся к истории Западной России», изданных в 1853 году (рукапіс; Санкт-Пецярбург; Архіў Бібліятэкі РАН).

Нас. Доп.
	Носович И. И. Дополнение к Белорусскому словарю. Слова, извлеченные из составленного им рукописного собрания Белорусских песен и сказок // Сборник ОРЯС. Т. 21, № 6. СПб., 1881.

Нас. Сб.
Нас. Сб. посл.
Нас. Зб.
	Носович И. И. Сборник белорусских пословиц // ИОРЯС. Т. 12, № 2. СПб., 1874.

Наш край
	Наш край: штомесячнік Цэнтр. бюро краязнаўства пры Ін-це беларус. культуры. Менск, 1925-1929; у 1930-1933 гг. - «Савецкая краіна» ў Беларускай Акадэміі павук.

Наша Ніва
	Наша Ніва // Nasza niwa - штотыднёвая грамадска-палітычная, навукова-асветніцкая і літаратурна-мастацкая газета. Вільня, 1906-1915; Мінск, 1991 г. і наст.

Наша Слова
	Наша слова: газета / Т-ва беларус. мовы імя Ф. Скарыны (ТБМ). Мінск, 1990 (з 1997 - Ліда) і наст.

Нейштад, Определитель
	Нейштадт М. И. Определитель растений средней полосы европейской части СССР: пособие для студентов пед. ин-тов и учителей. М., 1963.

Некр.
	Некрашэвіч С. Да характарыстыкі беларускіх гаворак Парыцкага раёна (Слоўнік гаворкі) // Запіскі аддзела гуманітарных навук Інстытута беларускай культуры. Працы класа філалогіі. Т. 2, кн. 9. Менск, 1929. [Гл. таксама: Некрашэвіч С. Слоўнік Парыччыны // Беларуская дыялекталогія: матэрыялы і даслед. Вып. 4. Мінск, 2016; Галуза I. У. Лексічныя матэрыялы Парыччыны // Тамсама.]

Некр. і Байк.
	Некрашэвіч С. і Байкоў М. Расійска-беларускі слоўнік. Менск, 1928.

Непакупны, Родичі
	Непокупний А. П. Балтійські родичі слов’ян. Київ, 1979.

Непакупны, Связи
	Непокупный А. П. Балто-севернославянские языковые связи. Киев, 1976.

Неўская, Балт. терм.
	Невская Л. Г. Балтийская географическая терминология (к семантической типологии). М., 1977.

Неўская, История слав. этим.
	Невская Т. В. История славянской этимологии в XIX в. (основные этапы развития): автореф. дис. ... канд. филол. наук. М., 1991.

НЗбЛен
	Науковий збірник Ленинградського товариства дослідників української історії, письменства та мови. Вип. 3. Київ, 1931.

НЗКіеўПІ
	Наукові Записки Київського педагогичного інституту імені О. М. Горького. Київ, 1939 і наст.

Ніва
	Ніва: тыднёвік беларусаў у Польшчы. Беласток, 1956 і наст.

Нідэрман, Balto-Sl.
	Niedermann М. Balto-Slavica. Neuchatel; Genève, 1956.

Нікалайчык, Отголоски
	Николайчик Ф. Д. Отголоски лирницкого языка // Киевская Старина. Апрель. Київ, 1890.

Нікан.
	Никончук Н. В. Полесские названия птиц // Лексика Полесья: материалы для полесского диалектного словаря. М., 1968.

Нікан., Трансп.
	Никончук М. В., Никончук О. М. Транспортна лексика правобережного Полісся в системі східнослов’янських мов. Київ, 1990.

Ніканч. Єндем.
	Никончук М. В., Никончук О. М. Єндемічна лексика Житомирщини. Житомир, 1989.

Ніканчук, Лесная лекс.
	Никончук А. Н. Лесная лексика украинских полесских говоров: автореф. дис. ... канд. филол. наук. Житомир, 1988.

Ніканчук, Матеріали
	Никончук М. В. Матеріали до лексичного атласу української мови: Правобережне Полісся. Київ, 1979.

Нік. Бабы
	Никифоровский Н. Я. Очерки Витебской Белоруссии. Вып. 7: Бабы або жонки. Витебск, 1898.

Нік. Заг.
	Никифоровский Н. Я. Простонародные загадки. Витебск, 1898.

Нік. Напаў.
	Нікіфароўскі М. Напаўпрыказкі - напаўпрымаўкі // Запіскі Аддзела гуманітарных навук Інстытута беларускай культуры. Працы класа філалогіі. Т. 2, кн. 4. Менск, 1928.

Нік., Няч.
	Никифоровский Н. Я. Нечистики: свод простонародных в Витебской Белоруссии сказаний о нечистой силе // Виленский временник. Кн. 2. Вильно, 1907.

Нік., Оч.
	Никифоровский Н. Я. Очерки Витебской Белоруссии. Вып. 1-5 // Этнографическое обозрение. М., 1892-1899.

Нікольскі, Жывёлы
	Нікольскі Н. М. Жывёлы ў звычаях, абрадах і вераваннях беларускага сялянства // Працы секцыі этнаграфіі (Беларуская АН. Ін-т гісторыі імя М. Н. Пакроўскага). Вып. 3. Мінск, 1933.

Нікольскі, Происхожд.
	Никольский Н. М. Происхождение и история белорусской свадебной обрядности. Минск, 1956.

Нік. Очерки
	Никифоровский Н. Я. Очерки простонародного житья-бытья Витебской Белоруссии. Витебск, 1895.

Нік. Посл.
	Никифоровский Н. Я. Полупословицы и полупоговорки, употребляемые в Витебской Белоруссии // Записки Северо-Западного отделения Русского географического общества. Кн. 3. Вильна, 1912.

Німчук, Давньорус.
	Німчук В. В. Давньоруська спадщина в лексиці української мови. Київ, 1992.

Нітшэ, Geograp.
	Nitsche Р. Geographische Terminologie des Polnischen. Köln, 1964. (Slavistische Forschungen. Bd. 4).

Ніч, Wybór pism
	Nitsch К. Wybór pism polonistycznych. T. 1-4. Wrocław [etc.], 1954-1958.

HJ
	Наш jезик. Београд, 1932 і наст.

NM
	Neuphilologische Mitteilungen. Helsingfors. Helsinki, 1899 і наст.

Новікава, Namen
	Novikova I. Die Namen der Nagetiere im Ostslavischen. Berlin, 1959. (Slavistische Veröffentlichungen des Osteuropa-Instituts an der FU Berlin. Bd. 19).

Новое в рус. этим.
	Новое в русской этимологии. Вып. I. М., 2003.

NŘ
	Naše řeč. Praha, 1917 і наст.

Оберпфальцэр, Rod
	Oberpfalcer F. Rod jmen v češtinĕ. Praha, 1933.

Общая лексика
	Общая лексика германских и балто-славянских языков. Киев, 1989.

Огледна св.
	Етимолошки одсек Института за српски jезик САНУ: огледна свезка. Београд, 1998.

Окс. сл.
	The Compact Edition of the Oxford English Dictionary. Vol. 1-2. Oxford, 1971-1980.

АЛА, Исследов.
ОЛА
ОЛА, Исследов.
	Общеславянский лингвистический атлас: материалы и исслед. М., 1965 і наст.

Олеш, Thesaurus
	Olesch R. Thesaurus linguae Dravaenopolabicae. Vol. 1-4. Köln; Wien, 1983-1987.

Onomastica Jugoslavica
	Onomastica Jugoslavica. Ljubljana, 1969 і наст.

Orientas
	Orientas Letuvos Didžiostos Kunigaikštijos visuomenes tradicijoje: totorai ir karaimai = Ориент в общественной традиции Великого княжества Литовского: татары и караимы. Vilnius, 2008.

Основы
	Основы финно-угорского языкознания: вопросы происхождения и развития финно-угорских языков. М., 1974.

Пагодзін, Следы
	Погодин А. А. Следы корней-основ в славянских языках. Варшава, 1903.

Paideia
	Paideia: Revista letteraria di informazione bibliographica. Genova, 1946 і наст.

Пал.
	Полевой А. О языке населения Новозыбковского уезда Гомельской губернии. Менск, 1926.

Palaeoslavica
	Palaeoslavica: International Journal for the Study of Slavic Medieval Literature, History, Language and Ethnology. Cambridge; Massachusetts, 1993 і наст.

Пан.
Панюціч, Лексіка
	Панюціч К. М. Лексіка народных гаворак. Мінск, 1976.

Пан. дыс.
Панюціч, дыс.
	Панюціч К. М. Лексіка сучаснай народнай гаворкі Ушаччыны: дыс. ... канд. філал. навук. Мінск, 1971.

Папоў, Из истории
	Попов А. И. Из истории лексики языков Восточной Европы. Л., 1957.

Папоўска-Таборска, Szkice 1
	Popowska-Taborska H. Szkice z kaszubszczyny. Cz. 1: Dzieje, zabytki, słownictwo. Gdańsk, 1987.

Папоўска-Таборска, Szkice 2
	Popowska-Taborska H. Szkice z kaszubszczyny. Cz. 2: Leksyka. Zabytki. Kontakty językowe. Gdańsk, 1998.

Пастусяк, Pogranicze
	Pastusiak K. Pogranicze polsko-białorusko-ukraińskie w świetle danych językowych i etnograficznych na podstawie nazw roślin. Warszawa, 2007.

Патабня, Из записок
	Потебня А. А. Из записок по русской грамматике. Т. 1-3. М., 1958-1968.

Патабня, К истории
	Потебня А. А. К истории звуков русского языка. Ч. II–IV: Этимологические и другие заметки. Варшава, 1880-1883.

Паўл.
	Паўлаў У. Быў светлы міг // Полымя. № 8. Мінск, 2000.

Паўленка, Нарысы
	Паўленка М. А. Нарысы па беларускаму словаўтварэнню: жаночыя асабовыя намінацыі ў старабеларускай мове. Мінск, 1978.

Паўль, Wörterb.
	Paul H. Deutsches Wörterbuch. 6. Aufl. Halle, 1959.

PBB
	Beitrage zur Geschichte der deutschen Sprache und Literatur. Hgb. H. Paul, W. Branne. Halle an der Saale, 1874.

ПБС
	Волкава Я. В., Авілава В. Л. Польска-беларускі слоўнік / Słownik polsko-białoruski. Мінск, 2004.

ПГС
	Падручны гістарычны слоўнік субстантыўнай лексікі. Т. 1-2. Мінск, 2013.

Персан, Beitr.
	Persson P. Beiträge zur indogermanischen Wortforschung. T. 1-2. Uppsala; Leipzig, 1912.

Песні нар. свят
	Песні народных свят і абрадаў / уклад. і рэд. Н. С. Гілевіча. Мінск, 1974.

Песні сямі вёсак
	Песні сямі вёсак: традыцыйная народная лірыка Міншчыны / уклад. і рэд. Н. С. Гілевіча. Мінск, 1973.

Петарсан, BSl
	Petersson Н. Baltisches und Slavisches. Lund, 1916.

Петарсан, Vergl. Wortst.
	Petersson H. Vergleichende slavische Wortstudien. Lund, 1922.

Петарсан, Wortstud.
	Petersson H. Baltische und slavische Wortstudien. Lund, 1918.

Піскуноў, Словарь
	Пискунов Ф. Словарь живого народного, письменного и актового языка русских южан Российской и Австро-Венгерской империи. Киев, 1882.

PJ
Por. jęz.
	Poradnik językowy. Warszawa 1901 і наст.

Плотнікава, Этнолингв. геогр.
	Плотникова А. А. Этнолингвистическая география Южной Славии. М., 2004.

Плятэршнік
	Pleteršnik М. Slovensko-nemški slovar. D. 1-2. Ljubljana, 1894-1895.

Покарны
	Pokorny J. Indogermanisghes etymologisches Wörterbuch. Bern; München, 1959-1969.

Полесье
	Полесье (Лингвистика. Археология. Топонимика). М., 1968.

Полымя
	Полымя: літаратурна-мастацкі і грамадска-палітычны часопіс. Мінск, 1922 і наст.

Попаўскі, Гостивар
	Поповски А. Македонскиот говор во Гостиварскиот Kpaj. Гостивар, 1970.

Праабражэнскі
	Преображенский А. Г. Этимологический словарь русского языка. Т. 1-2. М., 1910-1914; Т. 3. М.; Л., 1949.

Прабл. бел. тэрм.
	Першая нацыянальная канферэнцыя «Праблемы беларускай навуковай тэрміналогіі»: матэрыялы. Мінск, 1995.

Прабл. бел. філал.
Праблемы філал.
	Праблемы беларускай філалогіі: тэз. дакл. Рэсп. канф., прысвеч. 50-годдзю БССР і КПБ. Мінск, 1968.

Prasl. dialektizacija
	Praslovanska dialektizacija v luči etimoloških raziskav: Ob stoti obletnici rojstva akademika Franceta Bezlaja. Ljubljana, 2012.

Prasłowiańszczyzna
	Prasłowiańszczyzna i jej rozpad. Publikacja dedykowana XII Międzynarodowemu Kongresowi Slawistów. Warszawa, 1998.

Праці
	Prati A. Vocabolario etimologico italiano. Torino, 1951.

Праці XI
	Праці XI республіканської діалектологічної наради. Київ, 1965.

Працы ІМ
	Працы Інстытута мовазнаўства імя Якуба Коласа АН БССР. Вып. 1-8. Мінск, 1954-1961.

Прилози
	Прилози / Contributions. Одделение за лингвистика и литературна наука. Македонска академиjа на науките и уметностите. Скoпje, 1976 і наст.

Проблемы и.-е. яз.
	Проблемы индоевропейского языкознания. Этюды по сравнительно-исторической грамматике индоевропейских языков. М., 1964.

Прышч.
Прышч. дыс.
Прышч., дыс.
	Прышчэпчык А. М. Мікратапанімія Стаўбцоўшчыны: дыс. ... канд. філал. навук. Мінск, 1970.

Прэльвіц
	Prellwitz W. Etymologisches Wörterbuch der griechischen Sprache. 2. Aufl. Göttingen, 1905.

П. С.
	[Сергиевский П. H.] Сведения о белорусских крестьянских постройках, собранные летом 1903 г. в деревнях Молодечненской волости Виленского уезда Виленской губернии // Виленский временник. Кн. 2. Вильна, 1907.

PS
	Prace Slawistyczne / Polska Akad. Nauk. In-t slawistyki. Wrocław [etc.], 1977 і наст.

Пск. сл.
	Псковский областной словарь с историческими данными. Л./СПб., 1967 і наст.

ПСл
Лельч. сл.
	Кучук I. M., Малюк А. К. Палескі слоўнік: Лельчыцкі раён. Мазыр, 2000.

ПСл.
	Проблеми слов’янознавства. Львів, 1970 і наст. (Вип. 1-12 - Українське слов’янознавство).

ПСМ
	Питання слов’янського мовознавства. Кн. 1-9. Львів, 1948-1966.

Птицы, 1
	Надель-Червинская М. А., Червинский П. П. Энциклопедический мир Владимира Даля. Кн. 1: Птицы. Т. 1-2. Ростов н/Д, 1996.

PF
	Prace Filologiczne. Warszawa, 1885 і наст.

Пфуль
	Pfuhl Chr. Tr. Obersorbisches Wörterbuch / Fotomechanischer Neudruck. Bautzen, 1968.

Пыт. мовазн. і метод.
	Пытанні мовазнаўства і методыкі выкладання моў. Мінск, 1965.

ПЭЗб
	Полацкі этнаграфічны зборнік. Вып. 1: Народная медыцына Падзвіння: у 2 ч. Наваполацк, 2006.

ПЭСб
Полес. сб.
	Полесский этнолингвистический сборник: материалы и иссслед. М., 1983.

Пякарскі, Якут.
	Пекарский Э. К. Словарь якутского языка. Т. 1-3. [Москва], 1958.

Пятк.
Пятк. 1
	Pietkiewicz Cz. Polesie Rzeczyckie. Cz. 1: Kultura materialna. Kraków, 1928. Cz. 2: Kultura duchowa Polesia Rzeczyckiego. Warszawa, 1938.

Пятк. 2
	Pietkiewicz Cz. Polesie Rzeczyckie. Cz. 2: Kultura duchowa Polesia Rzeczyckiego. Warszawa, 1938.

Пятк. 3
	Pietkiewicz Cz. Kultura społeczna Polesia Rzeczyckiego. Toruń, 2013.

Пятр.
	Пятроўскі Я. Ангельска-беларускі слоўнік. Беларуска-ангельскі слоўнік = English-byelorussian dictionary. Byelorussian-english dictionary. Мінск, 1993.

Рабк.
	Рабкевіч В. Паслухай, што людзі кажуць. Мінск, 1985.

Равінскі, Черног.
	Ровинский П. Черногория в ее прошлом и настоящем. Т. II, ч. 3: Песни. Язык. СПб., 1905.

Рагаўц.
	Рагаўцоў В. Матчыныя словы: З лексікі стрэшынскай гаворкі // Наша слова, 2002. 16 кастр.

Радлаў, Опыт
	Радлов В. В. Опыт словаря тюркских наречий = Versuch eines Wörterbuches der Türk-Dialecte. T. 1-4. СПб., 1893-1911.

Радч.
	Радченко 3. Гомельские народные песни (белорусские и малорусские). Записаны в Дятловицкой вол. Гомельского у. Могилевской губ. // Записки РГО по Отделению этнографии. Т. 13, вып. 2. СПб., 1888.

Развадоўскі, Wybór
	Rozwadowski J. Wybór pism. T. 1-3. Warszawa, 1959-1960.

Развадоўскі, Studia
	Rozwadowski J. Studia nad nazwami wód słowiańskich. Kraków, 1948.

Рам.
	Романов E. P. Белорусский сборник. Вып. 1-9. Киев; Витебск; Вильна, 1886-1912.

Рам. Выбр. тв.
	Раманаў Е. Р. З гісторыка-археалагічнай спадчыны. Выбраныя творы. Магілёў, 2006.

Рам. Мат. Гр.
	Романов Е. Р. Материалы по этнографии Гродненской губ. Вып. 1-2. Вильна, 1911-1912.

Раманава, Меры
	Романова Г. Я. Наименования мер длины в русском языке. М., 1975.

Рамз.
	Рамзевич Н. Из лексикона о белорусской розге (по поводу 40-летия отмены телесных наказаний) // Филологические записки. Вып. 4-5. Воронеж, 1903.

Рамза, Бел. гутарк.
	Беларускае гутарковае маўленне: сучасны стан. Мінск, 2011.

Рамстэт
	Ramstedt G. J. Kalmückisches Wörterbuch. Helsinki, 1935.

Расл. св.
	Раслінны свет: тэмат. слоўн. Мінск, 2001.

Rasprave
	Rasprave Zavoda za hrvatski jezik. Knj. 1-21. Zagreb, 1975-1995; Rasprave Instituta za hrvatski jezik і jezikoslovlje. Knj. 22-. Zagreb, 1996 і наст.

Раст.
	Расторгуев П. А. Северско-белорусский говор: исслед. в области диалектологии и истории белорус. говоров. Л., 1927.

Растарг.
Растаргуеў, Бранск.
	Расторгуев П. А. Словарь народных говоров Западной Брянщины. Минск, 1974.

Растаргуеў, Говоры
	Расторгуев П. А. Говоры на территории Смоленщины. М., 1960.

Растафінскі, Symbola
	Rostafiński J. Symbola ad historiam naturalem medii aevi. P. 1-2. Kraków, 1900.

Расянен
	Räsänen M. Versuch eines etymologischen Wörterbuchs der Türksprachen. Helsinki, 1969.

РБС
	Русско-белорусский словарь. Минск, 1953. Русско-белорусский словарь. Т. 1-2. Минск, 1982. Русско-белорусский словарь. Т. 1-3. Минск, 1993.

RES
	Revue des Etudes slaves. Paris, 1921 і наст.

RIEB
	Revue Internationale des Études Balkaniques. Beograd, 1934 і наст.

RiS
	Ricerche slavistiche. Roma, 1952 і наст.

RJAZU
	Rad Jugoslavenske Akademije znanosti і umjetnosti. Zagreb, 1867 і наст.

RL
	Ricerche Linguistiche. Roma, 1950 і наст.

PMJ
	Речник на македонскиот jазик: со српскохрватски толкувања. Т. 1-3. Скопjе, 1961-1966.

RO
	Rocznik Orientalistyczny. Kraków, 1915 і наст.

Rozprawy
	Rozprawy і Sprawozdania z Posiedzeń Wydziału Filologicznego Akademii Umiejętności. Kraków, 1874 і наст.

RomSl
	Romanoslavica. Bucureşti, 1958 і наст.

РР
	Русская речь. М., 1967 і наст.

РР н. с.
	Русская речь. Сборники, издаваемые Отделом словесных искусств. Новая серия. Вып. 1-3. Л., 1927-1928.

RRL
	Revue roumaine de linguistique. Bucureşti, 1963 і наст.

PC
	Роднае слова. Мінск, 1991 і наст. (з 1988 па 1991 г. - Беларуская мова і літаратура ў школе).

RS
	Rocznik Slawistyczny. Kraków, 1908-1993; Wrocław, 1994 і наст.

Руб.
	Пашкевіч M. І. Рубельскі лексіка-фразеалагічны слоўнік: для студэнтаў-філолагаў. Брэст, 2008.

Рудніцкі
	Rudnyc’kyj J. В. An etymological dictionary of the Ukrainian language. Vol. 1-2. Winnipeg, 1962-1982.

Рукап. лексікон
	Рукописный лексикон первой половины XVIII века. Л., 1964.

Русэк, Dzieje
	Rusek J. Dzieje nazw zawodów w językach słowiańskich. Warszawa, 1996.

РФВ
	Русский Филологический Вестник. Варшава [etc.], 1879-1917.

RHSJ
	Rječnik hrvatskoga ili srpskoga jezika / Jugoslavenska Akad. znanosti і umjetnosti. D. 1-23. Zagreb, 1880-1976.

Рыхгардт, Poln.
	Richhardt R. Polnische Lehnwörter im Ukrainischen. Berlin; Wiesbaden, 1957.

Рэгіян. асабл.
	Рэгіянальныя асаблівасці беларускай мовы, літаратуры і фальклору: тэз. дакл. рэсп. навук. канф. Гомель, 1973 і наст.

Рэг. сл. Віц.
	Рэгіянальны слоўнік Віцебшчыны. Ч. 1-2. Віцебск, 2012-2014.

Рэйзак
	Rejzek J. Český etymologický slovnik. Voznice, 2001.

Рэмбішэўска, Dynamika
	Rembiszewska D. Dynamika rozwoju gwary Knyszyna i okolic na Podlasiu w XX wieku. Warszawa, 2006.

Рэчак, Bohemizmy
	Reczek J. Bohemizmy leksykalne w języku polskim do końca XV wieku. Wrocław [etc.], 1968.

Рэчак, Sł.
	Reczek S. Podręczny słownik dawnej polszczyzny. Wrocław [etc.], 1968.

РЯШ
	Русский язык в школе. М., 1936 і наст.

Сабалеўскі, Лекции
	Соболевский А. И. Лекции по истории русского языка. М., 1907.

Сабанееў
	Сабанеев Л. П. Рыбы России: жизнь и ловля (уженье) наших пресноводных рыб. Т. 1-2. М., 2001.

Сабанееў, Жизнь
	Сабанеев Л. П. Жизнь и ловля пресноводных рыб. Киев, 1976.

Саднік-Айцэтмюлер
	Sadnik L., Aitzetmüller R. Vergleichendes Wörterbuch der slavischen Sprachen. Wiesbaden, 1963 і наст. Bd. 1 (A-В). Wiesbaden, 1975.

Саднік-Айцэтмюлер, Handwört.
	Sadnik L., Aitzetmüller R. Handwörterbuch zu den altkirchenslavischen Texten. Heidelberg, 1955.

Саевіч, Derywacja
	Sajewicz M. Derywacja sufiksalna osobowych nazw subjektów w nadnarwiańskich gwarach białoruskich Białostocczyzny: Deverbativa. Deadiectiva. Lublin, 2002.

Сакал.
	Соколовская А. С. Полесские названия одежды и обуви // Лексика Полесья: материалы для полесского диалектного словаря. М., 1968.

Сакалова, Обряды
	Соколова В. К. Весенне-летние календарные обряды русских, украинцев и белорусов. XIX - начало XX в. М., 1979.

Сакалоўскі, Ptaki
	Sokołowski E. Ptaki ziem polskich. T. 1-2. Warszawa, 1958.

SB
	Studi Baltici. Roma, 1931 і наст.

СБГ
	Словарь брянских говоров. Вып. 1-5 [А-Г]. Л., 1976-1984.

СбНУ
	Сборник за народни умотворения и народопис. София, 1889 і наст.

SbP (Brno)
	Sborník prací filosofické fakulty Brnĕnské university. A, Řada jazykovĕdná. Brno, 1952-2008.

СБЯ
	Славянское и балканское языкознание. М., 1975 і наст.

Svesl. zb.
	Sveslavenski zbornik. Zagreb, 1930.

SWO
	Słownik wyrazów obcych. Warszawa, 1974.

SWO, 1980
	Słownik wyrazów obcych. Warszawa, 1980.

СДЗб
	Српски диjалектолошки зборник. Београд, 1905 і наст.

CE
	Съпоставително езикознание. София, 1978 і наст.

Севарцян
	Севортян Э. В. Этимологический словарь тюркских языков. М., 1974 і наст.

Севарцян, Пробн.
	Севортян Э. В. Пробные статьи к этимологическому словарю тюркских языков: обще- и межтюркские основы. М., 1966.

SEK
	Boryś W., Popowska-Taborska Н. Słownik etymologiczny Kaszubszczyzny. T. 1-6. Warszawa, 1994-2010.

Семант. яз. единиц
	Семантика языковых единиц: сб. науч. тр. Минск, 1984.

Серб.
	Сербов И. А. Белорусы-сакуны: краткий этногр. очерк. Петроград, 1915.

Серб. Вічын
	Сербаў I. А. Вічынскія паляне. Этнаграфічны нарыс Беларускага Палесся. Ч. 1: Матэрыяльная культура // Этнаграфія. Антрапалогія. Псіхалогія. Псіхатэхніка і навуковая арганізацыя працы. Гісторыя мастацтва: зб. арт. Менск, 1928; Сербаў I. А. Вічынскія паляне. Матэрыяльная культура: этнаграфічны нарыс Беларускага Палесся. Мінск, 2005.

Серболуж. зб.
	Серболужицкий лингвистический сборник. М., 1963.

Сержп.
Серж.
	Сержпутовский А. К. Сказки и рассказы белорусов-полешуков (Материалы к изучению творчества белорусов и их говора). СПб., 1911; Сержпутоўскі А. К. Казкі і апавяданні Беларускага Палесся. Мінск, 1965; Сержпутоўскі А. К. Казкі і апавяданні беларусаў-палешукоў. Мінск, 1999.

Сержп. Борт.
Сержп. Бортн.
	Сержпутовский А. К. Бортничество в Белоруссии // Материалы по этнографии России. Т. 2. Петроград, 1914.

Сержп. Грам.
Сержп., Грам.
Серж. Грам.
	Сержпутовский А. К. Грамматический очерк белорусского наречия дер. Чудин Слуцкого уезда Минской губернии. СПб., 1911.

Сержп. Земл.
Сержп., Земл.
	Сержпутовский А. К. Земледельческие орудия Белорусского Полесья // Материалы по этнографии России. Т. 1. СПб., 1910.

Сержп. Казкі
Сержп., Казкі
Сержп., Каз.
	Сержпутоўскі А. К. Казкі і апавяданні беларусаў з Слуцкага павета. Л., 1926; Мінск, 2000.

Сержп. Отч.
Сержп., Отч.
	Сержпутовский А. К. Отчет о поездке в Гомельскую губернию в 1926 г. Менск, 1926.

Сержп. Прык.
	Касько У. К. Палескі дзівасіл. Беларускія народныя прыказкі, прымаўкі, выслоўі: ca скарбніцы А. К. Сержпутоўскага. Мінск, 2005.

Сержп. Прык. і прым.
	Сержпутоўскі А. К. Прыказкі і прымаўкі беларусаў (рукапіс; Інстытут мастацтвазнаўства, этнаграфіі і фальклору імя К. Крапівы НАН Беларусі).

Сержп. Прымхі
Сержп., Прымхі
	Сержпутоўскі А. Прымхі і забабоны беларусаў-палешукоў. Менск, 1930.

СіБФ
СБФ
	Славянский и балканский фольклор. М., 1978 і наст.

Сіг.
	Сігеда П. І. Матэрыялы да дыялектнага слоўніка Брэстчыны. Брэст, 1975 (рукапіс; Інстытут мовазнаўства імя Я. Коласа ПАН Беларусі).

Сікіміч, Etimologija
	Sikimić В. Etimologija i male folklorne forme. Beograd, 1996.

Сіманавич
	Симоновић Д. Ботанички речник научних и народних имена бильака са именима на руском, енглеском, немачком и француском jезику. Београд, 1959.

СИС
	Словарь иностранных слов. М., 1988.

SJSt
	Slovnik jazyka staroslovĕnského = Lexicon linguae palaeoslovenicae. T. 1-4 [Sv. 1-52]. Praha, 1958-1997. T. 5: Addenda et corrigenda. Praha, 2010.

Скарбы
	Цыхун А. П. Скарбы народнай мовы: з лексічнай спадчыны насельнікаў Гродзенскага р-ну. Гродна, 1993.

Скарбы₂
	Цыхун А. Скарбы народнай мовы: з лексічнай спадчыны насельнікаў Гарадзенскага раёну. Гародня, 2014.

Скарджус, Slav.
	Skardžius Р. Die slavischen Lehnwörter im Altlitauischen. Kaunas, 1931.

Скіт
	Skeat W. An Etymological Dictionary of the English Language. New Edition. Oxford, 1946.

Ск. нар. мовы
Скар. нар. мовы
	Скарбы народнай мовы: дыялект. зб. Мінск, 2005.

Скок
	Skok Р. Etimologijski rječnik hrvatskoga ili srpskoga jezika. Knj. 1-4. Zagreb, 1971-1974.

Скурат, Меры
	Скурат К. У. Даўнія беларускія меры (лексічны аналіз). Мінск, 1974.

SL
	Studia linguistica. Lund; Copenhagen, 1947 і наст.

Sł. XVI
	Słownik polszczyzny XVI wieku. Wrocław, 1966 і наст.

Слав. др.
	Славянские древности: этнолингв. слов. под ред. Н. И. Толстого. Т. 1-5. М., 1995-2012.

Slavia
	Slavia: Časopis pro slovanskou filologii. Praha, 1921 і наст.

Slavica Tarnopolensia
	Slavica Tarnopolensia. Тернопіль, 1994 і наст.

Slavistica Vilnensis
	Slavistica Vilnensis / Kalbotyra (2). Vilnius, 1997 і наст.

Слав. фил., Отгов.
	Славянска филология: материали за V Междунар. конгр. на славистите. Т. 1: Отговори на въпросите за научната анкета по езикознание. София, 1963.

Слав. языкозн.
СЯ, IX
	Славянское языкознание: докл. сов. делегации / V Междунар. съезд славистов. М., 1963 і наст. (з 1993 г. - Доклады российской делегации).

Слаўскі
	Sławski F. Słownik etymologiczny języka polskiego. T. 1-5 (A-Ł). Kraków, 1952-1982.

Слаўскі, Slavica
	Sławski F. Slavica: wybrane studia z językoznawstwa słowiańskiego. Wrocław [etc.], 1989.

Сл. Брэс.
Сл. Брэсц.
	Дыялектны слоўнік Брэстчыны. Мінск, 1989.

SLW
	Slawische Wortstudien / Sammelband des internationalen Symposiums zur etymologischen und historischen Erforschung des slawischen Wortschatzes. Bautzen, 1975.

Сл. иностр. сл.
	Словарь иностранных слов. М., 1932.

SŁłŚr.
	Słownik łaciny średniowiecznej w Polsce. Wrocław [etc.], 1953 і наст.

Сл. нар. фраз.
Бел. фраз.
Сл. бел. нар. фраз.
Сл. бел. фраз.
	Мяцельская Е. С., Камароўскі Я. М. Слоўнік беларускай народнай фразеалогіі. Мінск, 1972.

Слов. етим.
	Словенска етимологиjа данас. Београд, 2007.

Слово гов. Севера
	Слово в народных говорах русского Севера: сб. ст. Л., 1962.

Сл. охот.
	Словарь охотника. М., 1985.

Сл. ПЗБ
Сл. паўн.-зах.
	Слоўнік беларускіх гаворак паўночна-заходняй Беларусі і яе пагранічча. Т. 1-5. Мінск, 1979-1982.

Сл. рэг. лекс.
Сл. Гродз.
	Слоўнік рэгіянальнай лексікі Гродзеншчыны. Гродна, 1999.

СлРЯ 11-17
СлРЯ, 11-17
	Словарь русского языка 11-17 вв. Т. 1-. М., 1975 і наст.

Сл. Салж.
	Русский словарь языкового расширения / сост. А. И. Солженицын. М., 1990.

Анічэнка. Слоўнік
Сл. Скар.
Сл. Скарыны
	Слоўнік мовы Скарыны. Т. 1-3. Мінск, 1977-1994.

Sł. staroż. słów.
	Słownik starożytności słowiańskich. T. 1-8. Wrocław [etc.], 1961-1996.

Sł. starop.
	Słownik staropolski. T. 1-11. Kraków, 1953-2002.

Сл. ЦРБ
	Слоўнік гаворак цэнтральных раёнаў Беларусі. Т. 1. Мінск, 1990.

Сл. Эп.-Шып.
ЭШ
	Слоўнік Б. Эпімаха-Шыпілы / публ. Р. Семашкевіча // Полымя. № 7. Мінск, 1969.

Смаль-Стоцкі, Abriss
	Smal-Stockyj R. Abriss der ukrainischen Substantivbildung: Dissertation. Wien, 1915.

Смаль-Стоцкі, Приміт.
	Смаль-Стоцький P. Примітивний словотвір. Варшава, 1929.

Смачынскі
	Smoczyński W. Słownik etymologiczny języka litewskiego. Wilno, 2007.

Смирнов, Западн.
	Смирнов H. Западное влияние на русский язык в Петровскую эпоху. СПб., 1910.

Смул.
Смулкова, Słown.
	Smułkowa Е. Słownictwo z zakresu uprawy roli w gwarach wschodniej Białostocczyzny na tle wschodniosłowiańskim. Wrocław [etc.], 1968.

Смулкова, Białoruś
	Smułkowa E. Białoruś i pogranicza: Studia o języku i społeczeństwie. Warszawa, 2002.

Сной₁
Сной₂
Сной₃
	Snoj M. Slovenski etimolośki slovar. Ljubljana, 1997; Druga... izd. Ljubljana, 2003; Tretja izd. Ljubljana, 2016.

Собік, Poln.-rus.
	Sobik M. E. Polnisch-russische Beziehungen im Spiegel des russischen Wortschatzes des 17. und erster Hälfte des 18. Jahrhundert. Meinseinheim am Glan, 1969.

Сов. сл.
	Советское славяноведение. M., 1965-1992.

Совещ. ОЛА (Гомель)
	Совещание по Общеславянскому лингвистическому атласу (Гомель, 9-12 сент. 1975 г.): тез. докл. М., 1975.

Совещ. ОЛА (Ужгород)
	Совещание по Общеславянскому лингвистическому атласу (Ужгород, 25-28 сент. 1973 г.): тез. докл. М., 1973.

Сольмсен, Unters.
	Solmsen F. Untersuchungen zur griechischen Lautund Verslehre. Straßburg, 1901.

SOr
	Slavia Orientalis. Warszawa, 1957 і наст.

SOc
	Slavia Occidentalis. Poznań, 1921 і наст.

SP
	Słownik prasłowiański. Wrocław [etc.], 1974 і наст.

Сп. на БАН
	Списание на Българската академия на науките. Клон историко-филологичен и философско-обществен. София, 1911 і наст.

SPKOK PAN
SPK PAN OKr.
	Sprawozdania z Posiedzeń Komisji PAN. Oddział w Krakowie. Kraków.

SR
	Slavistična revija. Časopis za literarno zgodovino in jezik. Ljubljana, 1948 і наст.

Срази.
	Срезневский И. И. Материалы для словаря древнерусского языка по письменным памятникам. Т. 1-3. СПб., 1893-1912.

СРДГ
	Словарь русских донских говоров. Т. 1-3. Ростов н/Д, 1975-1976.

СРНГ
	Словарь русских народных говоров. М.; Л./СПб., 1965 і наст.

SReč
	Slovenska reč. Bratislava, 1932 і наст.

ССБМ
	Бардовіч А. М., Круталевіч М. М., Лукашанец А. А. Словаўтваральны слоўнік беларускай мовы. Мінск, 2000.

ССГ
	Словарь смоленских говоров. Вып. 1-11. Смоленск, 1974-2005.

SSJ
	Slovník slovenského jazyka. D. 1-6. Bratislava, 1959-1968.

SSlav.
	Studia Slavica Academiae Scientiarum Hungaricae. Budapest, 1955 і наст.

SSLP
	Studies in Slavic Linguistics and Poetics in Honor of Boris O. Unbegaun. New York, 1968.

ССРЛЯ
	Словарь современного русского литературного языка. Т. 1-17. М.;Л., 1950-1965.

Ст.-слав. сл.
СССл.
	Старославянский словарь (по рукописям X-XI вв.). 2-е изд. М., 1999.

Стан.
Станк.
	Станкевіч Я. Белорусско-русский (Великолитовско-русский) словарь = Беларуска-расійскі (Вялікалітоўска-расійскі) слоўнік = Byelorussian-russian (Greatlitvan-Russian) Dictionary. New York, [1990].

Станг, Urkundensprache
	Stang Chr. Die altrussische Urkundensprache der Stadt Polock. Oslo, 1939.

Станкевіч, Зб. тв.
Станкевіч. Творы
	Станкевіч Я. Збор твораў. Т. 1-2. Менск, 2002.

Станкевіч, Лексіка
	Станкевіч А. А. Лексіка іншамоўнага паходжання ў беларускіх народных гаворках. Гомель, 1996.

Станкевіч, Язык
	Станкевіч Ян. Язык і языкаведа. Выд. другое, папр. і дап. Вільня, 2007.

Статут 1529
	Статут Великого княжества Литовского 1529 г. Мінск, 1960.

Сташайтэне, Абстр. лекс.
	Сташайтене В. Абстрактная лексика: на материале старобелорусских письменных памятников XV-XVII веков. Вильнюс, 1973.

Ст.-бел. лексікон
	Прыгодзіч М. Р., Ціванова Г. К. Старабеларускі лексікон: падруч. перакл. слоўн. Мінск, 1997.

Ст.-бел. лексіконы
	Старабеларускія лексіконы / укл. А. Яскевіч. Мінск, 1992.

St. lingv. Polono–Jugosl., 2
	Studia Linguistica Polono-Jugoslavica. T. 2: Посветено на акад. Божидар Видоески. Скопjе, 1982.

Стойкаў, Соф. ученич. говор
	Стойко Ст. Софийският ученически говор (принос към българската социална диалектология) // Годишник на Софийския университет. Историко-филологически факултет. Вып. 42. София, 1945/46.

Стома Мяст.
	Стома В. Мае мястэчка. Мінск, 2014.

Стома Сл.
	Саўка Зм. Балтызмы ў слоўнічку Васіля Стомы «Дыялект Дзісеншчыны» // Запісы / Беларус. ін-т навукі і мастацтва. Кн. 23-24. Нью-Ёрк, 1999.

Струтынскі, Nazwy
	Strutyński J. Polskie nazwy ptaków krajowych. Wrocław [etc.], 1972.

Stud. Ros. Pozn.
	Studia Rossica Posnaniensia. Poznań, 1970 і наст.

Stud. Russica
	Studia Russica. Budapest, 1978 і наст.

Stud. fil.
	Studime Filologjikë. Tiranë, 1964 і наст.

Studia Etym. Brun.
Etym. Brun.
	Studia Etymologica Brunensia. Praha, 2000 і наст.

Стэндэр-Петарсан, Slav.-germ.
	Stender-Petersen A. Slavisch-Germanische Lehnwortkunde: Eine Studie über die ältesten germanischen Lehnwörter im Slavischen in sprach- und kulturgeschichtlicher Beleuchtung. Göteborg, 1927.

Суднік, Диалекты
	Судник T. М. Диалекты литовско-славянского пограничья. М., 1975.

Сузановіч, дыс.
	Сузанович В. Б. Имена существительные с суффиксом -л(о) и их производные в русском языке: дис. ... канд. филол. наук. М., 1973.

Супрун, Числит.
	Супрун А. Е. Славянские числительные: становление числительных как особой части речи. Минск, 1969.

Супр. чыт., II
	Белорусский и другие славянские языки: семантика и прагматика / Материалы Междунар. научн. конф. «Вторые Супруновские чтения». Минск, 2002.

Супр. чыт., III
	Палеославистика и компаративистика / Материалы Междунар. научн. конф. «Третьи Супруновские чтения». Минск, 2003.

Суффикс. словообр.
	Суффиксальное словообразование существительных в восточнославянских языках XV-XVII вв. М., 1974.

SFPS
	Studia z filologii polskiej i słowiańskiej. Warszawa, 1955 і наст.

Сцеп.
	Степанец Б. Крестьянская свадьба в южном Полесье: этнограф. очерк // Записки Северо-Западного отделения Русского географического общества. Кн. 1. Вильна, 1910.

SCL
	Studii şi Cercetări Lingvistice. Bucureşti, 1950 і наст.

ScSl
	Scando-Slavica. Copenhagen, 1954 і наст.

Сцяц.
Сцяцк.
	Сцяцко П. Дыялектны слоўнік (З гаворак Зэльвеншчыны). Мінск, 1970.

Сцяц. Нар.
	Сцяцко П. У. Народная лексіка (Бытавая лексіка гаворак Зэльвеншчыны). Мінск, 1970.

Сцяц. Сл.
Сцяцко Сл.
	Сцяцко П. У. Слоўнік народнай мовы Зэльвеншчыны. Гродна, 2005.

Сцяц. Словаўтвар.
Сцяц. Словаўтв.
Сцяц., Словаўтв.
Сцяцко, НЛС
Сцяцко, Словаўтв.
	Сцяцко П. У. Народная лексіка і словаўтварэнне. Мінск, 1972.

Сцяцко, Афікс. наз.
Сцяц. Афікс. наз.
Сцяц. БНС
	Сцяцко П. У. Беларускае народнае словаўтварэнне: афіксальныя назоўнікі. Мінск, 1977.

Сцяцко, Выбр. тв.
	Сцяцко П. У. Мовазнаўчы досвед: Выбр. тв. Ч. 1-2. Гродна, 2005.

Сцяш.
Сцяшк. МГ
Сцяшк., МГ
Сцяш. МГ
Сцяшк. Мат.
	Сцяшковіч Т. Ф. Матэрыялы да слоўніка Гродзенскай вобласці. Гродна, 1972.

Сцяшк.
	Сцяшковіч Т. Ф. Гаворкі Ваўкавыскага раёна Гродзенскай вобласці Беларускай ССР. Гродна, 1959.

Сцяшк. Сл.
Сцяшк., Сл.
Сцяш. Сл.
	Сцяшковіч Т. Ф. Слоўнік Гродзенскай вобласці. Мінск, 1983.

Сымоні-Сулкоўска, Transport
	Symoni-Sułkowska J. Słownictwo Warmii i Mazur: Transport i kommunikacja. Wrocław, 1958.

Сыхта
	Sychta B. Słownik gwar kaszubskich na tle kultury ludowej. T. 1-7. Wrocław, 1967-1976.

Сэндзік, Prasł.
	Sędzik W. Prasłowiańska terminologia rolnicza. Wrocław [etc.], 1977.

Сялішчаў, Старосл. яз.
	Селищев А. М. Старославянский язык. Ч. 1-2. М., 1951-1952.

Сяржаніна, Грыбы
Сярж., Грыбы
Сярж.
	Сяржаніна Г. I. Базідыяльныя грыбы Беларусі: Балетальныя. Агарыкальныя. Русулальныя. Мінск, 1994.

Сярж.-Яшк.
Сярж.–Яшк.
	Сяржаніна Г. І., Яшкін I. Я. Грыбы і грыбная кулінарыя: папуляр. энцыкл. давед. Мінск, 2005.

Сяржаніна, Грыбы
	Сяржаніна Г. I. Грыбы: Аскаміцэты. Базідыяміцэты (гастэраміцэты, гетэрабазідыяміцэты). Мінск, 1991.

Сяткоўскі, Bohemizmy
	Siatkowski J. Bohemizmy fonetyczne w języku polskim. Cz. 1-2. Wrocław, 1965-1970.

Сяткоўскі, Słów. nazwy
	Siatkowski J. Słowiańskie nazwy wykonawców zawodów w historii i dialektach. Warszawa, 2005.

Сяткоўскі, Słów. nazwy części ciała
	Siatkowski J. Słowiańskie nazwy części ciała w historii i dialektach. Warszawa, 2012.

Сяткоўскі, Studia
	Siatkowski J. Studia nad słowiańsko-niemeckimi kontaktami językowymi. Warszawa, 2015.

Талстая, Полес.
	Толстая С. М. Полесский народный календарь. М., 2005.

Талстой, Геогр.
	Толстой Н. И. Славянская географическая терминология: семасиолог. этюды. М., 1969.

Талстой, Избр. тр.
	Толстой Н. И. Избранные труды. Т. 1-3. М., 1997-1999.

Тамаш
	Tamás L. Etymologisch-historisches Wörterbuch der ungarischen Elemente im Rumänischen. Budapest, 1966.

Танец
	Васильева-Рождественская M. В. Историко-бытовой танец. М., 1987.

Танкоў, Опыт
	Тонков В. Опыт исследования воровского языка. Казань, 1930.

Тапароў
	Топоров В. И. Прусский язык: Словарь. Т. 1-5 (А-L). М., 1975-1990.

Тапароў-Трубачоў, Лингв. анал.
	Топоров В. Н., Трубачев О. Н. Лингвистический анализ гидронимов Верхнего Поднепровья. М., 1962.

Тарн.
Тарн., Studia
Тарнацкі, Studia
	Tarnacki J. Studia porównawcze nad geografią wyrazów (Polesie-Mazowsze). Warszawa, 1939.

TЗб.
	Тэрміналагічны зборнік. Вып. 1-5. Мінск, 1985-1993.

Тодараў, Этим. етюди
	Тодоров Т. А. Етимологични етюди. Произход на български думи. София, 1994.

Торб’ёрнсан, Liquid.
	Torbiörnsson Т. Die gemeinslavische Liquidametathese. Vol. 1-2. Uppsala, 1901-1903.

Торп
	Torp A. Urgermanischer Sprachschatz // Fick A. Vergleichendes Wörterbuch der indogermanischen Sprachen. 4. Aufl. Bd. 3. Göttingen, 1909.

Traditiones
	Traditiones: Zbornik Inštituta za slovensko narodopisje. Ljubljana, 1972 і наст.

Траўнічак
	Trávníček F. Slovník jazyka českého. Praha, 1952.

Траўтман
	Trautmann R. Baltisch-slavisches Wörterbuch. Göttingen, 1923.

Траўтман, Altpreuß.
	Trautmann R. Die altpreußischen Sprachdenkmäler. Göttingen, 1910.

Трахтэнберг, Муз.
	Трахтенберг В. Ф. Блатная музыка («жаргон» тюрьмы). СПб., 1908.

Трубачоў, Дополн.
Трубачоў-Фасмер
	Дадаткі А. М. Трубачова да рускага выдання // Фасмер М. Этимологический словарь русского языка. Т. 1 4. М., 1964-1973.

Трубачоў, История терм.
	Трубачев О. Н. История славянских терминов родства и некоторых древнейших терминов общественного строя. М., 1959.

Трубачоў, Происх.
	Трубачев О. Н. Происхождение названий домашних животных в славянских языках: этимол. исслед. М., 1960.

Трубачоў, Проспект
	Трубачев О. Н. Этимологический словарь славянских языков (праславянский лексический фонд): проспект. Пробные статьи. М., 1963.

Трубачоў, Ремесл. терм.
	Трубачев О. Н. Ремесленная терминология в славянских языках: этимология и опыт групповой реконструкции. М., 1966.

Трубачоў, Труды
	Трубачев О. Н. Труды по этимологии: Слово. История. Культура. Т. 1-4. М, 2004-2009.

Трубачоў, Этногенез.
	Трубачев О. Н. Этногенез и культура древнейших славян: лингв. исслед. М., 1991.

Трубачоў, Этногенез₂
	Трубачев О. Н. Этногенез и культура древнейших славян: лингв. исслед. Изд. 2-е, доп. М., 2002.

Труды знак.
	Труды по знаковым системам / Sign Systems Studies (з 1998 г.). Тарту/Tartu, 1964 і наст.

Труды ИРЯ
	Труды Института русского языка. М.; Л., 1949 і наст. (з 2014 г. -  Труды Института русского языка им. В. В. Виноградова).

Труды яз.
	Труды по языкознанию. Вып. 1. Минск, 1958.

Трух.
	Трухан Т. М., Клімчук Ф. Д. Лексіка апрацоўкі льну: тэмат. слоўн., лекс. атлас. Мінск, 2006.

TC
ТС
Тур.
	Тураўскі слоўнік. Т. 1-5. Мінск, 1982-1987.

ТСБМ
	Тлумачальны слоўнік беларускай мовы. Т. 1-5. Мінск, 1977-1984.

Тувім, Słownik
	Tuwim J. Polski słownik pijacki i antologia bachiczna. Warszawa, 1959.

Тувім, Słownik 2005
	Tuwim J. Polski słownik pijacki i Antologia bachiczna. Warszawa; Rzeszów, 2005.

Typ.
	Turska H. Słownik trudniejszych wyrazów białoruskich w tomie 5 i 6 Ludu Białoruskiego M. Federowskiego // Federowski M. Lud Białoruski na Rusi Litewskiej: materiały do etnografii słowiańskiej zgromadzone w latach 1877-1905. T. 7: Supl. do tomu 5 i 6. Warszawa, 1969.

Тураўшч.
	Тураўшчына: мінулае, сучаснасць, будучыня. Тураў; Мінск, 2000 і наст.

Турска, Powstanie
	Turska H. O powstaniu polskich obszarów językowych na Wileńszczyźnie = Турска Г. О происхождении польскоязычных ареалов в Вильнюсском крае. Vilnius, 1995.

Тэксты
	Teksty gwarowe z Białostocczyzny z komentarzem językowym: praca zbiorowa. Warszawa, 1972.

Тюркизмы вост.-слав.
	Тюркизмы в восточно-славянских языках: сб. ст. М., 1974.

Тюрк. лекс. элем.
	Тюркские лексические элементы в восточных и западных славянских языках: тез. докл. второго симп. Минск, 1969.

Тэрм. бюлетэнь
	Тэрміналагічны бюлетэнь. Мінск, 1997 і наст.

UAJb
	Ural-Altaische Jahrbücher. Wiesbaden, 1952 і наст.

УДЗб
	Український діалектологічний збірник. Кн. 1-2. Київ, 1928-1929; Кн. З [пам’яті Тетяни Назарової]. Київ, 1997.

УЗ БГУ
	Ученые записки (Белгосуниверситет им. В. И. Ленина). Сер. филол. Минск, 1940-1956.

УЗ ИС
	Ученые записки Института славяноведения. Т. 1-30. М.; Л./М., 1948/1949-1966. [Т. 1(1) - 1948; Т. 1(2) - 1949.]

УЗ Казан. ПИ
	Ученые записки Казанского педагогического института. Казань, 1939-1980.

УЗ КиргУ
	Ученые записки филологического факультета Киргизского университета. Вып. 1-13. Фрунзе, 1954-1964.

УЗ МОПИ
	Ученые записки Московского областного педагогического института им. Н. К. Крупской. М., 1939 і наст. (з 1998 г. - Вестник Московского государственного областного университета).

УЗ СПИ
	Ученые записки Смоленского государственного педагогического института. Вып. 1-24. Смоленск, 1949-1970.

УЗ УУ
	Ученые записки Уральского государственного университета. Свердловск, 1948-1971.

Узвышша
	Узвышша: часопіс літаратуры, мастацтва і крытыкі. Менск, 1927-1931; Узвышша: часопіс літаратуры, мастацтва і крытыкі Беларускага літаратурна-мастацкага згуртаваньня «Узвышша». Мінск, 2007 і наст.

Уладз.
Влад.
	Владимирская Н. Г. Полесская терминология ткачества // Лексика Полесья: материалы для полесского диалектного словаря. М., 1968.

Уладзім.
	Уладзіміраў У. Лекавыя расліны ў народнай медыцыне Барысаўскай акругі // Наш край. № 11. Менск, 1927.

Улас.
	Уласевіч В. I., Даўгулевіч Н. М. Слоўнік новых слоў беларускай мовы. Мінск, 2009.

Уласт
Власт
	Власт [Ластоўскі В.]. Беларускія аднасловы // Крывіч. № 5. Коўна, 1923.

Уленбек
	Uhlenbeck С. С. Kurzgefaßtes etymologisches Wörterbuch der altindischen Sprache. Amsterdam, 1898-1899.

УМШ
	Українська мова в школе. Київ, 1951-1963.

Унбегаўн, La langue
	Unbegaun В. La langue russe au XVIe siècle (1500-1550). 1: La flexion des noms. Paris, 1935.

Унбегаўн, Sel. Papers
	Unbegaun В. O. Selected Papers an Russian and Slavonic Philology. Oxford, 1969.

Усачова, Слав. ихт. терм.
	Усачева В. В. Славянская ихтиологическая терминология: Принципы и способы номинации. Обратный словарь. М., 2003.

Файст
	Feist S. Vergleichendes Wörterbuch der gotischen Sprache Mit Einschluss des Krimgotischen und sonstiger zerstreuter Überreste des Gotischen. 3. Aufl. Leiden, 1939.

Фалінская, Leksyka hodowli
	Falińska В. Leksyka dotycząca hodowli: Na mapach Ogólnosłowiańskiego Atlasu Językowego. Cz. I: Substantiva. Białystok, 2001.

Фалінская, Sł. tkac.
	Falińska B. Polskie słownictwo tkackie na tle słowiańskim. T. 1-3. Wrocław [etc.], 1974-1980.

Фальк-Торп
	Falk Н. S., Torp А. Norwegisch-dänisches etymologisches Wörterbuch. T. 1-2. Heidelberg, 1910-1911.

Фалют.
	Фалютинский К. Народные праздники, увеселения, поверья и суеверные обряды жителей Белоруссии // Вестник Европы. № 5, 6. М., 1828.

Фанетыка бел. мовы
	Крывіцкі А. А., Падлужны А. 1. Фанетыка беларускай мовы. Мінск, 1984.

Фасмер
	Фасмер М. Этимологический словарь русского языка. Т. 1-4. М., 1964-1973.

Фасмер, Wörterb.
	Vasmer М. Russisches etymologisches Wörterbuch. Bd. 1-3. Heidelberg, 1953-1958.

Фасмер, Этюды
	Фасмер M. Греко-славянские этюды. III: Греческие заимствования в русском языке // Сборник ОРЯС. Т. 86. СПб., 1909.

Федар.
Федар. 1
Федар. 2
Федар. 3
Федар. 4
Федар. 5
Федар. 6
Федар. 7
Федар. I
Федар. IV
Федар. VI
Федар. VII
Федароўскі
	Federowski М. Lud Białoruski na Rusi Litewskiej: materiały do etnografii słowiańskiej zgromadzone w latach 1877-1905. T. 1-7. Warszawa, 1897-1969.

Федз.-Доўб.
Федз.–Доўб.
Фед.–Долб.
	Федюшин А. В., Долбик М. С. Птицы Белоруссии. Минск, 1967.

ФЗ
	Филологические записки. Воронеж, 1860-1917; 1993 і наст.

Фік-Торп
	Fick А. Vergleichendes Wörterbuch der indogermanischen Sprachen. Bd. 3: Wortschatz der Germanischen Spracheinheit. Umgearb. von A. Torp. Göttingen, 1909.

Філін, Образ.
	Филин Ф. П. Образование языка восточных славян. М., 1962.

Філін, Происх.
	Филин Ф. П. Происхождение русского, украинского и белорусского языков: ист.-диалект. очерк. Л., 1972.

Флінт, Птицы
	Флинт В. Е., Бёме Р. Л., Костин Ю. В., Кузнецов А. А. Птицы СССР. М., 1968.

Флора
	Матэрыялы да вывучэння флоры і фауны Беларусі. Т. 1-7. Менск, 1927-1932.

Фогарашы, Beiträge
	Fogarasi М. Beiträge zur Geschichte der internationalen Bildungssuffixe des Russischen. Budapest, 1965.

Фрыск
	Frisk H. Griechisches etymologisches Wörterbuch. Bd. 1-3. Heidelberg, 1954-1972.

Фрэнкель
	Fraenkel E. Litauisches etymologisches Wörterbuch. Bd. 1-2. Heidelberg; Göttingen, 1962-1965.

Фрэнкель, Balt. Spr.
	Fraenkel E. Die baltischen Sprache. Heidelberg, 1950.

FUF
	Finnisch-ugrische Forschungen: Zeitschrift für finnisch-ugrische Sprachund Volkskunde. Helsingfors; Leipzig, 1901 і наст.

Хаас, Elem.
	Haas O. Das frühitalische Element: Versuch über die Sprache der ersten Indogermanen Italiens. Wien, 1960.

Харузін, Слав. жил.
	Харузин А. Славянское жилище в Северо-Западном крае: из материалов по истории развития славянских жилищ // Виленский временник. Кн. 2. Вильна, 1907.

HDZb
	Hrvatski dijalektološki zbornik. Razred za filološke znanosti. Zagreb, 1956 і наст.

Хенсель, Słowiańszczyzna
	Hensel W. Słowiańszczyzna wczesnośredniowieczna: Zarys kultury materialnej. Warszawa, 1956.

Xoanc, Reallex.
	Reallexicon der germanischen Altertumskunde / Hrsg. I. Hoops. Bd. 1-4. Straßburg, 1911-1919.

Хромчанка, дыс.
	Хромчанка А. Р. Паўночнамастоўскія гаворкі (арэальная, генетычная і тыпалагічная характарыстыка): дыс. ... канд. філал. навук. Мінск, 1997.

Хромчанка, Паўн.-маст. гав.
	Хромчанка А. Р. Паўночна-мастоўскія гаворкі: арэальная, генетычная і тыпалагічная характарыстыка. Мінск, 2004.

Хрэст. гіст.
	Хрэстаматыя па гісторыі беларускай мовы. Ч. 1-2. Мінск, 1961-1962.

Цвяткоў. Запіскі 2
	Цьвяткоў Л. Некаторыя рысы іншаславянскай фанетыкі ў беларускім лексічным матэрыяле // Зап. Аддз. гуманітар. навук Ін-та беларус. культуры. Кн. 2: Працы класа філалогіі. Т. 1. Менск, 1928.

Цікцін
	Tiktin Н. Rumänisch-deutsches Wörterbuch = Dicţionar român-german. Bd. 1-3. Bucureşti, 1903-1925.

Цімчанка, Істор.
	Тимченко С. Історичний словник українського язика. Т. I (A-Ж). Харків; Київ, 1930-1932.

Цітка, Kronika
	Citko L. «Kronika Bychowca» na tle historii i geografii języka białoruskiego. Białystok, 2006.

Цупіца, Gutturale
	Zupitza E. Die germanischen Gutturale. Berlin, 1896.

Цуржын, Studie
	Cuřín F. Studie z historické dialektologie a toponomastiky Čech. Praha, 1967.

ZfBalk
	Zeitschrift für Balkanologie. Wiesbaden, 1962 і наст.

ZfSl
	Zeitschrift für Slawistik. Berlin, 1956 і наст.

ZfslPh
	Zeitschrift für slavische Philologie. Leipzig; Heidelberg, 1924 і наст.

Цыганенка
	Цыганенко Г. П. Этимологический словарь русского языка. Киев, 1970.

Цых.
	Цыхун А. П. Слоўнік Гродзеншчыны (рукапіс).

Цыхун, Выбр. пр.
	Цыхун Г. А. Выбраныя працы: беларусістыка, славістыка, арэальная лінгвістыка. Мінск, 2012.

Цэйтлін, Лексика
	Цейтлин Р. М. Лексика старославянского языка: опыт анализа мотивированных слов по данным древнеболгарских рукописей Х-ХІ вв. М., 1977.

Цюркізмы
	Тюркизмы в восточно-славянских языках. М., 1974.

Цярохін, Охота
	Терехин С. Ф. Охота в Белоруссии. Минск, 1986.

Чал.
	Чалавек: тэмат. слоўн. Мінск, 2006.

Чарадз. казкі
	Чарадзейныя казкі. Ч. 1-2. Мінск, 1973-1978 (Беларуская народная творчасць).

Чаранэску
	Cioranescu A. Diccionario etimológico rumano. Tenerife, 1958-1966.

Чарапанава, Геогр.
	Черепанова Е. А. Народная географическая терминология Черниговско-Сумского полесья. Сумы, 1984.

Чарных
	Черных П. Я. Историко-этимологический словарь современного русского языка. Т. 1-2. М., 1994.

Чарныш, Слов. лексика
	Черниш Т. О. Слов’янська лексика в історико-етимологічному висвітленні (гніздовий підхід). Київ, 2003.

Чарнышоў, Избр. тр.
	Чернышев В. И. Избранные труды. Т. 1-2. М., 1970.

Чатырохсотлецце
	Чатырохсотлецце беларускага друку = Quadringentennium typorum alboruthenicorum: 1525-1925. Менск, 1926.

Чач.
	Czeczot J. Piosnki wieśniacze z nad Niemna i Dźwiny. KH. 6: Piosnki wieśniacze z nad Niemna i Dźwiny, niektóre przysłowia i idiotyzmy w mowie sławiano-krewickiej, s postrzeżeniami nad nią uczynionemi. Wilno, 1846; Фальклор у запісах Яна Чачота і братоў Тышкевічаў. Мінск, 1997. (Беларуская народная творчасць).

Česká slavistica, 1998
	Česká slavistica 1998: Češké přednášky pro XII. Mezinár. sjezd slavistů. Praha, 1998.

Чуб.
	Труды этнографическо-статистической экспедиции в Западно-Русский край, снаряженной Русским географическим обществом: Юго-Западный отдел: материалы и исслед., собр. д. чл. П. П. Чубинским. Т. 1-7. СПб., 1872-1878.

Чуд.
Чудов.
	Чудовский Н. И. Материалы для изучения белорусских говоров. Слуцкий говор // Русский филологический вестник. Т. 40, № 3-4. Варшава, 1894.

Чурко
	Чурко Ю. М. Белорусский хореографический фольклор. Минск, 1990.

Чэкман, Гісторыя
	Чэкман В. М. Гісторыя проціпастаўленняў па цвёрдасці/мяккасці ў беларускай мове. Мінск, 1970.

Чэрн.
	Чернякевич Н. П. Из лексики села Ровбицк Пружанского района Брестской области // Весн. БДУ. Сер. IV, Філалогія. Журналістика. Педагогіка. № 1, 3. Мінск, 1971; № 2, 3. Мінск, 1972.

Чэрн. Атлас
	Чэрнякевіч Ю. В. Атлас гаворак паўночна-ўсходняй Брэстчыны. Мінск, 2009.

Шавялёў, Prehistory
	Shevelov G. Y. A prehistory of Slavic: The historical Phonology of Common Slavic. Heidelberg, 1964.

Шадурскі, дыс.
	Шадурский И. В. Сельскохозяйственная лексика в старобелорусском письменном языке: дис. ... канд. филол. наук. Минск, 1967.

Шакун, Гісторыя
	Шакун Л. М. Гісторыя беларускай літаратурнай мовы: вучэб. дапам. для ВНУ. Мінск, 1963.

Шалудзька, Нім.
	Шелудько Д. Німецькі елементи в українській мові // Збірник комісії для дослідження історії української мови. Т. 1 .Київ, 1931.

Шалудзька, Rum.
	Scheludko D. Rumänische Elemente im Ukrainischen // Balkan-Archiv. Bd. 2. Leipzig, 1926.

Шанскі
	Этимологический словарь русского языка. Т. 1-. / авт.-сост., ред. Н. М. Шанский. М., 1963 і наст.

Шанскі-Баброва
	Шанский Н. М., Боброва Т. А. Этимологический словарь русского языка. М., 1994.

Шантрэн
	Chantraine Р. Dictionnaire étymologique de la langue grecque. Histoire des mots. T. 1-4. Paris, 1968-1980.

Шаравольскі, Рум.
	Шаровольський І. В. Румунські запозичені слова в українській мові // Збірник заходознавства УАН. № 1. Київ, 1929.

Шат.
Шатэр.
	Шатэрнік М. Краёвы слоўнік Чэрвеншчыны. Менск, 1929.

Шатал.
	Шаталава Л. Ф. Беларускае дыялектнае слова. Мінск, 1975.

Шаўр, Etymologie
	Šaur V. Etymologie slovanských přibuzenských terminů. Praha, 1975.

Шахматаў, Очерк
	Шахматов А. А. Очерк современного русского литературного языка. М., 1941.

Шахматаў, Очерк древн.
	Шахматов А. А. Очерк древнейшего периода истории русского языка // Энциклопедия славянской филологии. Вып. 11.1. Петроград, 1915.

Швеля
	Šwjela В. Dolnoscrbsko-nĕmski słownik. Budyšin, 1963.

Шлюб.
	Шлюбскі Ал. Матэрыялы для вывучэння фальклору і мовы Віцебшчыны. Ч. 1. Менск, 1927.

Шмід, Vok.
	Schmidt J. Zur Geschichte des indogermanischen Vokalismus. Abt. 1-2. Weimar, 1871-1875.

Шмітак, Mit.
	Šmitek Z. Kristalna gora: Mitološko izročilo slovencev. Ljubljana, 1998.

Шмярко
	Шмярко Я. П., Мазан І. П. Лекавыя расліны ў комплексным лячэнні. Мінск, 1989.

Шн.
	Шейн П. В. Материалы для изучения быта и языка русского населения Северо-Западного края. Т. 1-3. СПб., 1887-1902.

Шн. Песні
Шн., Песні
	Шейн П. В. Белорусские народные песни с относящимися к ним обрядами, обычаями и суевериями, с приложением объяснительного словаря и грамматических примечаний. СПб., 1874.

Шпіл.
	Шпилевский П. Словарь белорусского наречия (рукапіс; Санкт-Пецярбург; Архіў Бібліятэкі РАН).

Шпіл. Абрад.
	Шпілеўскі П. М. Беларусь у абрадах і казках. Мінск, 2010.

Шпіл. Моз.
	Шпилевский П. М. Мозырщина (Из путевых заметок по Западно-Русскому краю) // Архив исторических и практических сведений, относящихся до России. Кн. 3. СПб., 1859.

Шпіл., Путешествие
Шпіл. Путешеств.
	Шпилевский П. М. Путешествие по Полесью и белорусскому краю. Минск, 1992.

Sprache
	Die Sprache: Zeitschrift für Sprachwissenschaft. Wien, 1949 і наст.

Шпэхт, Ursprung
	Specht F. Der Ursprung der Indogermanischen Deklination. Göttingen, 1944.

Штэрн, Wörterbuch
	Stern H. Wörterbuch zum jiddishen Lehnwortschatz in den deutschen Dialekten. Tübingen, 2000.

Шуба, Прыназ.
	Шуба П. П. Прыназоўнік у беларускай мове. Мінск, 1971.

Шуба, Прыслоўе
	Шуба П. П. Прыслоўе ў беларускай мове: марфал. нарыс. Мінск, 1962.

Шульгач, Прасл. гідронім.
	Праслов’янський гідронімний фонд (фрагмент реконструкції). Київ, 1998.

Шульцэ, Kl. Schr.
	Schulze W. Kleine Schriften. Göttingen, 1933.

Шустар-Шэўц
	Schuster-Šewc H. Historisch-etymologisches Wörterbuch der oder- und niedersorbichen Sprache. Bd. 1-5. Bautzen, 1978-1996.

Шутц, Geograph.
	Schütz J. Die geographische Terminologie des Serbokroatischen. Berlin, 1957.

Шушк.
	Корань H. Д., Шушкевич М. С. Полесская строительная терминология // Лексика Полесья: материалы для полесского диалектного словаря. М., 1968.

Шцібэр, Zarys
	Stieber Z. Zarys gramatyki porównawczej języków słowiańskich. Cz. 1-2. Warszawa, 1969-1973.

Шчарб.
Шчар.
	Шчарбакова I. M. Прадметная ссльскагаспадарчая лексіка мінска-маладзечанскіх гаворак // Вопросы литературы и языка. Минск, 1968.

Шчарбакова-Бруева
	Щербакова О. И., Бруева Е. Т. Социально-корпоративная лексика. Словарь жаргона преступников: учеб. пособие № 50/23-3 дсп. Минск, 1994.

Шымк. Сл.
	Словник українскої мови Ф. С. Шимкевича // Галас Б. К. Ф. С. Шимкевич як лексикограф і українське словникарство (кінець XVIII - початок XX ст.). Ужгород, 1955.

Шымк. Собр.
Шым. Собр.
	[Шимкевич Ф. С.] Словник білоруської мови Ф. С. Шимкевича: Собраніе слов литовско-русскаго (бѣлорусскаго) нарѣчія // Галас Б. К.

Ф. С. Шимкевич як лексикограф і українське словникарство (кінець XVIII
	початок XX ст.). Ужгород, 1995.

Шымкевіч, Корнеслов
	Шимкевич Ф. Корнеслов русского языка, сравненного со всеми главнейшими славянскими наречиями и с двадцатью четырьмя иностранными языками. Ч. 1-2. СПб., 1842.

Шымкевич, Покажчик
	Покажчик білоруської лексики в «Корнеслове русского языка...» Ф. С. Шимкевича (1842) // Галас Б. К. Ф. С. Шимкевич як лексикограф і українське словникарство (кінець XVIII - початок XX ст.). Ужгород, 1955.

Шыпава, Сл. тюрк.
	Шипова Е. Н. Словарь тюркизмов в русском языке. Алма-Ата, 1976.

ЭБ
	Этнаграфія Беларусі: энцыкл. Мінск, 1989.

ЭИ
Этим. иссл.
	Этимологические исследования. Екатеринбург, 1981 і наст.

ЭИРЯ
	Этимологические исследования по русскому языку. Вып. 1-10. М., 1960-1993.

Элезавіч
	Елезовіћ Г. Речник косовско-метохиског диjалекта. Св. 1-2. Београд, 1932-1935.

Энгелькінг, Klątwa
	Engelking A. Klątwa. Rzecz o ludowej magii słowa. Wrocław, 2000.

Эндзелін, Darbu
	Endzelīns J. Darbu izlase. S. 1-4. Rīga, 1971-1982.

Эндзелін, Слав.-балт. эт.
	Эндзелин И. М. Славяно-балтийские этюды. Харьков, 1911.

ЭПБ
	Энцыклапедыя прыроды Беларусі. Т. 1-5. Мінск, 1983-1986.

Эр.
Эрэм.
	Эрсмич И. Очерки белорусского Полесья. Вильна, 1868.

Эрну-Мейе
	Ernout A., Meillet A. Dictionnaire étymologique de la langue latine. Histoire des mots. 4e éd. Paris, 1959.

ЭСБМ
	Этымалагічны слоўнік беларускай мовы. Т. 1-. Мінск, 1978 і наст.

ESJSt
	Etymologický slovník jazyka staroslovĕnského. Sv. 1-. Praha; Brno, 1989 і наст.

ESSJ, пробны сшытак
	Etymologický slovník slovanských jazyků. Ukäzhové čislo. Brno, 1966.

ESSJ SG
	Etymologický slovník slovanských jazyků. Slova gramatická a zájmena / sest. F. Kopečný. Sv. 1-2. Praha, 1973-1980.

Etnolingwistyka
	Etnolingwistyka: Problemy języka i kultury. Lublin, 1988 і наст.

ЭССЯ
	Этимологический словарь славянских языков. Праславянский лексический фонд. Вып. 1-. / под ред. О. Н. Трубачева. М., 1974 і наст.

Этимол. слов
	Этимология русских диалектных слов. Свердловск, 1978.

Этимология
	Этимология. М., 1963 і наст.; Труды Института русского языка им. В. В. Виноградова. IV: Этимология. М., 2015 і наст.

Этнагр. зб.
	Этнаграфічны зборнік: дакл. аддз. этнаграфіі і Геагр. т-ва Беларускай ССР). Мінск, 1975.

Этнолингвистика текста
	Этнолингвистика текста: семиотика малых форм фольклора: тез. и предварит. материалы к симп. Ч. 1-2. М., 1988.

Etym. Brunensia
	Etymologica Brunensia: Sborník Oddĕlení historickosrovnávací jazykovĕdy. Praha, 1978.

ЭШ, рук.
	Слоўнік Б. Эпімаха-Шыпілы (рукапіс; Санкт-Пецярбург; Архіў Бібліятэкі РАН).

Юбил. слав. сб.
	Юбилеен славистичен сборник: сб. с докл. от Междунар. славист. конф. <...> в Югозападния ун-т «Неофит Рилски». Благоевград, 2005.

Юнгман
	Jungmann J. Slovník česko-nĕmecký. D. 1-5. Praha, 1835-1839.

Юргялевіч, Курс
	Юргялевіч П. Я. Курс сучаснай беларускай мовы з гістарычнымі каментарыямі. Мінск, 1974.

Юркоўскі, Ukr. hydrogr.
	Jurkowski М. Ukraińska terminologia hydrographiczna. Wrocław [etc.], 1971.

Юрч.
	Юрчанка Г. Ф. Дыялектны слоўнік (З гаворак Мсціслаўшчыны). Мінск, 1966.

Юрч. Вытв.
Юрч., Вытв.
Юрч., Вытв. сл.
Юрч., Нар. вытв. сл.
	Юрчанка Г. Ф. Народнае вытворнае слова: з гаворкі Мсціслаўшчыны: слоўн.: у 3 вып. Мінск, 1981-1985.

Юрч. Жыв.
Мсцісл., Полымя, 1987, 7
	Юрчанка Г. Жывое народнае слова // Полымя. № 7. Мінск, 1987.

Юрч. Крыл.
	Юрчанка Г. Крылатыя залацінкі Мсціслаўшчыны. Магілёў, 2001.

Юрч. Мудр.
	Юрчанка Г. Ф. Народнае мудраслоўе. Мінск, 2002.

Юрч. Сін.
	Юрчанка Г. Ф. Народная сінаніміка. Мінск, 1969.

Юрч. СНЛ
	Юрчанка Г. Ф. Сучасная народная лексика: з гаворкі Мсціслаўшчыны: слоўн.: у 3 ч. Мінск, 1993-1998.

Юрч. СНС
Юрч. Суч. нар. сл.
	Юрчанка Г. Ф. Сучаснае народнае слова: з гаворкі Мсціслаўшчыны: слоўн.: - Мінск, 1988.

Юрч. Фраз. 1
Юрч. Фр. 1
	Юрчанка Г. Ф. І коціцца і валіцца: устойлівыя словазлучэнні ў гаворцы Мсціслаўшчыны. [А-3]. - Мінск, 1972.

Юрч. Фраз. 2
	Юрчанка Г. Ф. І сячэ і паліць: устойлівыя словазлучэнні ў гаворцы Мсціслаўшчыны. [І-П]. Мінск, 1974.

Юрч. Фраз. 3
Юрч. Фр. 3
Юрч. Фр.
	Юрчанка Г. Ф. Слова за слова: устойлівыя словазлучэнні ў гаворцы Мсціслаўшчыны. [P-Я]. Мінск, 1977.

Яблонскіс
	Lietuviški žodžiai senosios Lietuvos raštinių kalboje. D. 1: Tekstai / Sudarė Konstantinas Jablonskis. Kaunas, 1941.

Яварніцкі, Словник
	Яворницький Д. І. Словник української мови. Т. 1: A-К. Катеринослав, 1920.

Ягораў
	Егоров В. Г. Этимологический словарь чувашского языка. Чебоксары, 1964.

Язык культуры
	Язык культуры: семантика и грамматика: к 80-летию со дня рождения акад. Никиты Ильича Толстого. М., 2004.

Язык, слово, действительность
	Язык, слово, действительность: материалы Междунар. науч. конф. Ч. 1-2. Минск, 2000.

ЯиМ
	Язык и мышление = Le langage et la mentalite. Вып. 1-10. Л., 1933-1940.

Якабсон, Writings
	Jakobson R. Selected Writings. Vol. 1-8. The Hague [etc.], 1962-1988.

Якубовіч, Drogi słów
	Jakubowicz M. Drogi słów na przestrzeni wieków: zarys słownika motywacji semantycznych na materiale przymiotników słowiańskich odziedziczonych z prasłowiańszczyzny. Warszawa, 2010.

Ян.
	Янкова T. С. Дыалектны слоўнік Лоеўшчыны. Мінск, 1982.

Янк.
	Янкоўскі Ф. М. Дыялектны слоўнік. Вып. 1-3. Мінск, 1959-1970.

Янк. БП
	Беларускія прыказкі, прымаўкі, фразеалагізмы / склаў Ф. Янкоўскі. Мінск, 1962.

Янк. БФ
БФ
	Янкоўскі Ф. Беларуская фразеалогія: фразеалагізмы, іх значэнне, ужыванне. Мінск, 1968.

Янк. Мат.
Мат. Янк.
	Матэрыялы для слоўніка народна-дыялектнай мовы / пад рэд. Ф. М. Янкоўскага. Мінск, 1960.

Янкоўскі, Бел. мова
	Янкоўскі Ф. М. Беларуская мова. Мінск, 1978.

Яновіч, Наречие
	Янович Е. И. Наречие в истории русского языка: генезис и функционирование основных морфологических типов производных наречий. Минск, 1978.

Янук.
	Янукевіч В. С. Дыялектныя назвы ежы ў гаворцы в. Лісавічы Докшыцкага раёна // Весн. БДУ. Сер. IV, Філалогія. Журналістыка. Педагогіка. 1971, № 1.

Яруш.
	Ярушевич А. И. Русско-белорусский словарь (рукапіс; Беларускі дзяржаўны архіў-музей літаратуры і мастацтва; Мінск).

Яўс.
	Яўсееў Р. Маці казала так... : З гаворкі Бялыніцкага раёна. Мінск, 1978; Рукапісныя матэрыялы для слоўніка Бялыніцкага раёна Магілёўскай вобласці: Абарот - Сівун.

Яшк.
Яшкін
	Яшкін І. Я. Беларускія геаграфічныя назвы. Мінск, 1971.

Яшк. Мясц.
	Яшкін І. Я. Мясцовая беларуская лексіка 1851-1874 гадоў у матэрыялах фондаў Аддзела рукапісаў Навуковай бібліятэкі Вільнюскага ўніверсітэта// Acta Baltico-Slavica. Rocz. 22. Warszawa, 1994.

Яшкін, Слоўнік
	Яшкін І. Я. Слоўнік беларускіх мясцовых геаграфічных тэрмінаў: Тапаграфія. Гідралогія. Мінск, 2005.

Яшкін, Узаемадзеянне
	Яшкін І. Я. Узаемадзеянне рознадыялектных сістэм: фанетыка. Мінск, 1976.
